[
  {
    "id": "department_store_716",
    "kg_name": "department_store",
    "split": "train",
    "question": "Return ids of all the products that are supplied by supplier id 2 and are more expensive than the average price of all products.",
    "original_sparql": "SELECT ?T1_product_id WHERE { ?T1 a :product_suppliers . ?T2 a :products . ?T1 :product_suppliers\\#ref-product_id ?T2 .  ?T1 :product_suppliers\\#product_id ?T1_product_id . ?T1 :product_suppliers\\#supplier_id ?T1_supplier_id . ?T2 :products\\#product_price ?T2_product_price . FILTER(?T1_supplier_id = 2 && ?T2_product_price > (?aggregation_T23_product_price_182)) .       {SELECT (avg( ?T23_product_price) as ?aggregation_T23_product_price_182 ) WHERE { ?T23 a :products . ?T23 :products\\#product_price ?T23_product_price .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_id WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_price WHERE {\n      ?T2 a :products .\n      ?T2 :products\\#product_price ?T2_product_price\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__product_suppliers/sparql> {\n    ?T1 a :product_suppliers .\n      ?T1 :product_suppliers\\#ref-product_id ?T2 .\n      ?T1 :product_suppliers\\#product_id ?T1_product_id .\n      ?T1 :product_suppliers\\#supplier_id ?T1_supplier_id\n      FILTER(?T1_supplier_id = 2 && ?T2_product_price > (?aggregation_T23_product_price_182))\n  }\n  {\n    SELECT (avg( ?T23_product_price) as ?aggregation_T23_product_price_182 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/department_store__products/sparql> {\n        ?T23 a :products . ?T23 :products\\#product_price ?T23_product_price . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "department_store_720",
    "kg_name": "department_store",
    "split": "train",
    "question": "Find the id and name of the staff who has been assigned for the shortest period.",
    "original_sparql": "SELECT ?T1_staff_id ?T1_staff_name WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\\#ref-staff_id ?T1 .  ?T1 :staff\\#staff_id ?T1_staff_id . ?T1 :staff\\#staff_name ?T1_staff_name . ?T2 :staff_department_assignments\\#date_assigned_to ?T2_date_assigned_to . ?T2 :staff_department_assignments\\#date_assigned_from ?T2_date_assigned_from .        }   ORDER BY ASC (?T2_date_assigned_to - ?T2_date_assigned_from) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_staff_id ?T1_staff_name WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__staff/sparql> {\n    SELECT DISTINCT ?T1 ?T1_staff_id ?T1_staff_name WHERE {\n      ?T1 a :staff .\n      ?T1 :staff\\#staff_id ?T1_staff_id .\n      ?T1 :staff\\#staff_name ?T1_staff_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__staff_department_assignments/sparql> {\n    ?T2 a :staff_department_assignments .\n      ?T2 :staff_department_assignments\\#ref-staff_id ?T1 .\n      ?T2 :staff_department_assignments\\#date_assigned_to ?T2_date_assigned_to .\n      ?T2 :staff_department_assignments\\#date_assigned_from ?T2_date_assigned_from\n  }\n}\nORDER BY ASC (?T2_date_assigned_to - ?T2_date_assigned_from) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_722",
    "kg_name": "department_store",
    "split": "train",
    "question": "Return the name and gender of the staff who was assigned in 2016.",
    "original_sparql": "SELECT ?t1_staff_name ?t1_staff_gender WHERE {?t1 a :staff . ?t2 a :staff_department_assignments . ?t1 :staff\\#ref-staff_id ?t2 . ?t2 :staff_department_assignments\\#date_assigned_from ?t2_date_assigned_from . FILTER(contains(xsd:string(?t2_date_assigned_from),'2016'))}",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?t1_staff_name ?t1_staff_gender WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__staff_department_assignments/sparql> {\n    SELECT DISTINCT ?t2 ?t2_date_assigned_from WHERE {\n      ?t2 a :staff_department_assignments .\n      ?t2 :staff_department_assignments\\#date_assigned_from ?t2_date_assigned_from\n      FILTER(contains(xsd:string(?t2_date_assigned_from),'2016'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__staff/sparql> {\n    ?t1 a :staff .\n      ?t1 :staff\\#ref-staff_id ?t2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "department_store_726",
    "kg_name": "department_store",
    "split": "train",
    "question": "List the name and phone number of all suppliers in the alphabetical order of their addresses.",
    "original_sparql": "SELECT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a :suppliers . ?T13 a :supplier_addresses . ?T13 :supplier_addresses\\#ref-supplier_id ?T1 .  ?T1 :suppliers\\#supplier_name ?T1_supplier_name . ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone . ?T2 :addresses\\#address_details ?T2_address_details . ?T2 a :addresses . ?T13 :supplier_addresses\\#ref-address_id ?T2 .  ?T1 :suppliers\\#supplier_name ?T1_supplier_name . ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone . ?T2 :addresses\\#address_details ?T2_address_details .        }  ORDER BY ASC (?T2_address_details)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_supplier_name ?T1_supplier_phone WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__suppliers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_supplier_name ?T1_supplier_phone WHERE {\n      ?T1 a :suppliers .\n      ?T1 :suppliers\\#supplier_name ?T1_supplier_name .\n      ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone .\n      ?T1 :suppliers\\#supplier_name ?T1_supplier_name .\n      ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__addresses/sparql> {\n    SELECT DISTINCT ?T2 ?T2_address_details WHERE {\n      ?T2 :addresses\\#address_details ?T2_address_details .\n      ?T2 a :addresses .\n      ?T2 :addresses\\#address_details ?T2_address_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__supplier_addresses/sparql> {\n    ?T13 a :supplier_addresses .\n      ?T13 :supplier_addresses\\#ref-supplier_id ?T1 .\n      ?T13 :supplier_addresses\\#ref-address_id ?T2\n  }\n}\nORDER BY ASC (?T2_address_details)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_728",
    "kg_name": "department_store",
    "split": "train",
    "question": "List the names of all the distinct customers who bought a keyboard.",
    "original_sparql": "SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :products\\#product_name ?T2_product_name . ?T14 a :order_items . ?T14 :order_items\\#ref-order_id ?T13 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T14 :order_items\\#ref-product_id ?T2 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'keyboard') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_customer_name WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__customer_orders/sparql> {\n    SELECT DISTINCT ?T1 ?T13 WHERE {\n      ?T13 a :customer_orders .\n      ?T13 :customer_orders\\#ref-customer_id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_name WHERE {\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'keyboard')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__order_items/sparql> {\n    ?T14 a :order_items .\n      ?T14 :order_items\\#ref-order_id ?T13 .\n      ?T14 :order_items\\#ref-product_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_730",
    "kg_name": "department_store",
    "split": "train",
    "question": "List the names and phone numbers of all the distinct suppliers who supply red jeans.",
    "original_sparql": "SELECT DISTINCT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a :suppliers . ?T13 a :product_suppliers . ?T13 :product_suppliers\\#ref-supplier_id ?T1 .  ?T1 :suppliers\\#supplier_name ?T1_supplier_name . ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_suppliers\\#ref-product_id ?T2 .  ?T1 :suppliers\\#supplier_name ?T1_supplier_name . ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'red jeans') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_supplier_name ?T1_supplier_phone WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__suppliers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_supplier_name ?T1_supplier_phone WHERE {\n      ?T1 a :suppliers .\n      ?T1 :suppliers\\#supplier_name ?T1_supplier_name .\n      ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone .\n      ?T1 :suppliers\\#supplier_name ?T1_supplier_name .\n      ?T1 :suppliers\\#supplier_phone ?T1_supplier_phone\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_name WHERE {\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'red jeans')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__product_suppliers/sparql> {\n    ?T13 a :product_suppliers .\n      ?T13 :product_suppliers\\#ref-supplier_id ?T1 .\n      ?T13 :product_suppliers\\#ref-product_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_732",
    "kg_name": "department_store",
    "split": "train",
    "question": "Find the names of products that were bought by at least two distinct customers.",
    "original_sparql": "SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T13 a :order_items . ?T13 :order_items\\#ref-product_id ?T1 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :customer_orders\\#customer_id ?T2_customer_id . ?T2 a :customer_orders . ?T13 :order_items\\#ref-order_id ?T2 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :customer_orders\\#customer_id ?T2_customer_id .        } GROUP BY ?T1_product_name   HAVING(count( ?T2_customer_id) as ?aggregation_T2_customer_id_8 ) >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_product_name WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_product_name ?T2 ?T2_customer_id WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__products/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_name WHERE {\n      ?T1 a :products .\n      ?T1 :products\\#product_name ?T1_product_name .\n      ?T1 :products\\#product_name ?T1_product_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__customer_orders/sparql> {\n    SELECT DISTINCT ?T2 ?T2_customer_id WHERE {\n      ?T2 :customer_orders\\#customer_id ?T2_customer_id .\n      ?T2 a :customer_orders .\n      ?T2 :customer_orders\\#customer_id ?T2_customer_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__order_items/sparql> {\n    ?T13 a :order_items .\n      ?T13 :order_items\\#ref-product_id ?T1 .\n      ?T13 :order_items\\#ref-order_id ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T1_product_name   HAVING(count( ?T2_customer_id) as ?aggregation_T2_customer_id_8 ) >= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  }
]