[
  {
    "id": "phone_market_1632",
    "kg_name": "phone_market",
    "split": "train",
    "question": "Show the names of phones and the districts of markets they are on, in ascending order of the ranking of the market.",
    "original_sparql": "SELECT ?T1_name ?T2_district WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :phone_market\\#ref-phone_id ?T1 .  ?T1 :phone\\#name ?T1_name . ?T2 :market\\#district ?T2_district . ?T2 :market\\#ranking ?T2_ranking . ?T2 a :market . ?T13 :phone_market\\#ref-market_id ?T2 .  ?T1 :phone\\#name ?T1_name . ?T2 :market\\#district ?T2_district . ?T2 :market\\#ranking ?T2_ranking .        }  ORDER BY ASC (?T2_ranking)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_district WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_market__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#name ?T1_name .\n      ?T1 :phone\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_market__market/sparql> {\n    SELECT DISTINCT ?T2 ?T2_district ?T2_ranking WHERE {\n      ?T2 :market\\#district ?T2_district .\n      ?T2 :market\\#ranking ?T2_ranking .\n      ?T2 a :market .\n      ?T2 :market\\#district ?T2_district .\n      ?T2 :market\\#ranking ?T2_ranking\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_market__phone_market/sparql> {\n    ?T13 a :phone_market .\n      ?T13 :phone_market\\#ref-phone_id ?T1 .\n      ?T13 :phone_market\\#ref-market_id ?T2\n  }\n}\nORDER BY ASC (?T2_ranking)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/phone_market",
        "url": "http://host.docker.internal:3030/phone_market__phone_market/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_market__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/market",
        "url": "http://host.docker.internal:3030/phone_market__market/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "phone_market_1633",
    "kg_name": "phone_market",
    "split": "train",
    "question": "Show the names of phones that are on market with number of shops greater than 50.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :phone_market\\#ref-phone_id ?T1 .  ?T1 :phone\\#name ?T1_name . ?T2 :market\\#num_of_shops ?T2_num_of_shops . ?T2 a :market . ?T13 :phone_market\\#ref-market_id ?T2 .  ?T1 :phone\\#name ?T1_name . ?T2 :market\\#num_of_shops ?T2_num_of_shops . FILTER(?T2_num_of_shops > 50) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_market__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#name ?T1_name .\n      ?T1 :phone\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_market__market/sparql> {\n    SELECT DISTINCT ?T2 ?T2_num_of_shops WHERE {\n      ?T2 :market\\#num_of_shops ?T2_num_of_shops .\n      ?T2 a :market .\n      ?T2 :market\\#num_of_shops ?T2_num_of_shops\n      FILTER(?T2_num_of_shops > 50)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_market__phone_market/sparql> {\n    ?T13 a :phone_market .\n      ?T13 :phone_market\\#ref-phone_id ?T1 .\n      ?T13 :phone_market\\#ref-market_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/phone_market",
        "url": "http://host.docker.internal:3030/phone_market__phone_market/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_market__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/market",
        "url": "http://host.docker.internal:3030/phone_market__market/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "phone_market_1634",
    "kg_name": "phone_market",
    "split": "train",
    "question": "For each phone, show its names and total number of stocks.",
    "original_sparql": "SELECT ?T1_name (sum( ?T2_num_of_stock) as ?aggregation_T2_num_of_stock_99 ) WHERE { ?T1 a :phone . ?T2 a :phone_market . ?T2 :phone_market\\#ref-phone_id ?T1 .  ?T1 :phone\\#name ?T1_name . ?T2 :phone_market\\#num_of_stock ?T2_num_of_stock .        } GROUP BY ?T1_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (sum( ?T2_num_of_stock) as ?aggregation_T2_num_of_stock_99 ) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 ?T2_num_of_stock WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_market__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_market__phone_market/sparql> {\n    ?T2 a :phone_market .\n      ?T2 :phone_market\\#ref-phone_id ?T1 .\n      ?T2 :phone_market\\#num_of_stock ?T2_num_of_stock\n  }\n    }\n  }\n}\nGROUP BY ?T1_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/phone_market",
        "url": "http://host.docker.internal:3030/phone_market__phone_market/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_market__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/market",
        "url": "http://host.docker.internal:3030/phone_market__market/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "product_catalog_1650",
    "kg_name": "product_catalog",
    "split": "train",
    "question": "Find the names and publication dates of all catalogs that have catalog level number greater than 5.",
    "original_sparql": "SELECT ?T1_catalog_name ?T1_date_of_publication WHERE { ?T1 a :catalogs . ?T2 a :catalog_structure . ?T2 :catalog_structure\\#ref-catalog_id ?T1 .  ?T1 :catalogs\\#catalog_name ?T1_catalog_name . ?T1 :catalogs\\#date_of_publication ?T1_date_of_publication . ?T2 :catalog_structure\\#catalog_level_number ?T2_catalog_level_number . FILTER(?T2_catalog_level_number > 5) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_catalog_name ?T1_date_of_publication WHERE {\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalogs/sparql> {\n    SELECT DISTINCT ?T1 ?T1_catalog_name ?T1_date_of_publication WHERE {\n      ?T1 a :catalogs .\n      ?T1 :catalogs\\#catalog_name ?T1_catalog_name .\n      ?T1 :catalogs\\#date_of_publication ?T1_date_of_publication\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalog_structure/sparql> {\n    ?T2 a :catalog_structure .\n      ?T2 :catalog_structure\\#ref-catalog_id ?T1 .\n      ?T2 :catalog_structure\\#catalog_level_number ?T2_catalog_level_number\n      FILTER(?T2_catalog_level_number > 5)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/catalog_contents",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_contents_additional_attributes",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents_additional_attributes/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_structure",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_structure/sparql"
      },
      {
        "class": "http://valuenet/ontop/attribute_definitions",
        "url": "http://host.docker.internal:3030/product_catalog__attribute_definitions/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalogs",
        "url": "http://host.docker.internal:3030/product_catalog__catalogs/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "product_catalog_1652",
    "kg_name": "product_catalog",
    "split": "train",
    "question": "What are the entry names of catalog with the attribute possessed by most entries.",
    "original_sparql": "SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T2 a :catalog_contents_additional_attributes . ?T2 :catalog_contents_additional_attributes\\#ref-catalog_entry_id ?T1 .  ?T1 :catalog_contents\\#catalog_entry_name ?T1_catalog_entry_name . ?T2 :catalog_contents_additional_attributes\\#attribute_value ?T2_attribute_value . FILTER(?T2_attribute_value = (?T23_attribute_value)) .       {SELECT ?T23_attribute_value (count( *) as ?aggregation_all) WHERE { ?T23 a :catalog_contents_additional_attributes . ?T23 :catalog_contents_additional_attributes\\#attribute_value ?T23_attribute_value .        } GROUP BY ?T23_attribute_value  ORDER BY DESC (?aggregation_all) LIMIT 1 } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_catalog_entry_name WHERE {\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalog_contents/sparql> {\n    SELECT DISTINCT ?T1 ?T1_catalog_entry_name WHERE {\n      ?T1 a :catalog_contents .\n      ?T1 :catalog_contents\\#catalog_entry_name ?T1_catalog_entry_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalog_contents_additional_attributes/sparql> {\n    ?T2 a :catalog_contents_additional_attributes .\n      ?T2 :catalog_contents_additional_attributes\\#ref-catalog_entry_id ?T1 .\n      ?T2 :catalog_contents_additional_attributes\\#attribute_value ?T2_attribute_value\n      FILTER(?T2_attribute_value = (?T23_attribute_value))\n  }\n  {\n    SELECT ?T23_attribute_value (count( *) as ?aggregation_all) WHERE {\n      SERVICE <http://host.docker.internal:3030/product_catalog__catalog_contents_additional_attributes/sparql> {\n        ?T23 a :catalog_contents_additional_attributes . ?T23 :catalog_contents_additional_attributes\\#attribute_value ?T23_attribute_value . } GROUP BY ?T23_attribute_value ORDER BY DESC (?aggregation_all) LIMIT 1\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/catalog_contents",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_contents_additional_attributes",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents_additional_attributes/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_structure",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_structure/sparql"
      },
      {
        "class": "http://valuenet/ontop/attribute_definitions",
        "url": "http://host.docker.internal:3030/product_catalog__attribute_definitions/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalogs",
        "url": "http://host.docker.internal:3030/product_catalog__catalogs/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "product_catalog_1655",
    "kg_name": "product_catalog",
    "split": "train",
    "question": "Find the level name of the catalog with the lowest price (in USD).",
    "original_sparql": "SELECT ?T1_catalog_level_name WHERE { ?T1 a :catalog_structure . ?T2 a :catalog_contents . ?T2 :catalog_contents\\#ref-catalog_level_number ?T1 .  ?T1 :catalog_structure\\#catalog_level_name ?T1_catalog_level_name . ?T2 :catalog_contents\\#price_in_dollars ?T2_price_in_dollars .        }   ORDER BY ASC (?T2_price_in_dollars) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_catalog_level_name WHERE {\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalog_structure/sparql> {\n    SELECT DISTINCT ?T1 ?T1_catalog_level_name WHERE {\n      ?T1 a :catalog_structure .\n      ?T1 :catalog_structure\\#catalog_level_name ?T1_catalog_level_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalog_contents/sparql> {\n    ?T2 a :catalog_contents .\n      ?T2 :catalog_contents\\#ref-catalog_level_number ?T1 .\n      ?T2 :catalog_contents\\#price_in_dollars ?T2_price_in_dollars\n  }\n}\nORDER BY ASC (?T2_price_in_dollars) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/catalog_contents",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_contents_additional_attributes",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents_additional_attributes/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_structure",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_structure/sparql"
      },
      {
        "class": "http://valuenet/ontop/attribute_definitions",
        "url": "http://host.docker.internal:3030/product_catalog__attribute_definitions/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalogs",
        "url": "http://host.docker.internal:3030/product_catalog__catalogs/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "product_catalog_1656",
    "kg_name": "product_catalog",
    "split": "train",
    "question": "Find the names of catalog entries with level number 8.",
    "original_sparql": "SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T2 a :catalog_contents_additional_attributes . ?T2 :catalog_contents_additional_attributes\\#ref-catalog_entry_id ?T1 .  ?T1 :catalog_contents\\#catalog_entry_name ?T1_catalog_entry_name . ?T2 :catalog_contents_additional_attributes\\#catalog_level_number ?T2_catalog_level_number . FILTER(?T2_catalog_level_number = 8) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_catalog_entry_name WHERE {\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalog_contents/sparql> {\n    SELECT DISTINCT ?T1 ?T1_catalog_entry_name WHERE {\n      ?T1 a :catalog_contents .\n      ?T1 :catalog_contents\\#catalog_entry_name ?T1_catalog_entry_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/product_catalog__catalog_contents_additional_attributes/sparql> {\n    ?T2 a :catalog_contents_additional_attributes .\n      ?T2 :catalog_contents_additional_attributes\\#ref-catalog_entry_id ?T1 .\n      ?T2 :catalog_contents_additional_attributes\\#catalog_level_number ?T2_catalog_level_number\n      FILTER(?T2_catalog_level_number = 8)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/catalog_contents",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_contents_additional_attributes",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_contents_additional_attributes/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalog_structure",
        "url": "http://host.docker.internal:3030/product_catalog__catalog_structure/sparql"
      },
      {
        "class": "http://valuenet/ontop/attribute_definitions",
        "url": "http://host.docker.internal:3030/product_catalog__attribute_definitions/sparql"
      },
      {
        "class": "http://valuenet/ontop/catalogs",
        "url": "http://host.docker.internal:3030/product_catalog__catalogs/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_for_hire_1659",
    "kg_name": "products_for_hire",
    "split": "train",
    "question": "How many bookings did each customer make? List the customer id, first name, and the count.",
    "original_sparql": "SELECT ?T1_customer_id ?T1_first_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :bookings . ?T2 :bookings\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_id ?T1_customer_id . ?T1 :customers\\#first_name ?T1_first_name .        } GROUP BY ?T1_customer_id ?T1_first_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_id ?T1_first_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_customer_id ?T1_first_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/products_for_hire__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_id ?T1_first_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_id ?T1_customer_id .\n      ?T1 :customers\\#first_name ?T1_first_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_for_hire__bookings/sparql> {\n    ?T2 a :bookings .\n      ?T2 :bookings\\#ref-customer_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_customer_id ?T1_first_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/discount_coupons",
        "url": "http://host.docker.internal:3030/products_for_hire__discount_coupons/sparql"
      },
      {
        "class": "http://valuenet/ontop/payments",
        "url": "http://host.docker.internal:3030/products_for_hire__payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/products_for_hire__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/products_for_hire",
        "url": "http://host.docker.internal:3030/products_for_hire__products_for_hire/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/products_for_hire__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products_booked",
        "url": "http://host.docker.internal:3030/products_for_hire__products_booked/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_product_availability",
        "url": "http://host.docker.internal:3030/products_for_hire__view_product_availability/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1665",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "List the names, color descriptions and product descriptions of products with category 'Herbs'.",
    "original_sparql": "SELECT ?T1_product_name ?T2_color_description ?T1_product_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\\#ref-color_code ?T2 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :ref_colors\\#color_description ?T2_color_description . ?T1 :products\\#product_description ?T1_product_description . ?T1 :products\\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_name ?T2_color_description ?T1_product_description WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_color_description WHERE {\n      ?T2 a :ref_colors .\n      ?T2 :ref_colors\\#color_description ?T2_color_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    ?T1 a :products .\n      ?T1 :products\\#ref-color_code ?T2 .\n      ?T1 :products\\#product_name ?T1_product_name .\n      ?T1 :products\\#product_description ?T1_product_description .\n      ?T1 :products\\#product_category_code ?T1_product_category_code\n      FILTER(?T1_product_category_code = 'Herbs')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1668",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Give the name of the products that have a color description 'yellow'.",
    "original_sparql": "SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\\#ref-color_code ?T2 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :ref_colors\\#color_description ?T2_color_description . FILTER(?T2_color_description = 'yellow') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_color_description WHERE {\n      ?T2 a :ref_colors .\n      ?T2 :ref_colors\\#color_description ?T2_color_description\n      FILTER(?T2_color_description = 'yellow')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    ?T1 a :products .\n      ?T1 :products\\#ref-color_code ?T2 .\n      ?T1 :products\\#product_name ?T1_product_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1669",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Find the category descriptions of the products whose descriptions include letter 't'.",
    "original_sparql": "SELECT ?T1_product_category_description WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :products\\#ref-product_category_code ?T1 .  ?T1 :ref_product_categories\\#product_category_description ?T1_product_category_description . ?T2 :products\\#product_description ?T2_product_description . FILTER(contains (?T2_product_description, 't')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_category_description WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_category_description WHERE {\n      ?T1 a :ref_product_categories .\n      ?T1 :ref_product_categories\\#product_category_description ?T1_product_category_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    ?T2 a :products .\n      ?T2 :products\\#ref-product_category_code ?T1 .\n      ?T2 :products\\#product_description ?T2_product_description\n      FILTER(contains (?T2_product_description, 't'))\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1672",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Give the color description for the product 'catnip'.",
    "original_sparql": "SELECT ?T1_color_description WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :products\\#ref-color_code ?T1 .  ?T1 :ref_colors\\#color_description ?T1_color_description . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'catnip') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_color_description WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_color_description WHERE {\n      ?T1 a :ref_colors .\n      ?T1 :ref_colors\\#color_description ?T1_color_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    ?T2 a :products .\n      ?T2 :products\\#ref-color_code ?T1 .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'catnip')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1675",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Find the id and color description of the products with at least 2 characteristics.",
    "original_sparql": "SELECT ?T1_product_id ?T2_color_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\\#ref-color_code ?T2 .  ?T1 :products\\#product_id ?T1_product_id . ?T2 :ref_colors\\#color_description ?T2_color_description . ?T3 a :product_characteristics . ?T3 :product_characteristics\\#ref-product_id ?T1 .  ?T1 :products\\#product_id ?T1_product_id . ?T2 :ref_colors\\#color_description ?T2_color_description .        } GROUP BY ?T1_product_id ?T2_color_description   HAVING(count( *)  >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_id ?T2_color_description WHERE {\n  {\n    SELECT ?T1 ?T1_product_id ?T2 ?T2_color_description ?T3 WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_id ?T2 WHERE {\n      ?T1 a :products .\n      ?T1 :products\\#ref-color_code ?T2 .\n      ?T1 :products\\#product_id ?T1_product_id .\n      ?T1 :products\\#product_id ?T1_product_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_color_description WHERE {\n      ?T2 a :ref_colors .\n      ?T2 :ref_colors\\#color_description ?T2_color_description .\n      ?T2 :ref_colors\\#color_description ?T2_color_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T3 a :product_characteristics .\n      ?T3 :product_characteristics\\#ref-product_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_product_id ?T2_color_description   HAVING(count( *)  >= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 4,
      "federated_count": 9,
      "missing": 0,
      "extra": 5,
      "error": "result_mismatch"
    }
  }
]