[
  {
    "id": "cre_theme_park_615",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Which tourist attractions are related to royal family? Tell me their details and how we can get there.",
    "original_sparql": "SELECT ?T1_royal_family_details ?T2_how_to_get_there WHERE { ?T1 a :royal_family . ?T2 a :tourist_attractions . ?T1 :royal_family\\#ref-royal_family_id ?T2 .  ?T1 :royal_family\\#royal_family_details ?T1_royal_family_details . ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_royal_family_details ?T2_how_to_get_there WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_how_to_get_there WHERE {\n      ?T2 a :tourist_attractions .\n      ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__royal_family/sparql> {\n    ?T1 a :royal_family .\n      ?T1 :royal_family\\#ref-royal_family_id ?T2 .\n      ?T1 :royal_family\\#royal_family_details ?T1_royal_family_details\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_617",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Find the details of the shops that can be reached by walk.",
    "original_sparql": "SELECT ?T1_shop_details WHERE { ?T1 a :shops . ?T2 a :tourist_attractions . ?T1 :shops\\#ref-shop_id ?T2 .  ?T1 :shops\\#shop_details ?T1_shop_details . ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there . FILTER(?T2_how_to_get_there = 'walk') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_shop_details WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_how_to_get_there WHERE {\n      ?T2 a :tourist_attractions .\n      ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there\n      FILTER(?T2_how_to_get_there = 'walk')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__shops/sparql> {\n    ?T1 a :shops .\n      ?T1 :shops\\#ref-shop_id ?T2 .\n      ?T1 :shops\\#shop_details ?T1_shop_details\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_619",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Tell me the name of the staff in charge of the attraction called 'US museum'.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :staff . ?T2 a :tourist_attractions . ?T1 :staff\\#ref-tourist_attraction_id ?T2 .  ?T1 :staff\\#name ?T1_name . ?T2 :tourist_attractions\\#name ?T2_name . FILTER(?T2_name = 'US museum') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :tourist_attractions .\n      ?T2 :tourist_attractions\\#name ?T2_name\n      FILTER(?T2_name = 'US museum')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__staff/sparql> {\n    ?T1 a :staff .\n      ?T1 :staff\\#ref-tourist_attraction_id ?T2 .\n      ?T1 :staff\\#name ?T1_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_621",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Find the details of all the markets that are accessible by walk or bus.",
    "original_sparql": "SELECT ?T1_market_details WHERE { ?T1 a :street_markets . ?T2 a :tourist_attractions . ?T1 :street_markets\\#ref-market_id ?T2 .  ?T1 :street_markets\\#market_details ?T1_market_details . ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there . ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there . FILTER(?T2_how_to_get_there = 'walk' || ?T2_how_to_get_there = 'bus') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_market_details WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_how_to_get_there WHERE {\n      ?T2 a :tourist_attractions .\n      ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there .\n      ?T2 :tourist_attractions\\#how_to_get_there ?T2_how_to_get_there\n      FILTER(?T2_how_to_get_there = 'walk' || ?T2_how_to_get_there = 'bus')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__street_markets/sparql> {\n    ?T1 a :street_markets .\n      ?T1 :street_markets\\#ref-market_id ?T2 .\n      ?T1 :street_markets\\#market_details ?T1_market_details\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_623",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Find the visit date and details of the tourist whose detail is 'Vincent'",
    "original_sparql": "SELECT ?T1_visit_date ?T1_visit_details WHERE { ?T1 a :visits . ?T2 a :visitors . ?T1 :visits\\#ref-tourist_id ?T2 .  ?T1 :visits\\#visit_date ?T1_visit_date . ?T1 :visits\\#visit_details ?T1_visit_details . ?T2 :visitors\\#tourist_details ?T2_tourist_details . FILTER(?T2_tourist_details = 'Vincent') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_visit_date ?T1_visit_details WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__visitors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_tourist_details WHERE {\n      ?T2 a :visitors .\n      ?T2 :visitors\\#tourist_details ?T2_tourist_details\n      FILTER(?T2_tourist_details = 'Vincent')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__visits/sparql> {\n    ?T1 a :visits .\n      ?T1 :visits\\#ref-tourist_id ?T2 .\n      ?T1 :visits\\#visit_date ?T1_visit_date .\n      ?T1 :visits\\#visit_details ?T1_visit_details\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_625",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Show the tourist attractions visited by the tourist whose detail is 'Vincent'.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :tourist_attractions . ?T13 a :visits . ?T13 :visits\\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\\#name ?T1_name . ?T2 :visitors\\#tourist_details ?T2_tourist_details . ?T2 a :visitors . ?T13 :visits\\#ref-tourist_id ?T2 .  ?T1 :tourist_attractions\\#name ?T1_name . ?T2 :visitors\\#tourist_details ?T2_tourist_details . FILTER(?T2_tourist_details = 'Vincent') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :tourist_attractions .\n      ?T1 :tourist_attractions\\#name ?T1_name .\n      ?T1 :tourist_attractions\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__visitors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_tourist_details WHERE {\n      ?T2 :visitors\\#tourist_details ?T2_tourist_details .\n      ?T2 a :visitors .\n      ?T2 :visitors\\#tourist_details ?T2_tourist_details\n      FILTER(?T2_tourist_details = 'Vincent')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__visits/sparql> {\n    ?T13 a :visits .\n      ?T13 :visits\\#ref-tourist_attraction_id ?T1 .\n      ?T13 :visits\\#ref-tourist_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_627",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "For each tourist attraction, return its name and the date when the tourists named Vincent or Vivian visited there.",
    "original_sparql": "SELECT ?T1_name ?T2_visit_date WHERE { ?T1 a :tourist_attractions . ?T2 a :visits . ?T2 :visits\\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\\#name ?T1_name . ?T2 :visits\\#visit_date ?T2_visit_date . ?T3 :visitors\\#tourist_details ?T3_tourist_details . ?T3 :visitors\\#tourist_details ?T3_tourist_details . ?T3 a :visitors . ?T2 :visits\\#ref-tourist_id ?T3 .  ?T1 :tourist_attractions\\#name ?T1_name . ?T2 :visits\\#visit_date ?T2_visit_date . ?T3 :visitors\\#tourist_details ?T3_tourist_details . ?T3 :visitors\\#tourist_details ?T3_tourist_details . FILTER(?T3_tourist_details = 'Vincent' || ?T3_tourist_details = 'Vivian') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_visit_date WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :tourist_attractions .\n      ?T1 :tourist_attractions\\#name ?T1_name .\n      ?T1 :tourist_attractions\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__visitors/sparql> {\n    SELECT DISTINCT ?T3 ?T3_tourist_details WHERE {\n      ?T3 :visitors\\#tourist_details ?T3_tourist_details .\n      ?T3 :visitors\\#tourist_details ?T3_tourist_details .\n      ?T3 a :visitors .\n      ?T3 :visitors\\#tourist_details ?T3_tourist_details .\n      ?T3 :visitors\\#tourist_details ?T3_tourist_details\n      FILTER(?T3_tourist_details = 'Vincent' || ?T3_tourist_details = 'Vivian')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__visits/sparql> {\n    ?T2 a :visits .\n      ?T2 :visits\\#ref-tourist_attraction_id ?T1 .\n      ?T2 :visits\\#visit_date ?T2_visit_date .\n      ?T2 :visits\\#ref-tourist_id ?T3 .\n      ?T2 :visits\\#visit_date ?T2_visit_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  }
]