[
  {
    "id": "assets_maintenance_113",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which staff have contacted which engineers? List the staff name and the engineer first name and last name.",
    "original_sparql": "SELECT ?T1_staff_name ?T2_first_name ?T2_last_name WHERE { ?T1 a :staff . ?T13 a :engineer_visits . ?T13 :engineer_visits\\#ref-contact_staff_id ?T1 .  ?T1 :staff\\#staff_name ?T1_staff_name . ?T2 :maintenance_engineers\\#first_name ?T2_first_name . ?T2 :maintenance_engineers\\#last_name ?T2_last_name . ?T2 a :maintenance_engineers . ?T13 :engineer_visits\\#ref-engineer_id ?T2 .  ?T1 :staff\\#staff_name ?T1_staff_name . ?T2 :maintenance_engineers\\#first_name ?T2_first_name . ?T2 :maintenance_engineers\\#last_name ?T2_last_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_staff_name ?T2_first_name ?T2_last_name WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__staff/sparql> {\n    SELECT DISTINCT ?T1 ?T1_staff_name WHERE {\n      ?T1 a :staff .\n      ?T1 :staff\\#staff_name ?T1_staff_name .\n      ?T1 :staff\\#staff_name ?T1_staff_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_first_name ?T2_last_name WHERE {\n      ?T2 :maintenance_engineers\\#first_name ?T2_first_name .\n      ?T2 :maintenance_engineers\\#last_name ?T2_last_name .\n      ?T2 a :maintenance_engineers .\n      ?T2 :maintenance_engineers\\#first_name ?T2_first_name .\n      ?T2 :maintenance_engineers\\#last_name ?T2_last_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql> {\n    ?T13 a :engineer_visits .\n      ?T13 :engineer_visits\\#ref-contact_staff_id ?T1 .\n      ?T13 :engineer_visits\\#ref-engineer_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 12,
      "federated_count": 12,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_114",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which fault log included the most number of faulty parts? List the fault log id, description and record time.",
    "original_sparql": "SELECT ?T1_fault_log_entry_id (count( *) as ?aggregation_all) ?T1_fault_description ?T1_fault_log_entry_datetime WHERE { ?T1 a :fault_log . ?T2 a :fault_log_parts . ?T2 :fault_log_parts\\#ref-fault_log_entry_id ?T1 .  ?T1 :fault_log\\#fault_log_entry_id ?T1_fault_log_entry_id . ?T1 :fault_log\\#fault_description ?T1_fault_description . ?T1 :fault_log\\#fault_log_entry_datetime ?T1_fault_log_entry_datetime .        } GROUP BY ?T1_fault_log_entry_id ?T1_fault_description ?T1_fault_log_entry_datetime  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fault_log_entry_id (count( *) as ?aggregation_all) ?T1_fault_description ?T1_fault_log_entry_datetime WHERE {\n  {\n    SELECT ?T1 ?T1_fault_description ?T1_fault_log_entry_datetime ?T1_fault_log_entry_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__fault_log/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fault_description ?T1_fault_log_entry_datetime ?T1_fault_log_entry_id WHERE {\n      ?T1 a :fault_log .\n      ?T1 :fault_log\\#fault_log_entry_id ?T1_fault_log_entry_id .\n      ?T1 :fault_log\\#fault_description ?T1_fault_description .\n      ?T1 :fault_log\\#fault_log_entry_datetime ?T1_fault_log_entry_datetime\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql> {\n    ?T2 a :fault_log_parts .\n      ?T2 :fault_log_parts\\#ref-fault_log_entry_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_fault_log_entry_id ?T1_fault_description ?T1_fault_log_entry_datetime  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "assets_maintenance_115",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which skill is used in fixing the most number of faults? List the skill id and description.",
    "original_sparql": "SELECT ?T1_skill_id (count( *) as ?aggregation_all) ?T1_skill_description WHERE { ?T1 a :skills . ?T2 a :skills_required_to_fix . ?T2 :skills_required_to_fix\\#ref-skill_id ?T1 .  ?T1 :skills\\#skill_id ?T1_skill_id . ?T1 :skills\\#skill_description ?T1_skill_description .        } GROUP BY ?T1_skill_id ?T1_skill_description  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_skill_id (count( *) as ?aggregation_all) ?T1_skill_description WHERE {\n  {\n    SELECT ?T1 ?T1_skill_description ?T1_skill_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__skills/sparql> {\n    SELECT DISTINCT ?T1 ?T1_skill_description ?T1_skill_id WHERE {\n      ?T1 a :skills .\n      ?T1 :skills\\#skill_id ?T1_skill_id .\n      ?T1 :skills\\#skill_description ?T1_skill_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql> {\n    ?T2 a :skills_required_to_fix .\n      ?T2 :skills_required_to_fix\\#ref-skill_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_skill_id ?T1_skill_description  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "assets_maintenance_116",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which company started the earliest the maintenance contract? Show the company name.",
    "original_sparql": "SELECT ?T1_company_name WHERE { ?T1 a :third_party_companies . ?T2 a :maintenance_contracts . ?T2 :maintenance_contracts\\#ref-maintenance_contract_company_id ?T1 .  ?T1 :third_party_companies\\#company_name ?T1_company_name . ?T2 :maintenance_contracts\\#contract_start_date ?T2_contract_start_date .        }   ORDER BY ASC (?T2_contract_start_date) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_company_name WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql> {\n    SELECT DISTINCT ?T1 ?T1_company_name WHERE {\n      ?T1 a :third_party_companies .\n      ?T1 :third_party_companies\\#company_name ?T1_company_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql> {\n    ?T2 a :maintenance_contracts .\n      ?T2 :maintenance_contracts\\#ref-maintenance_contract_company_id ?T1 .\n      ?T2 :maintenance_contracts\\#contract_start_date ?T2_contract_start_date\n  }\n}\nORDER BY ASC (?T2_contract_start_date) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_118",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "How many engineers did each staff contact? List both the contact staff name and number of engineers contacted.",
    "original_sparql": "SELECT ?T1_staff_name (count( *) as ?aggregation_all) WHERE { ?T1 a :staff . ?T2 a :engineer_visits . ?T2 :engineer_visits\\#ref-contact_staff_id ?T1 .  ?T1 :staff\\#staff_name ?T1_staff_name .        } GROUP BY ?T1_staff_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_staff_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_staff_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__staff/sparql> {\n    SELECT DISTINCT ?T1 ?T1_staff_name WHERE {\n      ?T1 a :staff .\n      ?T1 :staff\\#staff_name ?T1_staff_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql> {\n    ?T2 a :engineer_visits .\n      ?T2 :engineer_visits\\#ref-contact_staff_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_staff_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "body_builder_149",
    "kg_name": "body_builder",
    "split": "train",
    "question": "List the weight of the body builders who have snatch score higher than 140 or have the height greater than 200.",
    "original_sparql": "SELECT ?T1_weight WHERE { ?T1 a :people . ?T2 a :body_builder . ?T2 :body_builder\\#ref-people_id ?T1 .  ?T1 :people\\#weight ?T1_weight . ?T2 :body_builder\\#snatch ?T2_snatch . ?T1 :people\\#height ?T1_height . FILTER(?T2_snatch > 140 || ?T1_height > 200) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_weight WHERE {\n  SERVICE <http://host.docker.internal:3030/body_builder__people/sparql> {\n    SELECT DISTINCT ?T1 ?T1_height ?T1_weight ?T2_snatch WHERE {\n      ?T1 a :people .\n      ?T1 :people\\#weight ?T1_weight .\n      ?T1 :people\\#height ?T1_height\n      FILTER(?T2_snatch > 140 || ?T1_height > 200)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/body_builder__body_builder/sparql> {\n    ?T2 a :body_builder .\n      ?T2 :body_builder\\#ref-people_id ?T1 .\n      ?T2 :body_builder\\#snatch ?T2_snatch\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/body_builder__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/body_builder",
        "url": "http://host.docker.internal:3030/body_builder__body_builder/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 1,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "book_2_151",
    "kg_name": "book_2",
    "split": "train",
    "question": "Show the title and publication dates of books.",
    "original_sparql": "SELECT ?T1_title ?T2_publication_date WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :publication\\#ref-book_id ?T1 .  ?T1 :book\\#title ?T1_title . ?T2 :publication\\#publication_date ?T2_publication_date .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title ?T2_publication_date WHERE {\n  SERVICE <http://host.docker.internal:3030/book_2__book/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :book .\n      ?T1 :book\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/book_2__publication/sparql> {\n    ?T2 a :publication .\n      ?T2 :publication\\#ref-book_id ?T1 .\n      ?T2 :publication\\#publication_date ?T2_publication_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/publication",
        "url": "http://host.docker.internal:3030/book_2__publication/sparql"
      },
      {
        "class": "http://valuenet/ontop/book",
        "url": "http://host.docker.internal:3030/book_2__book/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "book_2_152",
    "kg_name": "book_2",
    "split": "train",
    "question": "Show writers who have published a book with price more than 4000000.",
    "original_sparql": "SELECT ?T1_writer WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :publication\\#ref-book_id ?T1 .  ?T1 :book\\#writer ?T1_writer . ?T2 :publication\\#price ?T2_price . FILTER(?T2_price > 4000000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_writer WHERE {\n  SERVICE <http://host.docker.internal:3030/book_2__book/sparql> {\n    SELECT DISTINCT ?T1 ?T1_writer WHERE {\n      ?T1 a :book .\n      ?T1 :book\\#writer ?T1_writer\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/book_2__publication/sparql> {\n    ?T2 a :publication .\n      ?T2 :publication\\#ref-book_id ?T1 .\n      ?T2 :publication\\#price ?T2_price\n      FILTER(?T2_price > 4000000)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/publication",
        "url": "http://host.docker.internal:3030/book_2__publication/sparql"
      },
      {
        "class": "http://valuenet/ontop/book",
        "url": "http://host.docker.internal:3030/book_2__book/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "browser_web_159",
    "kg_name": "browser_web",
    "split": "train",
    "question": "List the names of the browser that are compatible with both 'CACHEbox' and 'Fasterfox'.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :browser . ?T13 a :accelerator_compatible_browser . ?T13 :accelerator_compatible_browser\\#ref-browser_id ?T1 .  ?T1 :browser\\#name ?T1_name . ?T2 :web_client_accelerator\\#name ?T2_name . ?T2 a :web_client_accelerator . ?T13 :accelerator_compatible_browser\\#ref-accelerator_id ?T2 .  ?T1 :browser\\#name ?T1_name . ?T2 :web_client_accelerator\\#name ?T2_name . FILTER(?T2_name = 'CACHEbox') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :browser . ?T15 a :accelerator_compatible_browser . ?T15 :accelerator_compatible_browser\\#ref-browser_id ?T3 .  ?T3 :browser\\#name ?T3_name . ?T4 :web_client_accelerator\\#name ?T4_name . ?T4 a :web_client_accelerator . ?T15 :accelerator_compatible_browser\\#ref-accelerator_id ?T4 .  ?T3 :browser\\#name ?T3_name . ?T4 :web_client_accelerator\\#name ?T4_name .  FILTER(?T4_name = 'Fasterfox') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/browser_web__browser/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T3 ?T3_name WHERE {\n      ?T1 a :browser .\n      ?T1 :browser\\#name ?T1_name .\n      ?T1 :browser\\#name ?T1_name .\n      ?T3 a :browser .\n      ?T3 :browser\\#name ?T3_name .\n      ?T3 :browser\\#name ?T3_name\n      FILTER (?T1_name in (?T3_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/browser_web__web_client_accelerator/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name ?T4 ?T4_name WHERE {\n      ?T2 :web_client_accelerator\\#name ?T2_name .\n      ?T2 a :web_client_accelerator .\n      ?T2 :web_client_accelerator\\#name ?T2_name .\n      ?T4 :web_client_accelerator\\#name ?T4_name .\n      ?T4 a :web_client_accelerator .\n      ?T4 :web_client_accelerator\\#name ?T4_name\n      FILTER(?T2_name = 'CACHEbox')\n      FILTER(?T4_name = 'Fasterfox')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/browser_web__accelerator_compatible_browser/sparql> {\n    ?T13 a :accelerator_compatible_browser .\n      ?T13 :accelerator_compatible_browser\\#ref-browser_id ?T1 .\n      ?T13 :accelerator_compatible_browser\\#ref-accelerator_id ?T2 .\n      ?T15 a :accelerator_compatible_browser .\n      ?T15 :accelerator_compatible_browser\\#ref-browser_id ?T3 .\n      ?T15 :accelerator_compatible_browser\\#ref-accelerator_id ?T4\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/web_client_accelerator",
        "url": "http://host.docker.internal:3030/browser_web__web_client_accelerator/sparql"
      },
      {
        "class": "http://valuenet/ontop/accelerator_compatible_browser",
        "url": "http://host.docker.internal:3030/browser_web__accelerator_compatible_browser/sparql"
      },
      {
        "class": "http://valuenet/ontop/browser",
        "url": "http://host.docker.internal:3030/browser_web__browser/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "browser_web_160",
    "kg_name": "browser_web",
    "split": "train",
    "question": "give me names of all compatible browsers and accelerators in the descending order of compatible year",
    "original_sparql": "SELECT ?T1_name ?T2_name WHERE { ?T1 a :browser . ?T3 a :accelerator_compatible_browser . ?T3 :accelerator_compatible_browser\\#ref-browser_id ?T1 .  ?T1 :browser\\#name ?T1_name . ?T2 :web_client_accelerator\\#name ?T2_name . ?T3 :accelerator_compatible_browser\\#compatible_since_year ?T3_compatible_since_year . ?T2 a :web_client_accelerator . ?T3 :accelerator_compatible_browser\\#ref-accelerator_id ?T2 .  ?T1 :browser\\#name ?T1_name . ?T2 :web_client_accelerator\\#name ?T2_name . ?T3 :accelerator_compatible_browser\\#compatible_since_year ?T3_compatible_since_year .        }  ORDER BY DESC (?T3_compatible_since_year)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/browser_web__browser/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :browser .\n      ?T1 :browser\\#name ?T1_name .\n      ?T1 :browser\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/browser_web__web_client_accelerator/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 :web_client_accelerator\\#name ?T2_name .\n      ?T2 a :web_client_accelerator .\n      ?T2 :web_client_accelerator\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/browser_web__accelerator_compatible_browser/sparql> {\n    ?T3 a :accelerator_compatible_browser .\n      ?T3 :accelerator_compatible_browser\\#ref-browser_id ?T1 .\n      ?T3 :accelerator_compatible_browser\\#compatible_since_year ?T3_compatible_since_year .\n      ?T3 :accelerator_compatible_browser\\#ref-accelerator_id ?T2 .\n      ?T3 :accelerator_compatible_browser\\#compatible_since_year ?T3_compatible_since_year\n  }\n}\nORDER BY DESC (?T3_compatible_since_year)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/web_client_accelerator",
        "url": "http://host.docker.internal:3030/browser_web__web_client_accelerator/sparql"
      },
      {
        "class": "http://valuenet/ontop/accelerator_compatible_browser",
        "url": "http://host.docker.internal:3030/browser_web__accelerator_compatible_browser/sparql"
      },
      {
        "class": "http://valuenet/ontop/browser",
        "url": "http://host.docker.internal:3030/browser_web__browser/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 9,
      "federated_count": 9,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "candidate_poll_161",
    "kg_name": "candidate_poll",
    "split": "train",
    "question": "Find the name and gender of the candidate who got the highest support rate.",
    "original_sparql": "SELECT ?T1_name ?T1_sex WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\\#ref-people_id ?T1 .  ?T1 :people\\#name ?T1_name . ?T1 :people\\#sex ?T1_sex . ?T2 :candidate\\#support_rate ?T2_support_rate .        }   ORDER BY DESC (?T2_support_rate) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_sex WHERE {\n  SERVICE <http://host.docker.internal:3030/candidate_poll__people/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T1_sex WHERE {\n      ?T1 a :people .\n      ?T1 :people\\#name ?T1_name .\n      ?T1 :people\\#sex ?T1_sex\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/candidate_poll__candidate/sparql> {\n    ?T2 a :candidate .\n      ?T2 :candidate\\#ref-people_id ?T1 .\n      ?T2 :candidate\\#support_rate ?T2_support_rate\n  }\n}\nORDER BY DESC (?T2_support_rate) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/candidate_poll__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/candidate",
        "url": "http://host.docker.internal:3030/candidate_poll__candidate/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]