[
  {
    "id": "department_store_703",
    "kg_name": "department_store",
    "split": "train",
    "question": "Return the staff ids and genders for any staff with the title Department Manager.",
    "original_sparql": "SELECT ?T1_staff_id ?T1_staff_gender WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\\#ref-staff_id ?T1 .  ?T1 :staff\\#staff_id ?T1_staff_id . ?T1 :staff\\#staff_gender ?T1_staff_gender . ?T2 :staff_department_assignments\\#job_title_code ?T2_job_title_code . FILTER(?T2_job_title_code = 'Department Manager') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_staff_id ?T1_staff_gender WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__staff/sparql> {\n    SELECT DISTINCT ?T1 ?T1_staff_gender ?T1_staff_id WHERE {\n      ?T1 a :staff .\n      ?T1 :staff\\#staff_id ?T1_staff_id .\n      ?T1 :staff\\#staff_gender ?T1_staff_gender\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__staff_department_assignments/sparql> {\n    ?T2 a :staff_department_assignments .\n      ?T2 :staff_department_assignments\\#ref-staff_id ?T1 .\n      ?T2 :staff_department_assignments\\#job_title_code ?T2_job_title_code\n      FILTER(?T2_job_title_code = 'Department Manager')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_705",
    "kg_name": "department_store",
    "split": "train",
    "question": "Return the name, phone number and email address for the customer with the most orders.",
    "original_sparql": "SELECT ?T1_customer_name (count( *) as ?aggregation_all) ?T1_customer_phone ?T1_customer_email WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T1 :customers\\#customer_phone ?T1_customer_phone . ?T1 :customers\\#customer_email ?T1_customer_email .        } GROUP BY ?T1_customer_name ?T1_customer_phone ?T1_customer_email  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_name (count( *) as ?aggregation_all) ?T1_customer_phone ?T1_customer_email WHERE {\n  {\n    SELECT ?T1 ?T1_customer_email ?T1_customer_name ?T1_customer_phone ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_email ?T1_customer_name ?T1_customer_phone WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_phone ?T1_customer_phone .\n      ?T1 :customers\\#customer_email ?T1_customer_email\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__customer_orders/sparql> {\n    ?T2 a :customer_orders .\n      ?T2 :customer_orders\\#ref-customer_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_customer_name ?T1_customer_phone ?T1_customer_email  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_707",
    "kg_name": "department_store",
    "split": "train",
    "question": "Count the number of stores the chain South has.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :department_stores . ?T2 a :department_store_chain . ?T1 :department_stores\\#ref-dept_store_chain_id ?T2 .  ?T2 :department_store_chain\\#dept_store_chain_name ?T2_dept_store_chain_name . FILTER(?T2_dept_store_chain_name = 'South') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_dept_store_chain_name WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__department_store_chain/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :department_store_chain .\n      ?T2 :department_store_chain\\#dept_store_chain_name ?T2_dept_store_chain_name\n      FILTER(?T2_dept_store_chain_name = 'South')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__department_stores/sparql> {\n    ?T1 a :department_stores .\n      ?T1 :department_stores\\#ref-dept_store_chain_id ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_709",
    "kg_name": "department_store",
    "split": "train",
    "question": "Return the name and job title of the staff with the latest date assigned.",
    "original_sparql": "SELECT ?T1_staff_name ?T2_job_title_code WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\\#ref-staff_id ?T1 .  ?T1 :staff\\#staff_name ?T1_staff_name . ?T2 :staff_department_assignments\\#job_title_code ?T2_job_title_code . ?T2 :staff_department_assignments\\#date_assigned_to ?T2_date_assigned_to .        }   ORDER BY DESC (?T2_date_assigned_to) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_staff_name ?T2_job_title_code WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__staff/sparql> {\n    SELECT DISTINCT ?T1 ?T1_staff_name WHERE {\n      ?T1 a :staff .\n      ?T1 :staff\\#staff_name ?T1_staff_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__staff_department_assignments/sparql> {\n    ?T2 a :staff_department_assignments .\n      ?T2 :staff_department_assignments\\#ref-staff_id ?T1 .\n      ?T2 :staff_department_assignments\\#job_title_code ?T2_job_title_code .\n      ?T2 :staff_department_assignments\\#date_assigned_to ?T2_date_assigned_to\n  }\n}\nORDER BY DESC (?T2_date_assigned_to) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_710",
    "kg_name": "department_store",
    "split": "train",
    "question": "Give me the product type, name and price for all the products supplied by supplier id 3.",
    "original_sparql": "SELECT ?T1_product_type_code ?T1_product_name ?T1_product_price WHERE { ?T1 a :products . ?T2 a :product_suppliers . ?T2 :product_suppliers\\#ref-product_id ?T1 .  ?T1 :products\\#product_type_code ?T1_product_type_code . ?T1 :products\\#product_name ?T1_product_name . ?T1 :products\\#product_price ?T1_product_price . ?T2 :product_suppliers\\#supplier_id ?T2_supplier_id . FILTER(?T2_supplier_id = 3) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_type_code ?T1_product_name ?T1_product_price WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__products/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_name ?T1_product_price ?T1_product_type_code WHERE {\n      ?T1 a :products .\n      ?T1 :products\\#product_type_code ?T1_product_type_code .\n      ?T1 :products\\#product_name ?T1_product_name .\n      ?T1 :products\\#product_price ?T1_product_price\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__product_suppliers/sparql> {\n    ?T2 a :product_suppliers .\n      ?T2 :product_suppliers\\#ref-product_id ?T1 .\n      ?T2 :product_suppliers\\#supplier_id ?T2_supplier_id\n      FILTER(?T2_supplier_id = 3)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_712",
    "kg_name": "department_store",
    "split": "train",
    "question": "Return the distinct name of customers whose order status is Pending, in the order of customer id.",
    "original_sparql": "SELECT DISTINCT ?T1_customer_name ?T2_customer_id WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :customer_orders\\#customer_id ?T2_customer_id . ?T2 :customer_orders\\#customer_id ?T2_customer_id . ?T2 :customer_orders\\#order_status_code ?T2_order_status_code . FILTER(?T2_order_status_code = 'Pending') .        }  ORDER BY ASC (?T2_customer_id)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_customer_name ?T2_customer_id WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__customer_orders/sparql> {\n    ?T2 a :customer_orders .\n      ?T2 :customer_orders\\#ref-customer_id ?T1 .\n      ?T2 :customer_orders\\#customer_id ?T2_customer_id .\n      ?T2 :customer_orders\\#customer_id ?T2_customer_id .\n      ?T2 :customer_orders\\#order_status_code ?T2_order_status_code\n      FILTER(?T2_order_status_code = 'Pending')\n  }\n}\nORDER BY ASC (?T2_customer_id)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "department_store_714",
    "kg_name": "department_store",
    "split": "train",
    "question": "Find the name and address of the customers who have both New and Pending orders.",
    "original_sparql": "SELECT DISTINCT ?T1_customer_name ?T1_customer_address WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T1 :customers\\#customer_address ?T1_customer_address . ?T2 :customer_orders\\#order_status_code ?T2_order_status_code . FILTER(?T2_order_status_code = 'New') . FILTER (?T1_customer_name in (?T3_customer_name)) . FILTER (?T1_customer_address in (?T3_customer_address)) .   ?T3 a :customers . ?T4 a :customer_orders . ?T4 :customer_orders\\#ref-customer_id ?T3 .  ?T3 :customers\\#customer_name ?T3_customer_name . ?T3 :customers\\#customer_address ?T3_customer_address . ?T4 :customer_orders\\#order_status_code ?T4_order_status_code .  FILTER(?T4_order_status_code = 'Pending') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_customer_name ?T1_customer_address WHERE {\n  SERVICE <http://host.docker.internal:3030/department_store__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_address ?T1_customer_name ?T3 ?T3_customer_address ?T3_customer_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_address ?T1_customer_address .\n      ?T3 a :customers .\n      ?T3 :customers\\#customer_name ?T3_customer_name .\n      ?T3 :customers\\#customer_address ?T3_customer_address\n      FILTER (?T1_customer_name in (?T3_customer_name))\n      FILTER (?T1_customer_address in (?T3_customer_address))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/department_store__customer_orders/sparql> {\n    ?T2 a :customer_orders .\n      ?T2 :customer_orders\\#ref-customer_id ?T1 .\n      ?T2 :customer_orders\\#order_status_code ?T2_order_status_code .\n      ?T4 a :customer_orders .\n      ?T4 :customer_orders\\#ref-customer_id ?T3 .\n      ?T4 :customer_orders\\#order_status_code ?T4_order_status_code\n      FILTER(?T2_order_status_code = 'New')\n      FILTER(?T4_order_status_code = 'Pending')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/department_store__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_suppliers",
        "url": "http://host.docker.internal:3030/department_store__product_suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_department_assignments",
        "url": "http://host.docker.internal:3030/department_store__staff_department_assignments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/department_store__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_stores",
        "url": "http://host.docker.internal:3030/department_store__department_stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_addresses",
        "url": "http://host.docker.internal:3030/department_store__customer_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/suppliers",
        "url": "http://host.docker.internal:3030/department_store__suppliers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/department_store__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/department_store__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/department_store__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/department_store__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/supplier_addresses",
        "url": "http://host.docker.internal:3030/department_store__supplier_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/department_store_chain",
        "url": "http://host.docker.internal:3030/department_store__department_store_chain/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/department_store__departments/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]