[
  {
    "id": "inn_1_1256",
    "kg_name": "inn_1",
    "split": "train",
    "question": "Find the most popular room in the hotel. The most popular room is the room that had seen the largest number of reservations.",
    "original_sparql": "SELECT ?T1_roomname (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\\#ref-room ?T1 .  ?T1 :rooms\\#roomname ?T1_roomname .        } GROUP BY ?T1_roomname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_roomname (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_roomname ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/inn_1__rooms/sparql> {\n    SELECT DISTINCT ?T1 ?T1_roomname WHERE {\n      ?T1 a :rooms .\n      ?T1 :rooms\\#roomname ?T1_roomname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/inn_1__reservations/sparql> {\n    ?T2 a :reservations .\n      ?T2 :reservations\\#ref-room ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_roomname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/reservations",
        "url": "http://host.docker.internal:3030/inn_1__reservations/sparql"
      },
      {
        "class": "http://valuenet/ontop/rooms",
        "url": "http://host.docker.internal:3030/inn_1__rooms/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "inn_1_1258",
    "kg_name": "inn_1",
    "split": "train",
    "question": "Which room has the highest rate? List the room's full name, rate, check in and check out date.",
    "original_sparql": "SELECT ?T2_roomname ?T1_rate ?T1_checkin ?T1_checkout WHERE { ?T1 a :reservations . ?T2 a :rooms .  ?T1 :reservations\\#ref-room ?T2 .  ?T2 :rooms\\#roomname ?T2_roomname . ?T1 :reservations\\#rate ?T1_rate . ?T1 :reservations\\#checkin ?T1_checkin . ?T1 :reservations\\#checkout ?T1_checkout .        }   ORDER BY DESC (?T1_rate) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T2_roomname ?T1_rate ?T1_checkin ?T1_checkout WHERE {\n  SERVICE <http://host.docker.internal:3030/inn_1__rooms/sparql> {\n    SELECT DISTINCT ?T2 ?T2_roomname WHERE {\n      ?T2 a :rooms .\n      ?T2 :rooms\\#roomname ?T2_roomname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/inn_1__reservations/sparql> {\n    ?T1 a :reservations .\n      ?T1 :reservations\\#ref-room ?T2 .\n      ?T1 :reservations\\#rate ?T1_rate .\n      ?T1 :reservations\\#checkin ?T1_checkin .\n      ?T1 :reservations\\#checkout ?T1_checkout\n  }\n}\nORDER BY DESC (?T1_rate) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/reservations",
        "url": "http://host.docker.internal:3030/inn_1__reservations/sparql"
      },
      {
        "class": "http://valuenet/ontop/rooms",
        "url": "http://host.docker.internal:3030/inn_1__rooms/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "inn_1_1259",
    "kg_name": "inn_1",
    "split": "train",
    "question": "Return the name, rate, check in and check out date for the room with the highest rate.",
    "original_sparql": "SELECT ?T1_roomname ?T2_rate ?T2_checkin ?T2_checkout WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\\#ref-room ?T1 .  ?T1 :rooms\\#roomname ?T1_roomname . ?T2 :reservations\\#rate ?T2_rate . ?T2 :reservations\\#checkin ?T2_checkin . ?T2 :reservations\\#checkout ?T2_checkout . ?T2 :reservations\\#rate ?T2_rate .        }   ORDER BY DESC (?T2_rate) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_roomname ?T2_rate ?T2_checkin ?T2_checkout WHERE {\n  SERVICE <http://host.docker.internal:3030/inn_1__rooms/sparql> {\n    SELECT DISTINCT ?T1 ?T1_roomname WHERE {\n      ?T1 a :rooms .\n      ?T1 :rooms\\#roomname ?T1_roomname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/inn_1__reservations/sparql> {\n    ?T2 a :reservations .\n      ?T2 :reservations\\#ref-room ?T1 .\n      ?T2 :reservations\\#rate ?T2_rate .\n      ?T2 :reservations\\#checkin ?T2_checkin .\n      ?T2 :reservations\\#checkout ?T2_checkout .\n      ?T2 :reservations\\#rate ?T2_rate\n  }\n}\nORDER BY DESC (?T2_rate) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/reservations",
        "url": "http://host.docker.internal:3030/inn_1__reservations/sparql"
      },
      {
        "class": "http://valuenet/ontop/rooms",
        "url": "http://host.docker.internal:3030/inn_1__rooms/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "inn_1_1260",
    "kg_name": "inn_1",
    "split": "train",
    "question": "List how many times the number of people in the room reached the maximum occupancy of the room. The number of people include adults and kids.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reservations . ?T1 :reservations\\#adults ?T1_adults . ?T1 :reservations\\#kids ?T1_kids . ?T2 a :rooms . ?T1 :reservations\\#ref-room ?T2 .  ?T2 :rooms\\#maxoccupancy ?T2_maxoccupancy . BIND(?T1_adults +?T1_kids as ?total) FILTER(?T2_maxoccupancy = ?total) . }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_adults ?T1_kids ?T2 ?T2_maxoccupancy ?total WHERE {\n  SERVICE <http://host.docker.internal:3030/inn_1__rooms/sparql> {\n    SELECT DISTINCT ?T2 ?T2_maxoccupancy WHERE {\n      ?T2 a :rooms .\n      ?T2 :rooms\\#maxoccupancy ?T2_maxoccupancy\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/inn_1__reservations/sparql> {\n    ?T1 a :reservations .\n      ?T1 :reservations\\#adults ?T1_adults .\n      ?T1 :reservations\\#kids ?T1_kids .\n      ?T1 :reservations\\#ref-room ?T2 .\n      BIND(?T1_adults +?T1_kids as ?total)\n      FILTER(?T2_maxoccupancy = ?total)\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/reservations",
        "url": "http://host.docker.internal:3030/inn_1__reservations/sparql"
      },
      {
        "class": "http://valuenet/ontop/rooms",
        "url": "http://host.docker.internal:3030/inn_1__rooms/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "inn_1_1262",
    "kg_name": "inn_1",
    "split": "train",
    "question": "Find the first and last names of people who payed more than the rooms' base prices.",
    "original_sparql": "SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :reservations . ?T2 a :rooms . ?T1 :reservations\\#ref-room ?T2 .  ?T1 :reservations\\#firstname ?T1_firstname . ?T1 :reservations\\#lastname ?T1_lastname . ?T1 :reservations\\#rate ?T1_rate . ?T2 :rooms\\#baseprice ?T2_baseprice . FILTER(?T1_rate - ?T2_baseprice > 0) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_firstname ?T1_lastname WHERE {\n  SERVICE <http://host.docker.internal:3030/inn_1__rooms/sparql> {\n    SELECT DISTINCT ?T2 ?T2_baseprice WHERE {\n      ?T2 a :rooms .\n      ?T2 :rooms\\#baseprice ?T2_baseprice\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/inn_1__reservations/sparql> {\n    ?T1 a :reservations .\n      ?T1 :reservations\\#ref-room ?T2 .\n      ?T1 :reservations\\#firstname ?T1_firstname .\n      ?T1 :reservations\\#lastname ?T1_lastname .\n      ?T1 :reservations\\#rate ?T1_rate\n      FILTER(?T1_rate - ?T2_baseprice > 0)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/reservations",
        "url": "http://host.docker.internal:3030/inn_1__reservations/sparql"
      },
      {
        "class": "http://valuenet/ontop/rooms",
        "url": "http://host.docker.internal:3030/inn_1__rooms/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 182,
      "federated_count": 0,
      "missing": 182,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "insurance_and_eclaims_1270",
    "kg_name": "insurance_and_eclaims",
    "split": "train",
    "question": "Find all the policy type codes associated with the customer 'Dayana Robel'",
    "original_sparql": "SELECT ?T1_policy_type_code WHERE { ?T1 a :policies . ?T2 a :customers . ?T1 :policies\\#ref-customer_id ?T2 .  ?T1 :policies\\#policy_type_code ?T1_policy_type_code . ?T2 :customers\\#customer_details ?T2_customer_details . FILTER(?T2_customer_details = 'Dayana Robel') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_policy_type_code WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_customer_details WHERE {\n      ?T2 a :customers .\n      ?T2 :customers\\#customer_details ?T2_customer_details\n      FILTER(?T2_customer_details = 'Dayana Robel')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql> {\n    ?T1 a :policies .\n      ?T1 :policies\\#ref-customer_id ?T2 .\n      ?T1 :policies\\#policy_type_code ?T1_policy_type_code\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/policies",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claim_headers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_documents",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing_stages",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing_stages/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__staff/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_and_eclaims_1272",
    "kg_name": "insurance_and_eclaims",
    "split": "train",
    "question": "Find the total amount claimed in the most recently created document.",
    "original_sparql": "SELECT (sum( ?T1_amount_claimed) as ?aggregation_T1_amount_claimed_179 ) WHERE { ?T1 a :claim_headers . ?T2 a :claims_documents . ?T2 :claims_documents\\#ref-claim_id ?T1 .  ?T1 :claim_headers\\#amount_claimed ?T1_amount_claimed . ?T2 :claims_documents\\#created_date ?T2_created_date . FILTER(?T2_created_date = (?T23_created_date)) .       {SELECT ?T23_created_date WHERE { ?T23 a :claims_documents . ?T23 :claims_documents\\#created_date ?T23_created_date . ?T23 :claims_documents\\#created_date ?T23_created_date .        }   ORDER BY ASC (?T23_created_date) LIMIT 1 } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_amount_claimed) as ?aggregation_T1_amount_claimed_179 ) WHERE {\n  {\n    SELECT ?T1 ?T1_amount_claimed ?T2 ?T23_created_date ?T2_created_date WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_amount_claimed WHERE {\n      ?T1 a :claim_headers .\n      ?T1 :claim_headers\\#amount_claimed ?T1_amount_claimed\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql> {\n    ?T2 a :claims_documents .\n      ?T2 :claims_documents\\#ref-claim_id ?T1 .\n      ?T2 :claims_documents\\#created_date ?T2_created_date\n      FILTER(?T2_created_date = (?T23_created_date))\n  }\n    }\n  }\n  {\n    SELECT ?T23_created_date WHERE {\n      SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql> {\n        ?T23 a :claims_documents . ?T23 :claims_documents\\#created_date ?T23_created_date . ?T23 :claims_documents\\#created_date ?T23_created_date . } ORDER BY ASC (?T23_created_date) LIMIT 1\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/policies",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claim_headers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_documents",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing_stages",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing_stages/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__staff/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "insurance_and_eclaims_1275",
    "kg_name": "insurance_and_eclaims",
    "split": "train",
    "question": "Which customer made the largest amount of claim in a single claim? Return the customer details.",
    "original_sparql": "SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T13 a :policies . ?T13 :policies\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_details ?T1_customer_details . ?T2 :claim_headers\\#amount_claimed ?T2_amount_claimed . ?T2 a :claim_headers . ?T2 :claim_headers\\#ref-policy_id ?T13 .  ?T1 :customers\\#customer_details ?T1_customer_details . ?T2 :claim_headers\\#amount_claimed ?T2_amount_claimed . FILTER(?T2_amount_claimed = (?aggregation_T23_amount_claimed_39)) .       {SELECT (max( ?T23_amount_claimed) as ?aggregation_T23_amount_claimed_39 ) WHERE { ?T23 a :claim_headers . ?T23 :claim_headers\\#amount_claimed ?T23_amount_claimed .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_details WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_details WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_details ?T1_customer_details .\n      ?T1 :customers\\#customer_details ?T1_customer_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql> {\n    SELECT DISTINCT ?T1 ?T13 WHERE {\n      ?T13 a :policies .\n      ?T13 :policies\\#ref-customer_id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql> {\n    ?T2 :claim_headers\\#amount_claimed ?T2_amount_claimed .\n      ?T2 a :claim_headers .\n      ?T2 :claim_headers\\#ref-policy_id ?T13 .\n      ?T2 :claim_headers\\#amount_claimed ?T2_amount_claimed\n      FILTER(?T2_amount_claimed = (?aggregation_T23_amount_claimed_39))\n  }\n  {\n    SELECT (max( ?T23_amount_claimed) as ?aggregation_T23_amount_claimed_39 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql> {\n        ?T23 a :claim_headers . ?T23 :claim_headers\\#amount_claimed ?T23_amount_claimed . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/policies",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claim_headers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_documents",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing_stages",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing_stages/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__staff/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "insurance_and_eclaims_1277",
    "kg_name": "insurance_and_eclaims",
    "split": "train",
    "question": "Which customer made the smallest amount of claim in one claim? Return the customer details.",
    "original_sparql": "SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T13 a :policies . ?T13 :policies\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_details ?T1_customer_details . ?T2 :claim_headers\\#amount_piad ?T2_amount_piad . ?T2 a :claim_headers . ?T2 :claim_headers\\#ref-policy_id ?T13 .  ?T1 :customers\\#customer_details ?T1_customer_details . ?T2 :claim_headers\\#amount_piad ?T2_amount_piad . FILTER(?T2_amount_piad = (?aggregation_T23_amount_piad_16)) .       {SELECT (min( ?T23_amount_piad) as ?aggregation_T23_amount_piad_16 ) WHERE { ?T23 a :claim_headers . ?T23 :claim_headers\\#amount_piad ?T23_amount_piad .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_details WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_details WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_details ?T1_customer_details .\n      ?T1 :customers\\#customer_details ?T1_customer_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql> {\n    SELECT DISTINCT ?T1 ?T13 WHERE {\n      ?T13 a :policies .\n      ?T13 :policies\\#ref-customer_id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql> {\n    ?T2 :claim_headers\\#amount_piad ?T2_amount_piad .\n      ?T2 a :claim_headers .\n      ?T2 :claim_headers\\#ref-policy_id ?T13 .\n      ?T2 :claim_headers\\#amount_piad ?T2_amount_piad\n      FILTER(?T2_amount_piad = (?aggregation_T23_amount_piad_16))\n  }\n  {\n    SELECT (min( ?T23_amount_piad) as ?aggregation_T23_amount_piad_16 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql> {\n        ?T23 a :claim_headers . ?T23 :claim_headers\\#amount_piad ?T23_amount_piad . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/policies",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claim_headers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_documents",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing_stages",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing_stages/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__staff/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "insurance_and_eclaims_1278",
    "kg_name": "insurance_and_eclaims",
    "split": "train",
    "question": "Find the names of the customers who have an deputy policy.",
    "original_sparql": "SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :policies . ?T2 :policies\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_details ?T1_customer_details . ?T2 :policies\\#policy_type_code ?T2_policy_type_code . FILTER(?T2_policy_type_code = 'Deputy') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_customer_details WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_details WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_details ?T1_customer_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql> {\n    ?T2 a :policies .\n      ?T2 :policies\\#ref-customer_id ?T1 .\n      ?T2 :policies\\#policy_type_code ?T2_policy_type_code\n      FILTER(?T2_policy_type_code = 'Deputy')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/policies",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claim_headers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_documents",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing_stages",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing_stages/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__staff/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_and_eclaims_1285",
    "kg_name": "insurance_and_eclaims",
    "split": "train",
    "question": "Find the customer who started a policy most recently.",
    "original_sparql": "SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :policies . ?T2 :policies\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_details ?T1_customer_details . ?T2 :policies\\#start_date ?T2_start_date . FILTER(?T2_start_date = (?aggregation_T23_start_date_190)) .       {SELECT (max( ?T23_start_date) as ?aggregation_T23_start_date_190 ) WHERE { ?T23 a :policies . ?T23 :policies\\#start_date ?T23_start_date .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_details WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_details WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_details ?T1_customer_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql> {\n    ?T2 a :policies .\n      ?T2 :policies\\#ref-customer_id ?T1 .\n      ?T2 :policies\\#start_date ?T2_start_date\n      FILTER(?T2_start_date = (?aggregation_T23_start_date_190))\n  }\n  {\n    SELECT (max( ?T23_start_date) as ?aggregation_T23_start_date_190 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql> {\n        ?T23 a :policies . ?T23 :policies\\#start_date ?T23_start_date . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/policies",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claim_headers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claim_headers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_documents",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims_processing_stages",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__claims_processing_stages/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/insurance_and_eclaims__staff/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "insurance_fnol_1286",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "Find the name of services that have been used for more than 2 times in first notification of loss.",
    "original_sparql": "SELECT ?T1_service_name WHERE { ?T1 a :services . ?T2 a :first_notification_of_loss . ?T2 :first_notification_of_loss\\#ref-service_id ?T1 .  ?T1 :services\\#service_name ?T1_service_name .        } GROUP BY ?T1_service_name   HAVING(count( *)  > 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_service_name WHERE {\n  {\n    SELECT ?T1 ?T1_service_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__services/sparql> {\n    SELECT DISTINCT ?T1 ?T1_service_name WHERE {\n      ?T1 a :services .\n      ?T1 :services\\#service_name ?T1_service_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql> {\n    ?T2 a :first_notification_of_loss .\n      ?T2 :first_notification_of_loss\\#ref-service_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_service_name   HAVING(count( *)  > 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_fnol_1289",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "Find the claim that has the largest total settlement amount. Return the effective date of the claim.",
    "original_sparql": "SELECT ?T1_effective_date WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\\#ref-claim_id ?T1 .  ?T1 :claims\\#effective_date ?T1_effective_date . ?T2 :settlements\\#settlement_amount ?T2_settlement_amount .        } GROUP BY ?T1_effective_date  ORDER BY DESC ((sum( ?T2_settlement_amount) as ?aggregation_T2_settlement_amount_11 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_effective_date WHERE {\n  {\n    SELECT ?T1 ?T1_effective_date ?T2 ?T2_settlement_amount WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__claims/sparql> {\n    SELECT DISTINCT ?T1 ?T1_effective_date WHERE {\n      ?T1 a :claims .\n      ?T1 :claims\\#effective_date ?T1_effective_date\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__settlements/sparql> {\n    ?T2 a :settlements .\n      ?T2 :settlements\\#ref-claim_id ?T1 .\n      ?T2 :settlements\\#settlement_amount ?T2_settlement_amount\n  }\n    }\n  }\n}\nGROUP BY ?T1_effective_date  ORDER BY DESC ((sum( ?T2_settlement_amount) as ?aggregation_T2_settlement_amount_11 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  }
]