[
  {
    "id": "local_govt_and_lot_1349",
    "kg_name": "local_govt_and_lot",
    "split": "train",
    "question": "How many services has each resident requested? List the resident id, details, and the count in descending order of the count.",
    "original_sparql": "SELECT ?T1_resident_id ?T1_other_details (count( *) as ?aggregation_all) WHERE { ?T1 a :residents . ?T2 a :residents_services . ?T2 :residents_services\\#ref-resident_id ?T1 .  ?T1 :residents\\#resident_id ?T1_resident_id . ?T1 :residents\\#other_details ?T1_other_details .        } GROUP BY ?T1_resident_id ?T1_other_details ORDER BY DESC ((count( *) as ?aggregation_all))",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_resident_id ?T1_other_details (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_other_details ?T1_resident_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__residents/sparql> {\n    SELECT DISTINCT ?T1 ?T1_other_details ?T1_resident_id WHERE {\n      ?T1 a :residents .\n      ?T1 :residents\\#resident_id ?T1_resident_id .\n      ?T1 :residents\\#other_details ?T1_other_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql> {\n    ?T2 a :residents_services .\n      ?T2 :residents_services\\#ref-resident_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_resident_id ?T1_other_details ORDER BY DESC ((count( *) as ?aggregation_all))",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/residents_services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/organizations",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__organizations/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_locations_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_locations_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_event_notes",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_event_notes/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__things/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_status_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_status_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_events",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/properties",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__properties/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/residents",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "local_govt_and_lot_1350",
    "kg_name": "local_govt_and_lot",
    "split": "train",
    "question": "What is the maximum number that a certain service is provided? List the service id, details and number.",
    "original_sparql": "SELECT ?T1_service_id (count( *) as ?aggregation_all) ?T1_service_details (count( *) as ?aggregation_all) WHERE { ?T1 a :services . ?T2 a :residents_services . ?T2 :residents_services\\#ref-service_id ?T1 .  ?T1 :services\\#service_id ?T1_service_id . ?T1 :services\\#service_details ?T1_service_details .        } GROUP BY ?T1_service_id ?T1_service_details  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_service_id (count( *) as ?aggregation_all) ?T1_service_details (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_service_details ?T1_service_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__services/sparql> {\n    SELECT DISTINCT ?T1 ?T1_service_details ?T1_service_id WHERE {\n      ?T1 a :services .\n      ?T1 :services\\#service_id ?T1_service_id .\n      ?T1 :services\\#service_details ?T1_service_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql> {\n    ?T2 a :residents_services .\n      ?T2 :residents_services\\#ref-service_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_service_id ?T1_service_details  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/residents_services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/organizations",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__organizations/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_locations_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_locations_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_event_notes",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_event_notes/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__things/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_status_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_status_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_events",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/properties",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__properties/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/residents",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "local_govt_and_lot_1351",
    "kg_name": "local_govt_and_lot",
    "split": "train",
    "question": "List the id and type of each thing, and the details of the organization that owns it.",
    "original_sparql": "SELECT ?T1_thing_id ?T1_type_of_thing_code ?T2_organization_details WHERE { ?T1 a :things . ?T2 a :organizations . ?T1 :things\\#ref-organization_id ?T2 .  ?T1 :things\\#thing_id ?T1_thing_id . ?T1 :things\\#type_of_thing_code ?T1_type_of_thing_code . ?T2 :organizations\\#organization_details ?T2_organization_details .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_thing_id ?T1_type_of_thing_code ?T2_organization_details WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__organizations/sparql> {\n    SELECT DISTINCT ?T2 ?T2_organization_details WHERE {\n      ?T2 a :organizations .\n      ?T2 :organizations\\#organization_details ?T2_organization_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__things/sparql> {\n    ?T1 a :things .\n      ?T1 :things\\#ref-organization_id ?T2 .\n      ?T1 :things\\#thing_id ?T1_thing_id .\n      ?T1 :things\\#type_of_thing_code ?T1_type_of_thing_code\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/residents_services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/organizations",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__organizations/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_locations_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_locations_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_event_notes",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_event_notes/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__things/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_status_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_status_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_events",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/properties",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__properties/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/residents",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "local_govt_and_lot_1354",
    "kg_name": "local_govt_and_lot",
    "split": "train",
    "question": "Which events have the number of notes between one and three? List the event id and the property id.",
    "original_sparql": "SELECT ?T1_customer_event_id ?T1_property_id WHERE { ?T1 a :customer_events . ?T2 a :customer_event_notes . ?T2 :customer_event_notes\\#ref-customer_event_id ?T1 .  ?T1 :customer_events\\#customer_event_id ?T1_customer_event_id . ?T1 :customer_events\\#property_id ?T1_property_id .        } GROUP BY ?T1_customer_event_id ?T1_property_id   HAVING(count( *)  >= 1 && count( *)  <= 3)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_event_id ?T1_property_id WHERE {\n  {\n    SELECT ?T1 ?T1_customer_event_id ?T1_property_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__customer_events/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_event_id ?T1_property_id WHERE {\n      ?T1 a :customer_events .\n      ?T1 :customer_events\\#customer_event_id ?T1_customer_event_id .\n      ?T1 :customer_events\\#property_id ?T1_property_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__customer_event_notes/sparql> {\n    ?T2 a :customer_event_notes .\n      ?T2 :customer_event_notes\\#ref-customer_event_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_customer_event_id ?T1_property_id   HAVING(count( *)  >= 1 && count( *)  <= 3)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/residents_services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/organizations",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__organizations/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_locations_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_locations_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_event_notes",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_event_notes/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__things/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_status_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_status_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_events",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/properties",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__properties/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/residents",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "local_govt_and_lot_1355",
    "kg_name": "local_govt_and_lot",
    "split": "train",
    "question": "What are the distinct id and type of the thing that has the status 'Close' or has a status record before the date '2017-06-19 02:59:21'",
    "original_sparql": "SELECT DISTINCT ?T1_thing_id ?T1_type_of_thing_code WHERE { ?T1 a :things . ?T2 a :timed_status_of_things . ?T2 :timed_status_of_things\\#ref-thing_id ?T1 .  ?T1 :things\\#thing_id ?T1_thing_id . ?T1 :things\\#type_of_thing_code ?T1_type_of_thing_code . ?T2 :timed_status_of_things\\#status_of_thing_code ?T2_status_of_thing_code . ?T2 :timed_status_of_things\\#date_and_date ?T2_date_and_date . FILTER(?T2_status_of_thing_code = 'Close' || ?T2_date_and_date < 2017-06-19 02:59:21) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_thing_id ?T1_type_of_thing_code WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__things/sparql> {\n    SELECT DISTINCT ?T1 ?T1_thing_id ?T1_type_of_thing_code WHERE {\n      ?T1 a :things .\n      ?T1 :things\\#thing_id ?T1_thing_id .\n      ?T1 :things\\#type_of_thing_code ?T1_type_of_thing_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__timed_status_of_things/sparql> {\n    ?T2 a :timed_status_of_things .\n      ?T2 :timed_status_of_things\\#ref-thing_id ?T1 .\n      ?T2 :timed_status_of_things\\#status_of_thing_code ?T2_status_of_thing_code .\n      ?T2 :timed_status_of_things\\#date_and_date ?T2_date_and_date\n      FILTER(?T2_status_of_thing_code = 'Close' || ?T2_date_and_date < 2017-06-19 02:59:21)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/residents_services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/organizations",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__organizations/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_locations_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_locations_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_event_notes",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_event_notes/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__things/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_status_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_status_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_events",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/properties",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__properties/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/residents",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "local_govt_in_alabama_1359",
    "kg_name": "local_govt_in_alabama",
    "split": "train",
    "question": "How many events have each participants attended? List the participant id, type and the number.",
    "original_sparql": "SELECT ?T1_participant_id ?T1_participant_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :participants . ?T2 a :participants_in_events . ?T2 :participants_in_events\\#ref-participant_id ?T1 .  ?T1 :participants\\#participant_id ?T1_participant_id . ?T1 :participants\\#participant_type_code ?T1_participant_type_code .        } GROUP BY ?T1_participant_id ?T1_participant_type_code",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_participant_id ?T1_participant_type_code (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_participant_id ?T1_participant_type_code ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_in_alabama__participants/sparql> {\n    SELECT DISTINCT ?T1 ?T1_participant_id ?T1_participant_type_code WHERE {\n      ?T1 a :participants .\n      ?T1 :participants\\#participant_id ?T1_participant_id .\n      ?T1 :participants\\#participant_type_code ?T1_participant_type_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_in_alabama__participants_in_events/sparql> {\n    ?T2 a :participants_in_events .\n      ?T2 :participants_in_events\\#ref-participant_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_participant_id ?T1_participant_type_code",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participants_in_events",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__participants_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/events",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__events/sparql"
      },
      {
        "class": "http://valuenet/ontop/participants",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__participants/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 10,
      "federated_count": 10,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "local_govt_in_alabama_1360",
    "kg_name": "local_govt_in_alabama",
    "split": "train",
    "question": "How many events had participants whose details had the substring 'Dr.'",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :participants_in_events . ?T2 a :participants . ?T1 :participants_in_events\\#ref-participant_id ?T2 .  ?T2 :participants\\#participant_details ?T2_participant_details . FILTER(contains (?T2_participant_details, 'Dr.')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_participant_details WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_in_alabama__participants/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :participants .\n      ?T2 :participants\\#participant_details ?T2_participant_details\n      FILTER(contains (?T2_participant_details, 'Dr.'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_in_alabama__participants_in_events/sparql> {\n    ?T1 a :participants_in_events .\n      ?T1 :participants_in_events\\#ref-participant_id ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participants_in_events",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__participants_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/events",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__events/sparql"
      },
      {
        "class": "http://valuenet/ontop/participants",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__participants/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_in_alabama__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "local_govt_mdm_1364",
    "kg_name": "local_govt_mdm",
    "split": "train",
    "question": "What is the cmi cross reference id that is related to at least one council tax entry? List the cross reference id and source system code.",
    "original_sparql": "SELECT ?T1_cmi_cross_ref_id ?T1_source_system_code WHERE { ?T1 a :cmi_cross_references . ?T2 a :council_tax . ?T2 :council_tax\\#ref-cmi_cross_ref_id ?T1 .  ?T1 :cmi_cross_references\\#cmi_cross_ref_id ?T1_cmi_cross_ref_id . ?T1 :cmi_cross_references\\#source_system_code ?T1_source_system_code .        } GROUP BY ?T1_cmi_cross_ref_id ?T1_source_system_code   HAVING(count( *)  >= 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_cmi_cross_ref_id ?T1_source_system_code WHERE {\n  {\n    SELECT ?T1 ?T1_cmi_cross_ref_id ?T1_source_system_code ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_mdm__cmi_cross_references/sparql> {\n    SELECT DISTINCT ?T1 ?T1_cmi_cross_ref_id ?T1_source_system_code WHERE {\n      ?T1 a :cmi_cross_references .\n      ?T1 :cmi_cross_references\\#cmi_cross_ref_id ?T1_cmi_cross_ref_id .\n      ?T1 :cmi_cross_references\\#source_system_code ?T1_source_system_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_mdm__council_tax/sparql> {\n    ?T2 a :council_tax .\n      ?T2 :council_tax\\#ref-cmi_cross_ref_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_cmi_cross_ref_id ?T1_source_system_code   HAVING(count( *)  >= 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/cmi_cross_references",
        "url": "http://host.docker.internal:3030/local_govt_mdm__cmi_cross_references/sparql"
      },
      {
        "class": "http://valuenet/ontop/business_rates",
        "url": "http://host.docker.internal:3030/local_govt_mdm__business_rates/sparql"
      },
      {
        "class": "http://valuenet/ontop/council_tax",
        "url": "http://host.docker.internal:3030/local_govt_mdm__council_tax/sparql"
      },
      {
        "class": "http://valuenet/ontop/electoral_register",
        "url": "http://host.docker.internal:3030/local_govt_mdm__electoral_register/sparql"
      },
      {
        "class": "http://valuenet/ontop/benefits_overpayments",
        "url": "http://host.docker.internal:3030/local_govt_mdm__benefits_overpayments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_master_index",
        "url": "http://host.docker.internal:3030/local_govt_mdm__customer_master_index/sparql"
      },
      {
        "class": "http://valuenet/ontop/rent_arrears",
        "url": "http://host.docker.internal:3030/local_govt_mdm__rent_arrears/sparql"
      },
      {
        "class": "http://valuenet/ontop/parking_fines",
        "url": "http://host.docker.internal:3030/local_govt_mdm__parking_fines/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "local_govt_mdm_1365",
    "kg_name": "local_govt_mdm",
    "split": "train",
    "question": "How many business rates are related to each cmi cross reference? List cross reference id, master customer id and the n",
    "original_sparql": "SELECT ?T1_cmi_cross_ref_id ?T1_master_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :cmi_cross_references . ?T2 a :business_rates . ?T2 :business_rates\\#ref-cmi_cross_ref_id ?T1 .  ?T1 :cmi_cross_references\\#cmi_cross_ref_id ?T1_cmi_cross_ref_id . ?T1 :cmi_cross_references\\#master_customer_id ?T1_master_customer_id .        } GROUP BY ?T1_cmi_cross_ref_id ?T1_master_customer_id",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_cmi_cross_ref_id ?T1_master_customer_id (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_cmi_cross_ref_id ?T1_master_customer_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_mdm__cmi_cross_references/sparql> {\n    SELECT DISTINCT ?T1 ?T1_cmi_cross_ref_id ?T1_master_customer_id WHERE {\n      ?T1 a :cmi_cross_references .\n      ?T1 :cmi_cross_references\\#cmi_cross_ref_id ?T1_cmi_cross_ref_id .\n      ?T1 :cmi_cross_references\\#master_customer_id ?T1_master_customer_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_mdm__business_rates/sparql> {\n    ?T2 a :business_rates .\n      ?T2 :business_rates\\#ref-cmi_cross_ref_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_cmi_cross_ref_id ?T1_master_customer_id",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/cmi_cross_references",
        "url": "http://host.docker.internal:3030/local_govt_mdm__cmi_cross_references/sparql"
      },
      {
        "class": "http://valuenet/ontop/business_rates",
        "url": "http://host.docker.internal:3030/local_govt_mdm__business_rates/sparql"
      },
      {
        "class": "http://valuenet/ontop/council_tax",
        "url": "http://host.docker.internal:3030/local_govt_mdm__council_tax/sparql"
      },
      {
        "class": "http://valuenet/ontop/electoral_register",
        "url": "http://host.docker.internal:3030/local_govt_mdm__electoral_register/sparql"
      },
      {
        "class": "http://valuenet/ontop/benefits_overpayments",
        "url": "http://host.docker.internal:3030/local_govt_mdm__benefits_overpayments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_master_index",
        "url": "http://host.docker.internal:3030/local_govt_mdm__customer_master_index/sparql"
      },
      {
        "class": "http://valuenet/ontop/rent_arrears",
        "url": "http://host.docker.internal:3030/local_govt_mdm__rent_arrears/sparql"
      },
      {
        "class": "http://valuenet/ontop/parking_fines",
        "url": "http://host.docker.internal:3030/local_govt_mdm__parking_fines/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "local_govt_mdm_1366",
    "kg_name": "local_govt_mdm",
    "split": "train",
    "question": "What is the tax source system code related to the benefits and overpayments? List the code and the benifit id, order by benifit id.",
    "original_sparql": "SELECT ?T1_source_system_code ?T2_council_tax_id WHERE { ?T1 a :cmi_cross_references . ?T2 a :benefits_overpayments . ?T2 :benefits_overpayments\\#ref-cmi_cross_ref_id ?T1 .  ?T1 :cmi_cross_references\\#source_system_code ?T1_source_system_code . ?T2 :benefits_overpayments\\#council_tax_id ?T2_council_tax_id . ?T2 :benefits_overpayments\\#council_tax_id ?T2_council_tax_id .        }  ORDER BY ASC (?T2_council_tax_id)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_source_system_code ?T2_council_tax_id WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_mdm__cmi_cross_references/sparql> {\n    SELECT DISTINCT ?T1 ?T1_source_system_code WHERE {\n      ?T1 a :cmi_cross_references .\n      ?T1 :cmi_cross_references\\#source_system_code ?T1_source_system_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_mdm__benefits_overpayments/sparql> {\n    ?T2 a :benefits_overpayments .\n      ?T2 :benefits_overpayments\\#ref-cmi_cross_ref_id ?T1 .\n      ?T2 :benefits_overpayments\\#council_tax_id ?T2_council_tax_id .\n      ?T2 :benefits_overpayments\\#council_tax_id ?T2_council_tax_id\n  }\n}\nORDER BY ASC (?T2_council_tax_id)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/cmi_cross_references",
        "url": "http://host.docker.internal:3030/local_govt_mdm__cmi_cross_references/sparql"
      },
      {
        "class": "http://valuenet/ontop/business_rates",
        "url": "http://host.docker.internal:3030/local_govt_mdm__business_rates/sparql"
      },
      {
        "class": "http://valuenet/ontop/council_tax",
        "url": "http://host.docker.internal:3030/local_govt_mdm__council_tax/sparql"
      },
      {
        "class": "http://valuenet/ontop/electoral_register",
        "url": "http://host.docker.internal:3030/local_govt_mdm__electoral_register/sparql"
      },
      {
        "class": "http://valuenet/ontop/benefits_overpayments",
        "url": "http://host.docker.internal:3030/local_govt_mdm__benefits_overpayments/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_master_index",
        "url": "http://host.docker.internal:3030/local_govt_mdm__customer_master_index/sparql"
      },
      {
        "class": "http://valuenet/ontop/rent_arrears",
        "url": "http://host.docker.internal:3030/local_govt_mdm__rent_arrears/sparql"
      },
      {
        "class": "http://valuenet/ontop/parking_fines",
        "url": "http://host.docker.internal:3030/local_govt_mdm__parking_fines/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  }
]