[
  {
    "id": "activity_1_2",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Who is the advisor of Linda Smith? Give me the first name and last name.",
    "original_sparql": "SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\\#ref-facid ?T1 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . ?T14 a :activity . ?T13 :faculty_participates_in\\#ref-actid ?T14 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . ?T15 a :participates_in . ?T15 :participates_in\\#ref-actid ?T14 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . ?T2 a :student . ?T15 :participates_in\\#ref-stuid ?T2 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fname ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname ?T1_lname WHERE {\n      ?T1 a :faculty .\n      ?T1 :faculty\\#fname ?T1_fname .\n      ?T1 :faculty\\#lname ?T1_lname .\n      ?T1 :faculty\\#fname ?T1_fname .\n      ?T1 :faculty\\#lname ?T1_lname .\n      ?T1 :faculty\\#fname ?T1_fname .\n      ?T1 :faculty\\#lname ?T1_lname .\n      ?T1 :faculty\\#fname ?T1_fname .\n      ?T1 :faculty\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__student/sparql> {\n    SELECT DISTINCT ?T2 ?T2_fname ?T2_lname WHERE {\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname .\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname .\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname .\n      ?T2 a :student .\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname\n      FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T14 WHERE {\n      ?T14 a :activity\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T13 a :faculty_participates_in .\n      ?T13 :faculty_participates_in\\#ref-facid ?T1 .\n      ?T13 :faculty_participates_in\\#ref-actid ?T14\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__participates_in/sparql> {\n    ?T15 a :participates_in .\n      ?T15 :participates_in\\#ref-actid ?T14 .\n      ?T15 :participates_in\\#ref-stuid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "activity_1_3",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Show the ids of students whose advisors are professors.",
    "original_sparql": "SELECT ?T1_stuid WHERE { ?T1 a :student . ?T13 a :participates_in . ?T13 :participates_in\\#ref-stuid ?T1 .  ?T1 :student\\#stuid ?T1_stuid . ?T2 :faculty\\#rank ?T2_rank . ?T14 a :activity . ?T13 :participates_in\\#ref-actid ?T14 .  ?T1 :student\\#stuid ?T1_stuid . ?T2 :faculty\\#rank ?T2_rank . ?T15 a :faculty_participates_in . ?T15 :faculty_participates_in\\#ref-actid ?T14 .  ?T1 :student\\#stuid ?T1_stuid . ?T2 :faculty\\#rank ?T2_rank . ?T2 a :faculty . ?T15 :faculty_participates_in\\#ref-facid ?T2 .  ?T1 :student\\#stuid ?T1_stuid . ?T2 :faculty\\#rank ?T2_rank . FILTER(?T2_rank = 'Professor') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_stuid WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_stuid WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#stuid ?T1_stuid .\n      ?T1 :student\\#stuid ?T1_stuid .\n      ?T1 :student\\#stuid ?T1_stuid .\n      ?T1 :student\\#stuid ?T1_stuid\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T2 ?T2_rank WHERE {\n      ?T2 :faculty\\#rank ?T2_rank .\n      ?T2 :faculty\\#rank ?T2_rank .\n      ?T2 :faculty\\#rank ?T2_rank .\n      ?T2 a :faculty .\n      ?T2 :faculty\\#rank ?T2_rank\n      FILTER(?T2_rank = 'Professor')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T14 WHERE {\n      ?T14 a :activity\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__participates_in/sparql> {\n    ?T13 a :participates_in .\n      ?T13 :participates_in\\#ref-stuid ?T1 .\n      ?T13 :participates_in\\#ref-actid ?T14\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T15 a :faculty_participates_in .\n      ?T15 :faculty_participates_in\\#ref-actid ?T14 .\n      ?T15 :faculty_participates_in\\#ref-facid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "activity_1_15",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Show the ids of all the faculty members who participate in an activity and advise a student.",
    "original_sparql": "SELECT DISTINCT ?T1_facid WHERE { ?T1 a :faculty_participates_in . ?T1 :faculty_participates_in\\#facid ?T1_facid . FILTER (?T1_facid in (?T2_advisor)) .   ?T2 a :student . ?T2 :student\\#advisor ?T2_advisor .              }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_facid WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T1 a :faculty_participates_in .\n      ?T1 :faculty_participates_in\\#facid ?T1_facid\n      FILTER (?T1_facid in (?T2_advisor))\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__student/sparql> {\n    ?T2 a :student .\n      ?T2 :student\\#advisor ?T2_advisor\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 7,
      "federated_count": 0,
      "missing": 7,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_18",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Find the number of activities Mark Giuliano is involved in.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty_participates_in . ?T2 a :faculty . ?T1 :faculty_participates_in\\#ref-facid ?T2 .  ?T2 :faculty\\#fname ?T2_fname . ?T2 :faculty\\#lname ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_fname ?T2_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :faculty .\n      ?T2 :faculty\\#fname ?T2_fname .\n      ?T2 :faculty\\#lname ?T2_lname\n      FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T1 a :faculty_participates_in .\n      ?T1 :faculty_participates_in\\#ref-facid ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_19",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Show the names of all the activities Mark Giuliano participates in.",
    "original_sparql": "SELECT ?T1_activity_name WHERE { ?T1 a :activity . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\\#ref-actid ?T1 .  ?T1 :activity\\#activity_name ?T1_activity_name . ?T2 :faculty\\#fname ?T2_fname . ?T2 :faculty\\#lname ?T2_lname . ?T2 a :faculty . ?T13 :faculty_participates_in\\#ref-facid ?T2 .  ?T1 :activity\\#activity_name ?T1_activity_name . ?T2 :faculty\\#fname ?T2_fname . ?T2 :faculty\\#lname ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_activity_name WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T1 ?T1_activity_name WHERE {\n      ?T1 a :activity .\n      ?T1 :activity\\#activity_name ?T1_activity_name .\n      ?T1 :activity\\#activity_name ?T1_activity_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T2 ?T2_fname ?T2_lname WHERE {\n      ?T2 :faculty\\#fname ?T2_fname .\n      ?T2 :faculty\\#lname ?T2_lname .\n      ?T2 a :faculty .\n      ?T2 :faculty\\#fname ?T2_fname .\n      ?T2 :faculty\\#lname ?T2_lname\n      FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T13 a :faculty_participates_in .\n      ?T13 :faculty_participates_in\\#ref-actid ?T1 .\n      ?T13 :faculty_participates_in\\#ref-facid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "activity_1_21",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Show the first and last name of all the faculty members who participated in some activity, together with the number of activities they participated in.",
    "original_sparql": "SELECT ?T1_fname ?T1_lname (count( *) as ?aggregation_all) ?T1_facid WHERE { ?T1 a :faculty . ?T2 a :faculty_participates_in . ?T2 :faculty_participates_in\\#ref-facid ?T1 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname . ?T1 :faculty\\#facid ?T1_facid .        } GROUP BY ?T1_fname ?T1_lname ?T1_facid",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fname ?T1_lname (count( *) as ?aggregation_all) ?T1_facid WHERE {\n  {\n    SELECT ?T1 ?T1_facid ?T1_fname ?T1_lname ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T1 ?T1_facid ?T1_fname ?T1_lname WHERE {\n      ?T1 a :faculty .\n      ?T1 :faculty\\#fname ?T1_fname .\n      ?T1 :faculty\\#lname ?T1_lname .\n      ?T1 :faculty\\#facid ?T1_facid\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T2 a :faculty_participates_in .\n      ?T2 :faculty_participates_in\\#ref-facid ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_fname ?T1_lname ?T1_facid",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 18,
      "federated_count": 18,
      "missing": 18,
      "extra": 18,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_23",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Show all the activity names and the number of faculty involved in each activity.",
    "original_sparql": "SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :activity . ?T2 a :faculty_participates_in . ?T2 :faculty_participates_in\\#ref-actid ?T1 .  ?T1 :activity\\#activity_name ?T1_activity_name .        } GROUP BY ?T1_activity_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_activity_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T1 ?T1_activity_name WHERE {\n      ?T1 a :activity .\n      ?T1 :activity\\#activity_name ?T1_activity_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T2 a :faculty_participates_in .\n      ?T2 :faculty_participates_in\\#ref-actid ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_activity_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 13,
      "federated_count": 13,
      "missing": 13,
      "extra": 13,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_26",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Find the first and last name of the faculty who is involved in the largest number of activities.",
    "original_sparql": "SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :faculty_participates_in . ?T2 :faculty_participates_in\\#ref-facid ?T1 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE {\n  {\n    SELECT ?T1 ?T1_fname ?T1_lname ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname ?T1_lname WHERE {\n      ?T1 a :faculty .\n      ?T1 :faculty\\#fname ?T1_fname .\n      ?T1 :faculty\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T2 a :faculty_participates_in .\n      ?T2 :faculty_participates_in\\#ref-facid ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_29",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Show the ids for all the students who participate in an activity and are under 20.",
    "original_sparql": "SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :participates_in . ?T1 :participates_in\\#stuid ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :student . ?T2 :student\\#stuid ?T2_stuid . ?T2 :student\\#age ?T2_age .  FILTER(?T2_age < 20) .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_stuid WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__participates_in/sparql> {\n    ?T1 a :participates_in .\n      ?T1 :participates_in\\#stuid ?T1_stuid\n      FILTER (?T1_stuid in (?T2_stuid))\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__student/sparql> {\n    ?T2 a :student .\n      ?T2 :student\\#stuid ?T2_stuid .\n      ?T2 :student\\#age ?T2_age\n      FILTER(?T2_age < 20)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 17,
      "federated_count": 0,
      "missing": 17,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_32",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Tell me the first and last name of the student who has the most activities.",
    "original_sparql": "SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :student . ?T2 a :participates_in . ?T2 :participates_in\\#ref-stuid ?T1 .  ?T1 :student\\#fname ?T1_fname . ?T1 :student\\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE {\n  {\n    SELECT ?T1 ?T1_fname ?T1_lname ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname ?T1_lname WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#fname ?T1_fname .\n      ?T1 :student\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__participates_in/sparql> {\n    ?T2 a :participates_in .\n      ?T2 :participates_in\\#ref-stuid ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_34",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Find the name of the activity that has the largest number of student participants.",
    "original_sparql": "SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :activity . ?T2 a :participates_in . ?T2 :participates_in\\#ref-actid ?T1 .  ?T1 :activity\\#activity_name ?T1_activity_name .        } GROUP BY ?T1_activity_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_activity_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T1 ?T1_activity_name WHERE {\n      ?T1 a :activity .\n      ?T1 :activity\\#activity_name ?T1_activity_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__participates_in/sparql> {\n    ?T2 a :participates_in .\n      ?T2 :participates_in\\#ref-actid ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_activity_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "activity_1_35",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Find the first names of the faculty members who are playing Canoeing or Kayaking.",
    "original_sparql": "SELECT DISTINCT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\\#ref-facid ?T1 .  ?T1 :faculty\\#lname ?T1_lname . ?T2 :activity\\#activity_name ?T2_activity_name . ?T2 :activity\\#activity_name ?T2_activity_name . ?T2 a :activity . ?T13 :faculty_participates_in\\#ref-actid ?T2 .  ?T1 :faculty\\#lname ?T1_lname . ?T2 :activity\\#activity_name ?T2_activity_name . ?T2 :activity\\#activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing' || ?T2_activity_name = 'Kayaking') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T1 ?T1_lname WHERE {\n      ?T1 a :faculty .\n      ?T1 :faculty\\#lname ?T1_lname .\n      ?T1 :faculty\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T2 ?T2_activity_name WHERE {\n      ?T2 :activity\\#activity_name ?T2_activity_name .\n      ?T2 :activity\\#activity_name ?T2_activity_name .\n      ?T2 a :activity .\n      ?T2 :activity\\#activity_name ?T2_activity_name .\n      ?T2 :activity\\#activity_name ?T2_activity_name\n      FILTER(?T2_activity_name = 'Canoeing' || ?T2_activity_name = 'Kayaking')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T13 a :faculty_participates_in .\n      ?T13 :faculty_participates_in\\#ref-facid ?T1 .\n      ?T13 :faculty_participates_in\\#ref-actid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  }
]