[
  {
    "id": "soccer_2_1924",
    "kg_name": "soccer_2",
    "split": "train",
    "question": "Find the name of the tryout players who are from the college with largest size.",
    "original_sparql": "SELECT ?T1_pname WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\\#ref-pid ?T1 .  ?T1 :player\\#pname ?T1_pname . ?T2 :tryout\\#cname ?T2_cname . FILTER(?T2_cname = (?T23_enr)) .       {SELECT ?T23_cname WHERE { ?T23 a :college . ?T23 :college\\#cname ?T23_cname . ?T23 :college\\#enr ?T23_enr .        }   ORDER BY DESC (?T23_enr) LIMIT 1 } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_pname WHERE {\n  SERVICE <http://host.docker.internal:3030/soccer_2__player/sparql> {\n    SELECT DISTINCT ?T1 ?T1_pname WHERE {\n      ?T1 a :player .\n      ?T1 :player\\#pname ?T1_pname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/soccer_2__tryout/sparql> {\n    ?T2 a :tryout .\n      ?T2 :tryout\\#ref-pid ?T1 .\n      ?T2 :tryout\\#cname ?T2_cname\n      FILTER(?T2_cname = (?T23_enr))\n  }\n  {\n    SELECT ?T23_cname WHERE {\n      SERVICE <http://host.docker.internal:3030/soccer_2__college/sparql> {\n        ?T23 a :college . ?T23 :college\\#cname ?T23_cname . ?T23 :college\\#enr ?T23_enr . } ORDER BY DESC (?T23_enr) LIMIT 1\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/soccer_2__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/tryout",
        "url": "http://host.docker.internal:3030/soccer_2__tryout/sparql"
      },
      {
        "class": "http://valuenet/ontop/college",
        "url": "http://host.docker.internal:3030/soccer_2__college/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "soccer_2_1926",
    "kg_name": "soccer_2",
    "split": "train",
    "question": "What is the state and enrollment of the colleges where have any students who got accepted in the tryout decision.",
    "original_sparql": "SELECT DISTINCT ?T1_state ?T1_enr WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\\#ref-cname ?T1 .  ?T1 :college\\#state ?T1_state . ?T1 :college\\#enr ?T1_enr . ?T2 :tryout\\#decision ?T2_decision . FILTER(?T2_decision = 'yes') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_state ?T1_enr WHERE {\n  SERVICE <http://host.docker.internal:3030/soccer_2__college/sparql> {\n    SELECT DISTINCT ?T1 ?T1_enr ?T1_state WHERE {\n      ?T1 a :college .\n      ?T1 :college\\#state ?T1_state .\n      ?T1 :college\\#enr ?T1_enr\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/soccer_2__tryout/sparql> {\n    ?T2 a :tryout .\n      ?T2 :tryout\\#ref-cname ?T1 .\n      ?T2 :tryout\\#decision ?T2_decision\n      FILTER(?T2_decision = 'yes')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/soccer_2__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/tryout",
        "url": "http://host.docker.internal:3030/soccer_2__tryout/sparql"
      },
      {
        "class": "http://valuenet/ontop/college",
        "url": "http://host.docker.internal:3030/soccer_2__college/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "soccer_2_1928",
    "kg_name": "soccer_2",
    "split": "train",
    "question": "Find the names of states that have some college students playing in goalie and mid positions.",
    "original_sparql": "SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\\#ref-cname ?T1 .  ?T1 :college\\#state ?T1_state . ?T2 :tryout\\#ppos ?T2_ppos . FILTER(?T2_ppos = 'goalie') . FILTER (?T1_state in (?T3_state)) .   ?T3 a :college . ?T4 a :tryout . ?T4 :tryout\\#ref-cname ?T3 .  ?T3 :college\\#state ?T3_state . ?T4 :tryout\\#ppos ?T4_ppos .  FILTER(?T4_ppos = 'mid') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_state WHERE {\n  SERVICE <http://host.docker.internal:3030/soccer_2__college/sparql> {\n    SELECT DISTINCT ?T1 ?T1_state ?T3 ?T3_state WHERE {\n      ?T1 a :college .\n      ?T1 :college\\#state ?T1_state .\n      ?T3 a :college .\n      ?T3 :college\\#state ?T3_state\n      FILTER (?T1_state in (?T3_state))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/soccer_2__tryout/sparql> {\n    ?T2 a :tryout .\n      ?T2 :tryout\\#ref-cname ?T1 .\n      ?T2 :tryout\\#ppos ?T2_ppos .\n      ?T4 a :tryout .\n      ?T4 :tryout\\#ref-cname ?T3 .\n      ?T4 :tryout\\#ppos ?T4_ppos\n      FILTER(?T2_ppos = 'goalie')\n      FILTER(?T4_ppos = 'mid')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/soccer_2__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/tryout",
        "url": "http://host.docker.internal:3030/soccer_2__tryout/sparql"
      },
      {
        "class": "http://valuenet/ontop/college",
        "url": "http://host.docker.internal:3030/soccer_2__college/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "solvency_ii_1930",
    "kg_name": "solvency_ii",
    "split": "train",
    "question": "Show the names of products and the number of events they are in.",
    "original_sparql": "SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :products_in_events . ?T2 :products_in_events\\#ref-product_id ?T1 .  ?T1 :products\\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_product_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/solvency_ii__products/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_name WHERE {\n      ?T1 a :products .\n      ?T1 :products\\#product_name ?T1_product_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/solvency_ii__products_in_events/sparql> {\n    ?T2 a :products_in_events .\n      ?T2 :products_in_events\\#ref-product_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_product_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/finances",
        "url": "http://host.docker.internal:3030/solvency_ii__finances/sparql"
      },
      {
        "class": "http://valuenet/ontop/products_in_events",
        "url": "http://host.docker.internal:3030/solvency_ii__products_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets_in_events",
        "url": "http://host.docker.internal:3030/solvency_ii__assets_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/solvency_ii__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/events",
        "url": "http://host.docker.internal:3030/solvency_ii__events/sparql"
      },
      {
        "class": "http://valuenet/ontop/agreements",
        "url": "http://host.docker.internal:3030/solvency_ii__agreements/sparql"
      },
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/solvency_ii__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/parties_in_events",
        "url": "http://host.docker.internal:3030/solvency_ii__parties_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/solvency_ii__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/channels",
        "url": "http://host.docker.internal:3030/solvency_ii__channels/sparql"
      },
      {
        "class": "http://valuenet/ontop/parties",
        "url": "http://host.docker.internal:3030/solvency_ii__parties/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/solvency_ii__assets/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "solvency_ii_1933",
    "kg_name": "solvency_ii",
    "split": "train",
    "question": "Show the names of products that are in at least two events in ascending alphabetical order of product name.",
    "original_sparql": "SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :products_in_events . ?T2 :products_in_events\\#ref-product_id ?T1 .  ?T1 :products\\#product_name ?T1_product_name . ?T1 :products\\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name ORDER BY ASC (?T1_product_name)  HAVING(count( *)  >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_name WHERE {\n  {\n    SELECT ?T1 ?T1_product_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/solvency_ii__products/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_name WHERE {\n      ?T1 a :products .\n      ?T1 :products\\#product_name ?T1_product_name .\n      ?T1 :products\\#product_name ?T1_product_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/solvency_ii__products_in_events/sparql> {\n    ?T2 a :products_in_events .\n      ?T2 :products_in_events\\#ref-product_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_product_name ORDER BY ASC (?T1_product_name)  HAVING(count( *)  >= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/finances",
        "url": "http://host.docker.internal:3030/solvency_ii__finances/sparql"
      },
      {
        "class": "http://valuenet/ontop/products_in_events",
        "url": "http://host.docker.internal:3030/solvency_ii__products_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets_in_events",
        "url": "http://host.docker.internal:3030/solvency_ii__assets_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/solvency_ii__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/events",
        "url": "http://host.docker.internal:3030/solvency_ii__events/sparql"
      },
      {
        "class": "http://valuenet/ontop/agreements",
        "url": "http://host.docker.internal:3030/solvency_ii__agreements/sparql"
      },
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/solvency_ii__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/parties_in_events",
        "url": "http://host.docker.internal:3030/solvency_ii__parties_in_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/solvency_ii__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/channels",
        "url": "http://host.docker.internal:3030/solvency_ii__channels/sparql"
      },
      {
        "class": "http://valuenet/ontop/parties",
        "url": "http://host.docker.internal:3030/solvency_ii__parties/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/solvency_ii__assets/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "sports_competition_1934",
    "kg_name": "sports_competition",
    "split": "train",
    "question": "Please show the names and the players of clubs.",
    "original_sparql": "SELECT ?T1_name ?T2_player_id WHERE { ?T1 a :club . ?T2 a :player . ?T2 :player\\#ref-club_id ?T1 .  ?T1 :club\\#name ?T1_name . ?T2 :player\\#player_id ?T2_player_id .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_player_id WHERE {\n  SERVICE <http://host.docker.internal:3030/sports_competition__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sports_competition__player/sparql> {\n    ?T2 a :player .\n      ?T2 :player\\#ref-club_id ?T1 .\n      ?T2 :player\\#player_id ?T2_player_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/sports_competition__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/competition_result",
        "url": "http://host.docker.internal:3030/sports_competition__competition_result/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/sports_competition__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/competition",
        "url": "http://host.docker.internal:3030/sports_competition__competition/sparql"
      },
      {
        "class": "http://valuenet/ontop/club_rank",
        "url": "http://host.docker.internal:3030/sports_competition__club_rank/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sports_competition_1936",
    "kg_name": "sports_competition",
    "split": "train",
    "question": "Show the names of clubs that have players with position 'Right Wing'.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :club . ?T2 a :player . ?T2 :player\\#ref-club_id ?T1 .  ?T1 :club\\#name ?T1_name . ?T2 :player\\#position ?T2_position . FILTER(?T2_position = 'Right Wing') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/sports_competition__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sports_competition__player/sparql> {\n    ?T2 a :player .\n      ?T2 :player\\#ref-club_id ?T1 .\n      ?T2 :player\\#position ?T2_position\n      FILTER(?T2_position = 'Right Wing')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/sports_competition__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/competition_result",
        "url": "http://host.docker.internal:3030/sports_competition__competition_result/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/sports_competition__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/competition",
        "url": "http://host.docker.internal:3030/sports_competition__competition/sparql"
      },
      {
        "class": "http://valuenet/ontop/club_rank",
        "url": "http://host.docker.internal:3030/sports_competition__club_rank/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sports_competition_1938",
    "kg_name": "sports_competition",
    "split": "train",
    "question": "What is the average points of players from club with name 'AIB'.",
    "original_sparql": "SELECT (avg( ?T1_points) as ?aggregation_T1_points_187 ) WHERE { ?T1 a :player . ?T2 a :club . ?T1 :player\\#ref-club_id ?T2 .  ?T1 :player\\#points ?T1_points . ?T2 :club\\#name ?T2_name . FILTER(?T2_name = 'AIB') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_points) as ?aggregation_T1_points_187 ) WHERE {\n  {\n    SELECT ?T1 ?T1_points ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/sports_competition__club/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :club .\n      ?T2 :club\\#name ?T2_name\n      FILTER(?T2_name = 'AIB')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sports_competition__player/sparql> {\n    ?T1 a :player .\n      ?T1 :player\\#ref-club_id ?T2 .\n      ?T1 :player\\#points ?T1_points\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/sports_competition__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/competition_result",
        "url": "http://host.docker.internal:3030/sports_competition__competition_result/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/sports_competition__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/competition",
        "url": "http://host.docker.internal:3030/sports_competition__competition/sparql"
      },
      {
        "class": "http://valuenet/ontop/club_rank",
        "url": "http://host.docker.internal:3030/sports_competition__club_rank/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "station_weather_1940",
    "kg_name": "station_weather",
    "split": "train",
    "question": "Find the name of the train whose route runs through greatest number of stations.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :train . ?T2 a :route . ?T2 :route\\#ref-train_id ?T1 .  ?T1 :train\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/station_weather__route/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :route\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/station_weather__train/sparql> {\n    ?T1 a :train .\n      ?T2 :route\\#ref-train_id ?T1 .\n      ?T1 :train\\#name ?T1_name\n  }\n    }\n  }\n}\nGROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/route",
        "url": "http://host.docker.internal:3030/station_weather__route/sparql"
      },
      {
        "class": "http://valuenet/ontop/weekly_weather",
        "url": "http://host.docker.internal:3030/station_weather__weekly_weather/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/station_weather__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/station",
        "url": "http://host.docker.internal:3030/station_weather__station/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "station_weather_1941",
    "kg_name": "station_weather",
    "split": "train",
    "question": "Find the number of trains for each station, as well as the station network name and services.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_network_name ?T2_services WHERE { ?T1 a :route . ?T2 a :station . ?T1 :route\\#ref-station_id ?T2 .  ?T2 :station\\#network_name ?T2_network_name . ?T2 :station\\#services ?T2_services .        } GROUP BY ?T2_network_name ?T2_services",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_network_name ?T2_services WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_network_name ?T2_services WHERE {\n  SERVICE <http://host.docker.internal:3030/station_weather__route/sparql> {\n    SELECT DISTINCT ?T1 WHERE {\n      ?T1 a :route\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/station_weather__station/sparql> {\n    ?T2 a :station .\n      ?T1 :route\\#ref-station_id ?T2 .\n      ?T2 :station\\#network_name ?T2_network_name .\n      ?T2 :station\\#services ?T2_services\n  }\n    }\n  }\n}\nGROUP BY ?T2_network_name ?T2_services",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/route",
        "url": "http://host.docker.internal:3030/station_weather__route/sparql"
      },
      {
        "class": "http://valuenet/ontop/weekly_weather",
        "url": "http://host.docker.internal:3030/station_weather__weekly_weather/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/station_weather__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/station",
        "url": "http://host.docker.internal:3030/station_weather__station/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 9,
      "federated_count": 0,
      "missing": 9,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "station_weather_1942",
    "kg_name": "station_weather",
    "split": "train",
    "question": "Give me the maximum low temperature and average precipitation at the Amersham station.",
    "original_sparql": "SELECT (max( ?T1_low_temperature) as ?aggregation_T1_low_temperature_78 ) (avg( ?T1_precipitation) as ?aggregation_T1_precipitation_86 ) WHERE { ?T1 a :weekly_weather . ?T2 a :station . ?T1 :weekly_weather\\#ref-station_id ?T2 .  ?T1 :weekly_weather\\#low_temperature ?T1_low_temperature . ?T1 :weekly_weather\\#precipitation ?T1_precipitation . ?T2 :station\\#network_name ?T2_network_name . FILTER(?T2_network_name = 'Amersham') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (max( ?T1_low_temperature) as ?aggregation_T1_low_temperature_78 ) (avg( ?T1_precipitation) as ?aggregation_T1_precipitation_86 ) WHERE {\n  {\n    SELECT ?T1 ?T1_low_temperature ?T1_precipitation ?T2 ?T2_network_name WHERE {\n  SERVICE <http://host.docker.internal:3030/station_weather__station/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :station .\n      ?T2 :station\\#network_name ?T2_network_name\n      FILTER(?T2_network_name = 'Amersham')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/station_weather__weekly_weather/sparql> {\n    ?T1 a :weekly_weather .\n      ?T1 :weekly_weather\\#ref-station_id ?T2 .\n      ?T1 :weekly_weather\\#low_temperature ?T1_low_temperature .\n      ?T1 :weekly_weather\\#precipitation ?T1_precipitation\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/route",
        "url": "http://host.docker.internal:3030/station_weather__route/sparql"
      },
      {
        "class": "http://valuenet/ontop/weekly_weather",
        "url": "http://host.docker.internal:3030/station_weather__weekly_weather/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/station_weather__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/station",
        "url": "http://host.docker.internal:3030/station_weather__station/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "station_weather_1943",
    "kg_name": "station_weather",
    "split": "train",
    "question": "Find names and times of trains that run through stations for the local authority Chiltern.",
    "original_sparql": "SELECT ?T1_name ?T1_time WHERE { ?T1 a :train . ?T13 a :route . ?T13 :route\\#ref-train_id ?T1 .  ?T1 :train\\#name ?T1_name . ?T1 :train\\#time ?T1_time . ?T2 :station\\#local_authority ?T2_local_authority . ?T2 a :station . ?T13 :route\\#ref-station_id ?T2 .  ?T1 :train\\#name ?T1_name . ?T1 :train\\#time ?T1_time . ?T2 :station\\#local_authority ?T2_local_authority . FILTER(?T2_local_authority = 'Chiltern') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_time WHERE {\n  SERVICE <http://host.docker.internal:3030/station_weather__route/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :route\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/station_weather__train/sparql> {\n    ?T1 a :train .\n      ?T13 :route\\#ref-train_id ?T1 .\n      ?T1 :train\\#name ?T1_name .\n      ?T1 :train\\#time ?T1_time .\n      ?T1 :train\\#name ?T1_name .\n      ?T1 :train\\#time ?T1_time\n  }\n  SERVICE <http://host.docker.internal:3030/station_weather__station/sparql> {\n    ?T2 :station\\#local_authority ?T2_local_authority .\n      ?T2 a :station .\n      ?T13 :route\\#ref-station_id ?T2 .\n      ?T2 :station\\#local_authority ?T2_local_authority\n      FILTER(?T2_local_authority = 'Chiltern')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/route",
        "url": "http://host.docker.internal:3030/station_weather__route/sparql"
      },
      {
        "class": "http://valuenet/ontop/weekly_weather",
        "url": "http://host.docker.internal:3030/station_weather__weekly_weather/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/station_weather__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/station",
        "url": "http://host.docker.internal:3030/station_weather__station/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 6,
      "federated_count": 0,
      "missing": 6,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "station_weather_1944",
    "kg_name": "station_weather",
    "split": "train",
    "question": "Find the id and local authority of the station with has the highest average high temperature.",
    "original_sparql": "SELECT ?T1_id ?T1_local_authority WHERE { ?T1 a :station . ?T2 a :weekly_weather . ?T2 :weekly_weather\\#ref-station_id ?T1 .  ?T1 :station\\#id ?T1_id . ?T1 :station\\#local_authority ?T1_local_authority . ?T2 :weekly_weather\\#high_temperature ?T2_high_temperature .        } GROUP BY ?T1_id ?T1_local_authority  ORDER BY DESC ((avg( ?T2_high_temperature) as ?aggregation_T2_high_temperature_87 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_id ?T1_local_authority WHERE {\n  {\n    SELECT ?T1 ?T1_id ?T1_local_authority ?T2 ?T2_high_temperature WHERE {\n  SERVICE <http://host.docker.internal:3030/station_weather__station/sparql> {\n    SELECT DISTINCT ?T1 ?T1_id ?T1_local_authority WHERE {\n      ?T1 a :station .\n      ?T1 :station\\#id ?T1_id .\n      ?T1 :station\\#local_authority ?T1_local_authority\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/station_weather__weekly_weather/sparql> {\n    ?T2 a :weekly_weather .\n      ?T2 :weekly_weather\\#ref-station_id ?T1 .\n      ?T2 :weekly_weather\\#high_temperature ?T2_high_temperature\n  }\n    }\n  }\n}\nGROUP BY ?T1_id ?T1_local_authority  ORDER BY DESC ((avg( ?T2_high_temperature) as ?aggregation_T2_high_temperature_87 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/route",
        "url": "http://host.docker.internal:3030/station_weather__route/sparql"
      },
      {
        "class": "http://valuenet/ontop/weekly_weather",
        "url": "http://host.docker.internal:3030/station_weather__weekly_weather/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/station_weather__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/station",
        "url": "http://host.docker.internal:3030/station_weather__station/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "store_product_1946",
    "kg_name": "store_product",
    "split": "train",
    "question": "Find the names of all stores in Khanewal District.",
    "original_sparql": "SELECT ?T1_store_name WHERE { ?T1 a :store . ?T13 a :store_district . ?T13 :store_district\\#ref-store_id ?T1 .  ?T1 :store\\#store_name ?T1_store_name . ?T2 :district\\#district_name ?T2_district_name . ?T2 a :district . ?T13 :store_district\\#ref-district_id ?T2 .  ?T1 :store\\#store_name ?T1_store_name . ?T2 :district\\#district_name ?T2_district_name . FILTER(?T2_district_name = 'Khanewal District') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_store_name WHERE {\n  SERVICE <http://host.docker.internal:3030/store_product__store/sparql> {\n    SELECT DISTINCT ?T1 ?T1_store_name WHERE {\n      ?T1 a :store .\n      ?T1 :store\\#store_name ?T1_store_name .\n      ?T1 :store\\#store_name ?T1_store_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/store_product__district/sparql> {\n    SELECT DISTINCT ?T2 ?T2_district_name WHERE {\n      ?T2 :district\\#district_name ?T2_district_name .\n      ?T2 a :district .\n      ?T2 :district\\#district_name ?T2_district_name\n      FILTER(?T2_district_name = 'Khanewal District')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/store_product__store_district/sparql> {\n    ?T13 a :store_district .\n      ?T13 :store_district\\#ref-store_id ?T1 .\n      ?T13 :store_district\\#ref-district_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/product",
        "url": "http://host.docker.internal:3030/store_product__product/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_product",
        "url": "http://host.docker.internal:3030/store_product__store_product/sparql"
      },
      {
        "class": "http://valuenet/ontop/district",
        "url": "http://host.docker.internal:3030/store_product__district/sparql"
      },
      {
        "class": "http://valuenet/ontop/store",
        "url": "http://host.docker.internal:3030/store_product__store/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_district",
        "url": "http://host.docker.internal:3030/store_product__store_district/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  }
]