[
  {
    "id": "products_gen_characteristics_1677",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "List all the product names with the color description 'white'.",
    "original_sparql": "SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\\#ref-color_code ?T2 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :ref_colors\\#color_description ?T2_color_description . FILTER(?T2_color_description = 'white') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_color_description WHERE {\n      ?T2 a :ref_colors .\n      ?T2 :ref_colors\\#color_description ?T2_color_description\n      FILTER(?T2_color_description = 'white')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    ?T1 a :products .\n      ?T1 :products\\#ref-color_code ?T2 .\n      ?T1 :products\\#product_name ?T1_product_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1682",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Count the number of characteristics the product 'sesame' has.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :product_characteristics . ?T2 a :products . ?T1 :product_characteristics\\#ref-product_id ?T2 .  ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'sesame')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T1 a :product_characteristics .\n      ?T1 :product_characteristics\\#ref-product_id ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "products_gen_characteristics_1684",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Count the number of different characteristic names the product 'cumin' has.",
    "original_sparql": "SELECT DISTINCT (count(DISTINCT ?T1_characteristic_name) as ?aggregation_T1_characteristic_name_61 ) WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\\#ref-product_id ?T2 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT (count(DISTINCT ?T1_characteristic_name) as ?aggregation_T1_characteristic_name_61 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_characteristic_name ?T2 ?T2_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql> {\n    SELECT DISTINCT ?T1 ?T1_characteristic_name WHERE {\n      ?T1 a :characteristics .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'sesame')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T13 a :product_characteristics .\n      ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .\n      ?T13 :product_characteristics\\#ref-product_id ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1686",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Return the characteristic names of the 'sesame' product.",
    "original_sparql": "SELECT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\\#ref-product_id ?T2 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_characteristic_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql> {\n    SELECT DISTINCT ?T1 ?T1_characteristic_name WHERE {\n      ?T1 a :characteristics .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_name WHERE {\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'sesame')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T13 a :product_characteristics .\n      ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .\n      ?T13 :product_characteristics\\#ref-product_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1687",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "List all the characteristic names and data types of product 'cumin'.",
    "original_sparql": "SELECT ?T1_characteristic_name ?T1_characteristic_data_type WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T1 :characteristics\\#characteristic_data_type ?T1_characteristic_data_type . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\\#ref-product_id ?T2 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T1 :characteristics\\#characteristic_data_type ?T1_characteristic_data_type . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'cumin') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_characteristic_name ?T1_characteristic_data_type WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql> {\n    SELECT DISTINCT ?T1 ?T1_characteristic_data_type ?T1_characteristic_name WHERE {\n      ?T1 a :characteristics .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name .\n      ?T1 :characteristics\\#characteristic_data_type ?T1_characteristic_data_type .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name .\n      ?T1 :characteristics\\#characteristic_data_type ?T1_characteristic_data_type\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_name WHERE {\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'cumin')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T13 a :product_characteristics .\n      ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .\n      ?T13 :product_characteristics\\#ref-product_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1689",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "List all characteristics of product named 'sesame' with type code 'Grade'.",
    "original_sparql": "SELECT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . ?T1 :characteristics\\#characteristic_type_code ?T1_characteristic_type_code . ?T2 a :products . ?T13 :product_characteristics\\#ref-product_id ?T2 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . ?T1 :characteristics\\#characteristic_type_code ?T1_characteristic_type_code . FILTER(?T2_product_name = 'sesame' && ?T1_characteristic_type_code = 'Grade') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_characteristic_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql> {\n    SELECT DISTINCT ?T1 ?T1_characteristic_name ?T1_characteristic_type_code ?T2_product_name WHERE {\n      ?T1 a :characteristics .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name .\n      ?T1 :characteristics\\#characteristic_type_code ?T1_characteristic_type_code .\n      ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name .\n      ?T1 :characteristics\\#characteristic_type_code ?T1_characteristic_type_code\n      FILTER(?T2_product_name = 'sesame' && ?T1_characteristic_type_code = 'Grade')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_name WHERE {\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T13 a :product_characteristics .\n      ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .\n      ?T13 :product_characteristics\\#ref-product_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 0,
      "missing": 2,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "products_gen_characteristics_1691",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Find the name of the products that have the color description 'red' and have the characteristic name 'fast'.",
    "original_sparql": "SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\\#ref-color_code ?T2 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :ref_colors\\#color_description ?T2_color_description . ?T3 :characteristics\\#characteristic_name ?T3_characteristic_name . ?T14 a :product_characteristics . ?T14 :product_characteristics\\#ref-product_id ?T1 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :ref_colors\\#color_description ?T2_color_description . ?T3 :characteristics\\#characteristic_name ?T3_characteristic_name . ?T3 a :characteristics . ?T14 :product_characteristics\\#ref-characteristic_id ?T3 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :ref_colors\\#color_description ?T2_color_description . ?T3 :characteristics\\#characteristic_name ?T3_characteristic_name . FILTER(?T2_color_description = 'red' && ?T3_characteristic_name = 'fast') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_name ?T2 WHERE {\n      ?T1 a :products .\n      ?T1 :products\\#ref-color_code ?T2 .\n      ?T1 :products\\#product_name ?T1_product_name .\n      ?T1 :products\\#product_name ?T1_product_name .\n      ?T1 :products\\#product_name ?T1_product_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_color_description ?T3_characteristic_name WHERE {\n      ?T2 a :ref_colors .\n      ?T2 :ref_colors\\#color_description ?T2_color_description .\n      ?T2 :ref_colors\\#color_description ?T2_color_description .\n      ?T2 :ref_colors\\#color_description ?T2_color_description\n      FILTER(?T2_color_description = 'red' && ?T3_characteristic_name = 'fast')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql> {\n    SELECT DISTINCT ?T3 ?T3_characteristic_name WHERE {\n      ?T3 :characteristics\\#characteristic_name ?T3_characteristic_name .\n      ?T3 :characteristics\\#characteristic_name ?T3_characteristic_name .\n      ?T3 a :characteristics .\n      ?T3 :characteristics\\#characteristic_name ?T3_characteristic_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T14 a :product_characteristics .\n      ?T14 :product_characteristics\\#ref-product_id ?T1 .\n      ?T14 :product_characteristics\\#ref-characteristic_id ?T3\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 0,
      "missing": 2,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "products_gen_characteristics_1694",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Count the number of products with the 'hot' charactersitic.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :product_characteristics . ?T2 a :characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T2 .  ?T2 :characteristics\\#characteristic_name ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'hot') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T13 ?T2 ?T2_characteristic_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :characteristics .\n      ?T2 :characteristics\\#characteristic_name ?T2_characteristic_name\n      FILTER(?T2_characteristic_name = 'hot')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T13 a :product_characteristics .\n      ?T13 :product_characteristics\\#ref-characteristic_id ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "products_gen_characteristics_1695",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "List the all the distinct names of the products with the characteristic name 'warm'.",
    "original_sparql": "SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T13 a :product_characteristics . ?T13 :product_characteristics\\#ref-product_id ?T1 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :characteristics\\#characteristic_name ?T2_characteristic_name . ?T2 a :characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T2 .  ?T1 :products\\#product_name ?T1_product_name . ?T2 :characteristics\\#characteristic_name ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'warm') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    SELECT DISTINCT ?T1 ?T1_product_name WHERE {\n      ?T1 a :products .\n      ?T1 :products\\#product_name ?T1_product_name .\n      ?T1 :products\\#product_name ?T1_product_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql> {\n    SELECT DISTINCT ?T2 ?T2_characteristic_name WHERE {\n      ?T2 :characteristics\\#characteristic_name ?T2_characteristic_name .\n      ?T2 a :characteristics .\n      ?T2 :characteristics\\#characteristic_name ?T2_characteristic_name\n      FILTER(?T2_characteristic_name = 'warm')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql> {\n    ?T13 a :product_characteristics .\n      ?T13 :product_characteristics\\#ref-product_id ?T1 .\n      ?T13 :product_characteristics\\#ref-characteristic_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "products_gen_characteristics_1702",
    "kg_name": "products_gen_characteristics",
    "split": "train",
    "question": "Give the unit of measure for the product with the name 'cumin'.",
    "original_sparql": "SELECT ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :products\\#ref-product_category_code ?T1 .  ?T1 :ref_product_categories\\#unit_of_measure ?T1_unit_of_measure . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'cumin') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_unit_of_measure WHERE {\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql> {\n    SELECT DISTINCT ?T1 ?T1_unit_of_measure WHERE {\n      ?T1 a :ref_product_categories .\n      ?T1 :ref_product_categories\\#unit_of_measure ?T1_unit_of_measure\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/products_gen_characteristics__products/sparql> {\n    ?T2 a :products .\n      ?T2 :products\\#ref-product_category_code ?T1 .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'cumin')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/product_characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__product_characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/characteristics",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__characteristics/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_colors",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_colors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_characteristic_types",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_characteristic_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_product_categories",
        "url": "http://host.docker.internal:3030/products_gen_characteristics__ref_product_categories/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]