[
  {
    "id": "small_bank_1_1852",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the total savings balance of all accounts except the account with name ‘Brown’.",
    "original_sparql": "SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_80 ) WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :savings\\#ref-custid ?T2 .  ?T1 :savings\\#balance ?T1_balance . ?T2 :accounts\\#name ?T2_name . FILTER(?T2_name != 'Brown') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_balance) as ?aggregation_T1_balance_80 ) WHERE {\n  {\n    SELECT ?T1 ?T1_balance ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :accounts .\n      ?T2 :accounts\\#name ?T2_name\n      FILTER(?T2_name != 'Brown')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T1 a :savings .\n      ?T1 :savings\\#ref-custid ?T2 .\n      ?T1 :savings\\#balance ?T1_balance\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1854",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the name and id of accounts whose checking balance is below the maximum checking balance.",
    "original_sparql": "SELECT ?T1_custid ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\\#ref-custid ?T1 .  ?T1 :accounts\\#custid ?T1_custid . ?T1 :accounts\\#name ?T1_name . ?T2 :checking\\#balance ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_58)) .       {SELECT (max( ?T23_balance) as ?aggregation_T23_balance_58 ) WHERE { ?T23 a :checking . ?T23 :checking\\#balance ?T23_balance .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_custid ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_custid ?T1_name WHERE {\n      ?T1 a :accounts .\n      ?T1 :accounts\\#custid ?T1_custid .\n      ?T1 :accounts\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T2 a :checking .\n      ?T2 :checking\\#ref-custid ?T1 .\n      ?T2 :checking\\#balance ?T2_balance\n      FILTER(?T2_balance < (?aggregation_T23_balance_58))\n  }\n  {\n    SELECT (max( ?T23_balance) as ?aggregation_T23_balance_58 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n        ?T23 a :checking . ?T23 :checking\\#balance ?T23_balance . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "small_bank_1_1857",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the balance of the checking account belonging to an owner whose name contains 'ee'.",
    "original_sparql": "SELECT ?T1_balance WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :checking\\#ref-custid ?T2 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :accounts\\#name ?T2_name . FILTER(contains (?T2_name, 'ee')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_balance WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :accounts .\n      ?T2 :accounts\\#name ?T2_name\n      FILTER(contains (?T2_name, 'ee'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T1 a :checking .\n      ?T1 :checking\\#ref-custid ?T2 .\n      ?T1 :checking\\#balance ?T1_balance\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1858",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the checking balance and saving balance in the Brown’s account.",
    "original_sparql": "SELECT ?T1_balance ?T2_balance WHERE { ?T1 a :checking . ?T3 a :accounts . ?T1 :checking\\#ref-custid ?T3 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :savings\\#balance ?T2_balance . ?T3 :accounts\\#name ?T3_name . ?T2 a :savings . ?T2 :savings\\#ref-custid ?T3 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :savings\\#balance ?T2_balance . ?T3 :accounts\\#name ?T3_name . FILTER(?T3_name = 'Brown') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_balance ?T2_balance WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T3 ?T3_name WHERE {\n      ?T3 a :accounts .\n      ?T3 :accounts\\#name ?T3_name .\n      ?T3 :accounts\\#name ?T3_name\n      FILTER(?T3_name = 'Brown')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T1 a :checking .\n      ?T1 :checking\\#ref-custid ?T3 .\n      ?T1 :checking\\#balance ?T1_balance .\n      ?T1 :checking\\#balance ?T1_balance\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T2 :savings\\#balance ?T2_balance .\n      ?T2 a :savings .\n      ?T2 :savings\\#ref-custid ?T3 .\n      ?T2 :savings\\#balance ?T2_balance\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1860",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the names of accounts whose checking balance is above the average checking balance, but savings balance is below the average savings balance.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :savings . ?T2 :savings\\#ref-custid ?T1 .  ?T1 :accounts\\#name ?T1_name . ?T2 :savings\\#balance ?T2_balance . FILTER(?T2_balance > (?aggregation_T23_balance_32)) . FILTER (?T1_name in (?T4_name)) .   ?T3 a :accounts . ?T4 a :savings . ?T4 :savings\\#ref-custid ?T3 .  ?T3 :accounts\\#name ?T3_name . ?T4 :savings\\#balance ?T4_balance .  FILTER(?T4_balance < (?aggregation_T25_balance_92)) .            { ?T23 a :checking . ?T23 :checking\\#balance ?T23_balance .        } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T3 ?T3_name ?T4_name WHERE {\n      ?T1 a :accounts .\n      ?T1 :accounts\\#name ?T1_name .\n      ?T3 a :accounts .\n      ?T3 :accounts\\#name ?T3_name\n      FILTER (?T1_name in (?T4_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T2 a :savings .\n      ?T2 :savings\\#ref-custid ?T1 .\n      ?T2 :savings\\#balance ?T2_balance .\n      ?T4 a :savings .\n      ?T4 :savings\\#ref-custid ?T3 .\n      ?T4 :savings\\#balance ?T4_balance\n      FILTER(?T2_balance > (?aggregation_T23_balance_32))\n      FILTER(?T4_balance < (?aggregation_T25_balance_92))\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    { ?T23 a :checking . ?T23 :checking\\#balance ?T23_balance .        }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1862",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the checking balance of the accounts whose savings balance is higher than the average savings balance.",
    "original_sparql": "SELECT ?T1_balance WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :savings\\#ref-custid ?T2 .  ?T1 :savings\\#balance ?T1_balance . ?T2 :accounts\\#name ?T2_name . FILTER(?T2_name in (?aggregation_T45_balance_110)) .       {SELECT ?T23_name WHERE { ?T23 a :accounts . ?T24 a :savings . ?T24 :savings\\#ref-custid ?T23 .  ?T23 :accounts\\#name ?T23_name . ?T24 :savings\\#balance ?T24_balance . FILTER(?T24_balance > (?aggregation_T45_balance_110)) .       {SELECT (avg( ?T45_balance) as ?aggregation_T45_balance_110 ) WHERE { ?T45 a :savings . ?T45 :savings\\#balance ?T45_balance .        }    } }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_balance WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name ?aggregation_T45_balance_110 WHERE {\n      ?T2 a :accounts .\n      ?T2 :accounts\\#name ?T2_name\n      FILTER(?T2_name in (?aggregation_T45_balance_110))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T1 a :savings .\n      ?T1 :savings\\#ref-custid ?T2 .\n      ?T1 :savings\\#balance ?T1_balance\n  }\n  {\n    SELECT ?T23_name WHERE {\n      SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n        ?T23 a :accounts . ?T24 a :savings . ?T24 :savings\\#ref-custid ?T23 . ?T23 :accounts\\#name ?T23_name . ?T24 :savings\\#balance ?T24_balance . FILTER(?T24_balance > (?aggregation_T45_balance_110)) . {SELECT (avg( ?T45_balance) as ?aggregation_T45_balance_110 ) WHERE { ?T45 a :savings . ?T45 :savings\\#balance ?T45_balance . } } }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "small_bank_1_1864",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the name of account that has the lowest total checking and saving balance.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\\#ref-custid ?T1 .  ?T1 :accounts\\#name ?T1_name . ?T2 :checking\\#balance ?T2_balance . ?T3 :savings\\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\\#ref-custid ?T1 .  ?T1 :accounts\\#name ?T1_name . ?T2 :checking\\#balance ?T2_balance . ?T3 :savings\\#balance ?T3_balance .        }   ORDER BY ASC (?T2_balance + ?T3_balance) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :accounts .\n      ?T1 :accounts\\#name ?T1_name .\n      ?T1 :accounts\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T2 a :checking .\n      ?T2 :checking\\#ref-custid ?T1 .\n      ?T2 :checking\\#balance ?T2_balance .\n      ?T2 :checking\\#balance ?T2_balance\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T3 :savings\\#balance ?T3_balance .\n      ?T3 a :savings .\n      ?T3 :savings\\#ref-custid ?T1 .\n      ?T3 :savings\\#balance ?T3_balance\n  }\n}\nORDER BY ASC (?T2_balance + ?T3_balance) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1866",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the names and total checking and savings balances of accounts whose savings balance is higher than the average savings balance.",
    "original_sparql": "SELECT ?T1_name ?T2_balance + ?T3_balance WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\\#ref-custid ?T1 .  ?T1 :accounts\\#name ?T1_name . ?T2 :checking\\#balance ?T2_balance . ?T3 :savings\\#balance ?T3_balance . ?T3 :savings\\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\\#ref-custid ?T1 .  ?T1 :accounts\\#name ?T1_name . ?T2 :checking\\#balance ?T2_balance . ?T3 :savings\\#balance ?T3_balance . ?T3 :savings\\#balance ?T3_balance . FILTER(?T3_balance > (?aggregation_T24_balance_44)) .       {SELECT (avg( ?T24_balance) as ?aggregation_T24_balance_44 ) WHERE { ?T24 a :savings . ?T24 :savings\\#balance ?T24_balance .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_balance + ?T3_balance WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :accounts .\n      ?T1 :accounts\\#name ?T1_name .\n      ?T1 :accounts\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T2 a :checking .\n      ?T2 :checking\\#ref-custid ?T1 .\n      ?T2 :checking\\#balance ?T2_balance .\n      ?T2 :checking\\#balance ?T2_balance\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T3 :savings\\#balance ?T3_balance .\n      ?T3 :savings\\#balance ?T3_balance .\n      ?T3 a :savings .\n      ?T3 :savings\\#ref-custid ?T1 .\n      ?T3 :savings\\#balance ?T3_balance .\n      ?T3 :savings\\#balance ?T3_balance\n      FILTER(?T3_balance > (?aggregation_T24_balance_44))\n  }\n  {\n    SELECT (avg( ?T24_balance) as ?aggregation_T24_balance_44 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n        ?T24 a :savings . ?T24 :savings\\#balance ?T24_balance . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "small_bank_1_1870",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the number of checking accounts for each account name.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :checking\\#ref-custid ?T2 .  ?T2 :accounts\\#name ?T2_name .        } GROUP BY ?T2_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_name WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :accounts .\n      ?T2 :accounts\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T1 a :checking .\n      ?T1 :checking\\#ref-custid ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1872",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the total saving balance for each account name.",
    "original_sparql": "SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_167 ) ?T2_name WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :savings\\#ref-custid ?T2 .  ?T1 :savings\\#balance ?T1_balance . ?T2 :accounts\\#name ?T2_name .        } GROUP BY ?T2_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_balance) as ?aggregation_T1_balance_167 ) ?T2_name WHERE {\n  {\n    SELECT ?T1 ?T1_balance ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :accounts .\n      ?T2 :accounts\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T1 a :savings .\n      ?T1 :savings\\#ref-custid ?T2 .\n      ?T1 :savings\\#balance ?T1_balance\n  }\n    }\n  }\n}\nGROUP BY ?T2_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1874",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the name of accounts whose checking balance is below the average checking balance.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\\#ref-custid ?T1 .  ?T1 :accounts\\#name ?T1_name . ?T2 :checking\\#balance ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_73)) .       {SELECT (avg( ?T23_balance) as ?aggregation_T23_balance_73 ) WHERE { ?T23 a :checking . ?T23 :checking\\#balance ?T23_balance .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :accounts .\n      ?T1 :accounts\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T2 a :checking .\n      ?T2 :checking\\#ref-custid ?T1 .\n      ?T2 :checking\\#balance ?T2_balance\n      FILTER(?T2_balance < (?aggregation_T23_balance_73))\n  }\n  {\n    SELECT (avg( ?T23_balance) as ?aggregation_T23_balance_73 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n        ?T23 a :checking . ?T23 :checking\\#balance ?T23_balance . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "small_bank_1_1876",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the saving balance of the account with the highest checking balance.",
    "original_sparql": "SELECT ?T1_balance WHERE { ?T1 a :savings . ?T13 a :accounts . ?T1 :savings\\#ref-custid ?T13 .  ?T1 :savings\\#balance ?T1_balance . ?T2 :checking\\#balance ?T2_balance . ?T2 a :checking . ?T2 :checking\\#ref-custid ?T13 .  ?T1 :savings\\#balance ?T1_balance . ?T2 :checking\\#balance ?T2_balance .        }   ORDER BY DESC (?T2_balance) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_balance WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :accounts\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T1 a :savings .\n      ?T1 :savings\\#ref-custid ?T13 .\n      ?T1 :savings\\#balance ?T1_balance .\n      ?T1 :savings\\#balance ?T1_balance\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T2 :checking\\#balance ?T2_balance .\n      ?T2 a :checking .\n      ?T2 :checking\\#ref-custid ?T13 .\n      ?T2 :checking\\#balance ?T2_balance\n  }\n}\nORDER BY DESC (?T2_balance) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1878",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the total checking and saving balance of all accounts sorted by the total balance in ascending order.",
    "original_sparql": "SELECT ?T1_balance + ?T2_balance WHERE { ?T1 a :checking . ?T13 a :accounts . ?T1 :checking\\#ref-custid ?T13 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :savings\\#balance ?T2_balance . ?T1 :checking\\#balance ?T1_balance . ?T2 a :savings . ?T2 :savings\\#ref-custid ?T13 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :savings\\#balance ?T2_balance . ?T1 :checking\\#balance ?T1_balance .        }  ORDER BY ASC (?T1_balance + ?T2_balance)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_balance + ?T2_balance WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :accounts\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T1 a :checking .\n      ?T1 :checking\\#ref-custid ?T13 .\n      ?T1 :checking\\#balance ?T1_balance .\n      ?T1 :checking\\#balance ?T1_balance .\n      ?T1 :checking\\#balance ?T1_balance .\n      ?T1 :checking\\#balance ?T1_balance\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T2 :savings\\#balance ?T2_balance .\n      ?T2 a :savings .\n      ?T2 :savings\\#ref-custid ?T13 .\n      ?T2 :savings\\#balance ?T2_balance\n  }\n}\nORDER BY ASC (?T1_balance + ?T2_balance)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "small_bank_1_1880",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the name and checking balance of the account with the lowest saving balance.",
    "original_sparql": "SELECT ?T1_balance ?T2_name WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :checking\\#ref-custid ?T2 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :accounts\\#name ?T2_name . ?T3 :savings\\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\\#ref-custid ?T2 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :accounts\\#name ?T2_name . ?T3 :savings\\#balance ?T3_balance .        }   ORDER BY ASC (?T3_balance) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_balance ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :accounts .\n      ?T2 :accounts\\#name ?T2_name .\n      ?T2 :accounts\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T1 a :checking .\n      ?T1 :checking\\#ref-custid ?T2 .\n      ?T1 :checking\\#balance ?T1_balance .\n      ?T1 :checking\\#balance ?T1_balance\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T3 :savings\\#balance ?T3_balance .\n      ?T3 a :savings .\n      ?T3 :savings\\#ref-custid ?T2 .\n      ?T3 :savings\\#balance ?T3_balance\n  }\n}\nORDER BY ASC (?T3_balance) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1882",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the name, checking balance and saving balance of all accounts in the bank.",
    "original_sparql": "SELECT ?T1_balance ?T2_balance ?T3_name WHERE { ?T1 a :checking . ?T3 a :accounts . ?T1 :checking\\#ref-custid ?T3 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :savings\\#balance ?T2_balance . ?T3 :accounts\\#name ?T3_name . ?T2 a :savings . ?T2 :savings\\#ref-custid ?T3 .  ?T1 :checking\\#balance ?T1_balance . ?T2 :savings\\#balance ?T2_balance . ?T3 :accounts\\#name ?T3_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_balance ?T2_balance ?T3_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T3 ?T3_name WHERE {\n      ?T3 a :accounts .\n      ?T3 :accounts\\#name ?T3_name .\n      ?T3 :accounts\\#name ?T3_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T1 a :checking .\n      ?T1 :checking\\#ref-custid ?T3 .\n      ?T1 :checking\\#balance ?T1_balance .\n      ?T1 :checking\\#balance ?T1_balance\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__savings/sparql> {\n    ?T2 :savings\\#balance ?T2_balance .\n      ?T2 a :savings .\n      ?T2 :savings\\#ref-custid ?T3 .\n      ?T2 :savings\\#balance ?T2_balance\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "small_bank_1_1886",
    "kg_name": "small_bank_1",
    "split": "train",
    "question": "Find the name of accounts whose checking balance is higher than corresponding saving balance.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\\#ref-custid ?T1 .  ?T1 :accounts\\#name ?T1_name . ?T2 :checking\\#balance ?T2_balance . FILTER(?T2_balance > [0, 18, False]) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/small_bank_1__accounts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :accounts .\n      ?T1 :accounts\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/small_bank_1__checking/sparql> {\n    ?T2 a :checking .\n      ?T2 :checking\\#ref-custid ?T1 .\n      ?T2 :checking\\#balance ?T2_balance\n      FILTER(?T2_balance > [0, 18, False])\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/small_bank_1__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/savings",
        "url": "http://host.docker.internal:3030/small_bank_1__savings/sparql"
      },
      {
        "class": "http://valuenet/ontop/checking",
        "url": "http://host.docker.internal:3030/small_bank_1__checking/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  }
]