[
  {
    "id": "sakila_1_1759",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which film actors (actresses) played a role in more than 30 films? List his or her first name and last name.",
    "original_sparql": "SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :actor . ?T2 a :film_actor . ?T2 :film_actor\\#ref-actor_id ?T1 .  ?T1 :actor\\#first_name ?T1_first_name . ?T1 :actor\\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 30)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name ?T1_last_name WHERE {\n  {\n    SELECT ?T1 ?T1_first_name ?T1_last_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__actor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_first_name ?T1_last_name WHERE {\n      ?T1 a :actor .\n      ?T1 :actor\\#first_name ?T1_first_name .\n      ?T1 :actor\\#last_name ?T1_last_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__film_actor/sparql> {\n    ?T2 a :film_actor .\n      ?T2 :film_actor\\#ref-actor_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 30)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 56,
      "federated_count": 56,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1761",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which customer, who has made at least one payment, has spent the least money? List his or her first name, last name, and the id.",
    "original_sparql": "SELECT ?T1_first_name ?T1_last_name ?T1_customer_id WHERE { ?T1 a :customer . ?T2 a :payment . ?T2 :payment\\#ref-customer_id ?T1 .  ?T1 :customer\\#first_name ?T1_first_name . ?T1 :customer\\#last_name ?T1_last_name . ?T1 :customer\\#customer_id ?T1_customer_id . ?T2 :payment\\#amount ?T2_amount .        } GROUP BY ?T1_first_name ?T1_last_name ?T1_customer_id  ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_81 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name ?T1_last_name ?T1_customer_id WHERE {\n  {\n    SELECT ?T1 ?T1_customer_id ?T1_first_name ?T1_last_name ?T2 ?T2_amount WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__payment/sparql> {\n    SELECT DISTINCT ?T2 ?T2_amount WHERE {\n      ?T2 a :payment .\n      ?T2 :payment\\#amount ?T2_amount\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__customer/sparql> {\n    ?T1 a :customer .\n      ?T2 :payment\\#ref-customer_id ?T1 .\n      ?T1 :customer\\#first_name ?T1_first_name .\n      ?T1 :customer\\#last_name ?T1_last_name .\n      ?T1 :customer\\#customer_id ?T1_customer_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_first_name ?T1_last_name ?T1_customer_id  ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_81 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "sakila_1_1764",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Return the name of the category to which the film 'HUNGER ROOF' belongs.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :category . ?T13 a :film_category . ?T13 :film_category\\#ref-category_id ?T1 .  ?T1 :category\\#name ?T1_name . ?T2 :film\\#title ?T2_title . ?T2 a :film . ?T13 :film_category\\#ref-film_id ?T2 .  ?T1 :category\\#name ?T1_name . ?T2 :film\\#title ?T2_title . FILTER(?T2_title = 'HUNGER ROOF') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__category/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :category .\n      ?T1 :category\\#name ?T1_name .\n      ?T1 :category\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__film/sparql> {\n    SELECT DISTINCT ?T2 ?T2_title WHERE {\n      ?T2 :film\\#title ?T2_title .\n      ?T2 a :film .\n      ?T2 :film\\#title ?T2_title\n      FILTER(?T2_title = 'HUNGER ROOF')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__film_category/sparql> {\n    ?T13 a :film_category .\n      ?T13 :film_category\\#ref-category_id ?T1 .\n      ?T13 :film_category\\#ref-film_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1765",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "How many films are there in each category? List the genre name, genre id and the count.",
    "original_sparql": "SELECT ?T1_name ?T2_category_id (count( *) as ?aggregation_all) WHERE { ?T1 a :category . ?T2 a :film_category . ?T2 :film_category\\#ref-category_id ?T1 .  ?T1 :category\\#name ?T1_name . ?T2 :film_category\\#category_id ?T2_category_id .        } GROUP BY ?T1_name ?T2_category_id",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_category_id (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 ?T2_category_id WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__category/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :category .\n      ?T1 :category\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__film_category/sparql> {\n    ?T2 a :film_category .\n      ?T2 :film_category\\#ref-category_id ?T1 .\n      ?T2 :film_category\\#category_id ?T2_category_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T2_category_id",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 16,
      "federated_count": 16,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1767",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which film has the most copies in the inventory? List both title and id.",
    "original_sparql": "SELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id WHERE { ?T1 a :film . ?T2 a :inventory . ?T2 :inventory\\#ref-film_id ?T1 .  ?T1 :film\\#title ?T1_title . ?T1 :film\\#film_id ?T1_film_id .        } GROUP BY ?T1_title ?T1_film_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id WHERE {\n  {\n    SELECT ?T1 ?T1_film_id ?T1_title ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__film/sparql> {\n    SELECT DISTINCT ?T1 ?T1_film_id ?T1_title WHERE {\n      ?T1 a :film .\n      ?T1 :film\\#title ?T1_title .\n      ?T1 :film\\#film_id ?T1_film_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__inventory/sparql> {\n    ?T2 a :inventory .\n      ?T2 :inventory\\#ref-film_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_title ?T1_film_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1770",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Return the title and inventory id of the film that is rented most often.",
    "original_sparql": "SELECT ?T1_title (count( *) as ?aggregation_all) ?T2_inventory_id WHERE { ?T1 a :film . ?T2 a :inventory . ?T2 :inventory\\#ref-film_id ?T1 .  ?T1 :film\\#title ?T1_title . ?T2 :inventory\\#inventory_id ?T2_inventory_id .        } GROUP BY ?T1_title ?T2_inventory_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title (count( *) as ?aggregation_all) ?T2_inventory_id WHERE {\n  {\n    SELECT ?T1 ?T1_title ?T2 ?T2_inventory_id WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__film/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :film .\n      ?T1 :film\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__inventory/sparql> {\n    ?T2 a :inventory .\n      ?T2 :inventory\\#ref-film_id ?T1 .\n      ?T2 :inventory\\#inventory_id ?T2_inventory_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_title ?T2_inventory_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1771",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which staff handled least number of payments? List the full name and the id.",
    "original_sparql": "SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name ?T1_staff_id WHERE { ?T1 a :staff . ?T13 a :address . ?T1 :staff\\#ref-address_id ?T13 .  ?T1 :staff\\#first_name ?T1_first_name . ?T1 :staff\\#last_name ?T1_last_name . ?T1 :staff\\#staff_id ?T1_staff_id . ?T14 a :customer . ?T14 :customer\\#ref-address_id ?T13 .  ?T1 :staff\\#first_name ?T1_first_name . ?T1 :staff\\#last_name ?T1_last_name . ?T1 :staff\\#staff_id ?T1_staff_id .        } GROUP BY ?T1_first_name ?T1_last_name ?T1_staff_id  ORDER BY ASC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name ?T1_staff_id WHERE {\n  {\n    SELECT ?T1 ?T13 ?T14 ?T1_first_name ?T1_last_name ?T1_staff_id WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__address/sparql> {\n    SELECT DISTINCT ?T13 ?T1_first_name ?T1_last_name ?T1_staff_id WHERE {\n      ?T13 a :address .\n      ?T1 :staff\\#ref-address_id ?T13 .\n      ?T1 a :staff .\n      ?T1 :staff\\#first_name ?T1_first_name .\n      ?T1 :staff\\#last_name ?T1_last_name .\n      ?T1 :staff\\#staff_id ?T1_staff_id .\n      ?T1 :staff\\#first_name ?T1_first_name .\n      ?T1 :staff\\#last_name ?T1_last_name .\n      ?T1 :staff\\#staff_id ?T1_staff_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__customer/sparql> {\n    ?T14 a :customer .\n      ?T14 :customer\\#ref-address_id ?T13\n  }\n    }\n  }\n}\nGROUP BY ?T1_first_name ?T1_last_name ?T1_staff_id  ORDER BY ASC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1774",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Return the address and email of the customer with the first name Linda.",
    "original_sparql": "SELECT ?T1_address ?T2_email WHERE { ?T1 a :address . ?T2 a :customer . ?T2 :customer\\#ref-address_id ?T1 .  ?T1 :address\\#address ?T1_address . ?T2 :customer\\#email ?T2_email . ?T2 :customer\\#first_name ?T2_first_name . FILTER(?T2_first_name = 'LINDA') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_address ?T2_email WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__address/sparql> {\n    SELECT DISTINCT ?T1 ?T1_address WHERE {\n      ?T1 a :address .\n      ?T1 :address\\#address ?T1_address\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__customer/sparql> {\n    ?T2 a :customer .\n      ?T2 :customer\\#ref-address_id ?T1 .\n      ?T2 :customer\\#email ?T2_email .\n      ?T2 :customer\\#first_name ?T2_first_name\n      FILTER(?T2_first_name = 'LINDA')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1776",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Return the full name of the customer who made the first rental.",
    "original_sparql": "SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customer . ?T2 a :rental . ?T2 :rental\\#ref-customer_id ?T1 .  ?T1 :customer\\#first_name ?T1_first_name . ?T1 :customer\\#last_name ?T1_last_name . ?T2 :rental\\#rental_date ?T2_rental_date .        }   ORDER BY ASC (?T2_rental_date) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name ?T1_last_name WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__rental/sparql> {\n    SELECT DISTINCT ?T2 ?T2_rental_date WHERE {\n      ?T2 a :rental .\n      ?T2 :rental\\#rental_date ?T2_rental_date\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__customer/sparql> {\n    ?T1 a :customer .\n      ?T2 :rental\\#ref-customer_id ?T1 .\n      ?T1 :customer\\#first_name ?T1_first_name .\n      ?T1 :customer\\#last_name ?T1_last_name\n  }\n}\nORDER BY ASC (?T2_rental_date) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "sakila_1_1778",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Return the full name of the staff who provided a customer with the first name April and the last name Burns with a film rental.",
    "original_sparql": "SELECT DISTINCT ?T1_first_name ?T1_last_name WHERE { ?T1 a :staff . ?T13 a :address . ?T1 :staff\\#ref-address_id ?T13 .  ?T1 :staff\\#first_name ?T1_first_name . ?T1 :staff\\#last_name ?T1_last_name . ?T2 :customer\\#first_name ?T2_first_name . ?T2 :customer\\#last_name ?T2_last_name . ?T2 a :customer . ?T2 :customer\\#ref-address_id ?T13 .  ?T1 :staff\\#first_name ?T1_first_name . ?T1 :staff\\#last_name ?T1_last_name . ?T2 :customer\\#first_name ?T2_first_name . ?T2 :customer\\#last_name ?T2_last_name . FILTER(?T2_first_name = 'APRIL' && ?T2_last_name = 'BURNS') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_first_name ?T1_last_name WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__address/sparql> {\n    SELECT DISTINCT ?T1 ?T13 ?T1_first_name ?T1_last_name WHERE {\n      ?T13 a :address .\n      ?T1 :staff\\#ref-address_id ?T13 .\n      ?T1 a :staff .\n      ?T1 :staff\\#first_name ?T1_first_name .\n      ?T1 :staff\\#last_name ?T1_last_name .\n      ?T1 :staff\\#first_name ?T1_first_name .\n      ?T1 :staff\\#last_name ?T1_last_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__customer/sparql> {\n    ?T2 :customer\\#first_name ?T2_first_name .\n      ?T2 :customer\\#last_name ?T2_last_name .\n      ?T2 a :customer .\n      ?T2 :customer\\#ref-address_id ?T13 .\n      ?T2 :customer\\#first_name ?T2_first_name .\n      ?T2 :customer\\#last_name ?T2_last_name\n      FILTER(?T2_first_name = 'APRIL' && ?T2_last_name = 'BURNS')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  }
]