[
  {
    "id": "college_1_311",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the number of classes in each school.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE { ?T13 a :employee . ?T2 a :department . ?T2 :department\\#ref-emp_num ?T13 .  ?T2 :department\\#school_code ?T2_school_code .        } GROUP BY ?T2_school_code",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE {\n  {\n    SELECT ?T13 ?T2 ?T2_school_code WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :employee\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    ?T2 a :department .\n      ?T2 :department\\#ref-emp_num ?T13 .\n      ?T2 :department\\#school_code ?T2_school_code\n  }\n    }\n  }\n}\nGROUP BY ?T2_school_code",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_321",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the name of the department that offers the largest number of credits of all classes.",
    "original_sparql": "SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :course . ?T2 :course\\#ref-dept_code ?T1 .  ?T1 :department\\#dept_name ?T1_dept_name . ?T2 :course\\#crs_credit ?T2_crs_credit .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T2_crs_credit) as ?aggregation_T2_crs_credit_113 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_dept_name WHERE {\n  {\n    SELECT ?T1 ?T1_dept_name ?T2 ?T2_crs_credit WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T1 ?T1_dept_name WHERE {\n      ?T1 a :department .\n      ?T1 :department\\#dept_name ?T1_dept_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__course/sparql> {\n    ?T2 a :course .\n      ?T2 :course\\#ref-dept_code ?T1 .\n      ?T2 :course\\#crs_credit ?T2_crs_credit\n  }\n    }\n  }\n}\nGROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T2_crs_credit) as ?aggregation_T2_crs_credit_113 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "college_1_333",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names and offices of all professors sorted by alphabetical order of their first name.",
    "original_sparql": "SELECT ?T1_emp_fname ?T2_prof_office WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T1 :employee\\#emp_fname ?T1_emp_fname .        }  ORDER BY ASC (?T1_emp_fname)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname ?T2_prof_office WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__professor/sparql> {\n    ?T2 a :professor .\n      ?T2 :professor\\#ref-emp_num ?T1 .\n      ?T2 :professor\\#prof_office ?T2_prof_office\n  }\n}\nORDER BY ASC (?T1_emp_fname)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 22,
      "federated_count": 22,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_345",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the last name and hire date of the professor who is in office DRE 102.",
    "original_sparql": "SELECT ?T1_emp_lname ?T1_emp_hiredate WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_lname ?T1_emp_lname . ?T1 :employee\\#emp_hiredate ?T1_emp_hiredate . ?T2 :professor\\#prof_office ?T2_prof_office . FILTER(?T2_prof_office = 'DRE 102') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_lname ?T1_emp_hiredate WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_hiredate ?T1_emp_lname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_lname ?T1_emp_lname .\n      ?T1 :employee\\#emp_hiredate ?T1_emp_hiredate\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__professor/sparql> {\n    ?T2 a :professor .\n      ?T2 :professor\\#ref-emp_num ?T1 .\n      ?T2 :professor\\#prof_office ?T2_prof_office\n      FILTER(?T2_prof_office = 'DRE 102')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_353",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first name of the professor who is teaching two courses with code CIS-220 and QM-261.",
    "original_sparql": "SELECT DISTINCT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\\#ref-prof_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :class\\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'CIS-220') . FILTER (?T1_emp_fname in (?T3_emp_fname)) .   ?T3 a :employee . ?T4 a :class . ?T4 :class\\#ref-prof_num ?T3 .  ?T3 :employee\\#emp_fname ?T3_emp_fname . ?T4 :class\\#crs_code ?T4_crs_code .  FILTER(?T4_crs_code = 'QM-261') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_emp_fname WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname ?T3 ?T3_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T3 a :employee .\n      ?T3 :employee\\#emp_fname ?T3_emp_fname\n      FILTER (?T1_emp_fname in (?T3_emp_fname))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__class/sparql> {\n    ?T2 a :class .\n      ?T2 :class\\#ref-prof_num ?T1 .\n      ?T2 :class\\#crs_code ?T2_crs_code .\n      ?T4 a :class .\n      ?T4 :class\\#ref-prof_num ?T3 .\n      ?T4 :class\\#crs_code ?T4_crs_code\n      FILTER(?T2_crs_code = 'CIS-220')\n      FILTER(?T4_crs_code = 'QM-261')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_355",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first name of student who is taking classes from accounting and Computer Info. Systems departments",
    "original_sparql": "SELECT DISTINCT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :department . ?T1 :student\\#ref-dept_name ?T2 .  ?T1 :student\\#stu_fname ?T1_stu_fname . ?T2 :department\\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Accounting') . FILTER (?T1_stu_fname in (?T3_stu_fname)) .   ?T3 a :student . ?T4 a :department . ?T3 :student\\#ref-dept_name ?T4 .  ?T3 :student\\#stu_fname ?T3_stu_fname . ?T4 :department\\#dept_name ?T4_dept_name .  FILTER(?T4_dept_name = 'Computer Info. Systems') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_stu_fname WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T2 ?T2_dept_name ?T4 ?T4_dept_name WHERE {\n      ?T2 a :department .\n      ?T2 :department\\#dept_name ?T2_dept_name .\n      ?T4 a :department .\n      ?T4 :department\\#dept_name ?T4_dept_name\n      FILTER(?T2_dept_name = 'Accounting')\n      FILTER(?T4_dept_name = 'Computer Info. Systems')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__student/sparql> {\n    ?T1 a :student .\n      ?T1 :student\\#ref-dept_name ?T2 .\n      ?T1 :student\\#stu_fname ?T1_stu_fname .\n      ?T3 a :student .\n      ?T3 :student\\#ref-dept_name ?T4 .\n      ?T3 :student\\#stu_fname ?T3_stu_fname\n      FILTER (?T1_stu_fname in (?T3_stu_fname))\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_361",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the name and address of the department that has the highest number of students.",
    "original_sparql": "SELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T1_dept_address WHERE { ?T1 a :department . ?T2 a :student . ?T2 :student\\#ref-dept_name ?T1 .  ?T1 :department\\#dept_name ?T1_dept_name . ?T1 :department\\#dept_address ?T1_dept_address .        } GROUP BY ?T1_dept_name ?T1_dept_address  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T1_dept_address WHERE {\n  {\n    SELECT ?T1 ?T1_dept_address ?T1_dept_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T1 ?T1_dept_address ?T1_dept_name WHERE {\n      ?T1 a :department .\n      ?T1 :department\\#dept_name ?T1_dept_name .\n      ?T1 :department\\#dept_address ?T1_dept_address\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__student/sparql> {\n    ?T2 a :student .\n      ?T2 :student\\#ref-dept_name ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_dept_name ?T1_dept_address  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_365",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first name and office of the professor who is in the history department and has a Ph.D. degree.",
    "original_sparql": "SELECT ?T1_emp_fname ?T2_prof_office WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :department\\#dept_name ?T3_dept_name . ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree . ?T3 a :department . ?T2 :professor\\#ref-dept_code ?T3 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :department\\#dept_name ?T3_dept_name . ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree . FILTER(?T3_dept_name = 'History' && ?T2_prof_high_degree = 'Ph.D.') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname ?T2_prof_office WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T3 ?T3_dept_name WHERE {\n      ?T3 :department\\#dept_name ?T3_dept_name .\n      ?T3 a :department .\n      ?T3 :department\\#dept_name ?T3_dept_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__professor/sparql> {\n    ?T2 a :professor .\n      ?T2 :professor\\#ref-emp_num ?T1 .\n      ?T2 :professor\\#prof_office ?T2_prof_office .\n      ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree .\n      ?T2 :professor\\#ref-dept_code ?T3 .\n      ?T2 :professor\\#prof_office ?T2_prof_office .\n      ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree\n      FILTER(?T3_dept_name = 'History' && ?T2_prof_high_degree = 'Ph.D.')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "college_1_367",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names of all instructors who have taught some course and the course code.",
    "original_sparql": "SELECT ?T1_emp_fname ?T2_crs_code WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\\#ref-prof_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :class\\#crs_code ?T2_crs_code .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname ?T2_crs_code WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__class/sparql> {\n    ?T2 a :class .\n      ?T2 :class\\#ref-prof_num ?T1 .\n      ?T2 :class\\#crs_code ?T2_crs_code\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_369",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names of all instructors who have taught some course and the course description.",
    "original_sparql": "SELECT ?T1_emp_fname ?T2_crs_description WHERE { ?T1 a :employee . ?T13 a :department . ?T13 :department\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :course\\#crs_description ?T2_crs_description . ?T2 a :course . ?T2 :course\\#ref-dept_code ?T13 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :course\\#crs_description ?T2_crs_description .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname ?T2_crs_description WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T1 ?T13 WHERE {\n      ?T13 a :department .\n      ?T13 :department\\#ref-emp_num ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__course/sparql> {\n    ?T2 :course\\#crs_description ?T2_crs_description .\n      ?T2 a :course .\n      ?T2 :course\\#ref-dept_code ?T13 .\n      ?T2 :course\\#crs_description ?T2_crs_description\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_371",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names and offices of all instructors who have taught some course and also find the course description.",
    "original_sparql": "SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :course\\#crs_description ?T3_crs_description . ?T14 a :department . ?T2 :professor\\#ref-dept_code ?T14 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :course\\#crs_description ?T3_crs_description . ?T3 a :course . ?T3 :course\\#ref-dept_code ?T14 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :course\\#crs_description ?T3_crs_description .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T14 WHERE {\n      ?T14 a :department\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__professor/sparql> {\n    ?T2 a :professor .\n      ?T2 :professor\\#ref-emp_num ?T1 .\n      ?T2 :professor\\#prof_office ?T2_prof_office .\n      ?T2 :professor\\#ref-dept_code ?T14 .\n      ?T2 :professor\\#prof_office ?T2_prof_office .\n      ?T2 :professor\\#prof_office ?T2_prof_office\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__course/sparql> {\n    ?T3 :course\\#crs_description ?T3_crs_description .\n      ?T3 :course\\#crs_description ?T3_crs_description .\n      ?T3 a :course .\n      ?T3 :course\\#ref-dept_code ?T14 .\n      ?T3 :course\\#crs_description ?T3_crs_description\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 18,
      "federated_count": 18,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_373",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names and offices of all instructors who have taught some course and the course description and the department name.",
    "original_sparql": "SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description ?T4_dept_name WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :course\\#crs_description ?T3_crs_description . ?T4 :department\\#dept_name ?T4_dept_name . ?T4 a :department . ?T2 :professor\\#ref-dept_code ?T4 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :course\\#crs_description ?T3_crs_description . ?T4 :department\\#dept_name ?T4_dept_name . ?T3 a :course . ?T3 :course\\#ref-dept_code ?T4 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_office ?T2_prof_office . ?T3 :course\\#crs_description ?T3_crs_description . ?T4 :department\\#dept_name ?T4_dept_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description ?T4_dept_name WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T4 ?T4_dept_name WHERE {\n      ?T4 :department\\#dept_name ?T4_dept_name .\n      ?T4 a :department .\n      ?T4 :department\\#dept_name ?T4_dept_name .\n      ?T4 :department\\#dept_name ?T4_dept_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__professor/sparql> {\n    ?T2 a :professor .\n      ?T2 :professor\\#ref-emp_num ?T1 .\n      ?T2 :professor\\#prof_office ?T2_prof_office .\n      ?T2 :professor\\#ref-dept_code ?T4 .\n      ?T2 :professor\\#prof_office ?T2_prof_office .\n      ?T2 :professor\\#prof_office ?T2_prof_office\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__course/sparql> {\n    ?T3 :course\\#crs_description ?T3_crs_description .\n      ?T3 :course\\#crs_description ?T3_crs_description .\n      ?T3 a :course .\n      ?T3 :course\\#ref-dept_code ?T4 .\n      ?T3 :course\\#crs_description ?T3_crs_description\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 18,
      "federated_count": 18,
      "missing": 0,
      "extra": 0
    }
  }
]