[
  {
    "id": "tracking_orders_2128",
    "kg_name": "tracking_orders",
    "split": "train",
    "question": "List the names of the customers who have once bought product 'food'.",
    "original_sparql": "SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :orders . ?T13 :orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :products\\#product_name ?T2_product_name . ?T14 a :order_items . ?T14 :order_items\\#ref-order_id ?T13 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T14 :order_items\\#ref-product_id ?T2 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'food') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_name WHERE {\n  {\n    SELECT ?T1 ?T13 ?T14 ?T1_customer_name ?T2 ?T2_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_orders__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_orders__orders/sparql> {\n    SELECT DISTINCT ?T1 ?T13 WHERE {\n      ?T13 a :orders .\n      ?T13 :orders\\#ref-customer_id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_orders__products/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 :products\\#product_name ?T2_product_name .\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'food')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_orders__order_items/sparql> {\n    ?T14 a :order_items .\n      ?T14 :order_items\\#ref-order_id ?T13 .\n      ?T14 :order_items\\#ref-product_id ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/shipment_items",
        "url": "http://host.docker.internal:3030/tracking_orders__shipment_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/tracking_orders__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/orders",
        "url": "http://host.docker.internal:3030/tracking_orders__orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/tracking_orders__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/tracking_orders__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/shipments",
        "url": "http://host.docker.internal:3030/tracking_orders__shipments/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/tracking_orders__invoices/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_orders_2130",
    "kg_name": "tracking_orders",
    "split": "train",
    "question": "List the names of customers who have once canceled the purchase of the product 'food' (the item status is 'Cancel').",
    "original_sparql": "SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T4 a :orders . ?T4 :orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :order_items\\#order_item_status ?T2_order_item_status . ?T3 :products\\#product_name ?T3_product_name . ?T2 a :order_items . ?T2 :order_items\\#ref-order_id ?T4 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :order_items\\#order_item_status ?T2_order_item_status . ?T3 :products\\#product_name ?T3_product_name . ?T3 a :products . ?T2 :order_items\\#ref-product_id ?T3 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :order_items\\#order_item_status ?T2_order_item_status . ?T3 :products\\#product_name ?T3_product_name . FILTER(?T2_order_item_status = 'Cancel' && ?T3_product_name = 'food') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_name WHERE {\n  {\n    SELECT ?T1 ?T1_customer_name ?T2 ?T2_order_item_status ?T3 ?T3_product_name ?T4 WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_orders__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_orders__orders/sparql> {\n    SELECT DISTINCT ?T1 ?T4 WHERE {\n      ?T4 a :orders .\n      ?T4 :orders\\#ref-customer_id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_orders__products/sparql> {\n    SELECT DISTINCT ?T3 ?T3_product_name WHERE {\n      ?T3 :products\\#product_name ?T3_product_name .\n      ?T3 :products\\#product_name ?T3_product_name .\n      ?T3 a :products .\n      ?T3 :products\\#product_name ?T3_product_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_orders__order_items/sparql> {\n    ?T2 :order_items\\#order_item_status ?T2_order_item_status .\n      ?T2 a :order_items .\n      ?T2 :order_items\\#ref-order_id ?T4 .\n      ?T2 :order_items\\#order_item_status ?T2_order_item_status .\n      ?T2 :order_items\\#ref-product_id ?T3 .\n      ?T2 :order_items\\#order_item_status ?T2_order_item_status\n      FILTER(?T2_order_item_status = 'Cancel' && ?T3_product_name = 'food')\n  }\n    }\n  }\n}\nGROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/shipment_items",
        "url": "http://host.docker.internal:3030/tracking_orders__shipment_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/tracking_orders__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/orders",
        "url": "http://host.docker.internal:3030/tracking_orders__orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/tracking_orders__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/tracking_orders__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/shipments",
        "url": "http://host.docker.internal:3030/tracking_orders__shipments/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/tracking_orders__invoices/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 0,
      "missing": 2,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "tracking_share_transactions_2132",
    "kg_name": "tracking_share_transactions",
    "split": "train",
    "question": "Show the transaction type descriptions and dates if the share count is smaller than 10.",
    "original_sparql": "SELECT ?T1_transaction_type_description ?T2_date_of_transaction WHERE { ?T1 a :ref_transaction_types . ?T2 a :transactions . ?T2 :transactions\\#ref-transaction_type_code ?T1 .  ?T1 :ref_transaction_types\\#transaction_type_description ?T1_transaction_type_description . ?T2 :transactions\\#date_of_transaction ?T2_date_of_transaction . ?T2 :transactions\\#share_count ?T2_share_count . FILTER(?T2_share_count < 10) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_transaction_type_description ?T2_date_of_transaction WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__ref_transaction_types/sparql> {\n    SELECT DISTINCT ?T1 ?T1_transaction_type_description WHERE {\n      ?T1 a :ref_transaction_types .\n      ?T1 :ref_transaction_types\\#transaction_type_description ?T1_transaction_type_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql> {\n    ?T2 a :transactions .\n      ?T2 :transactions\\#ref-transaction_type_code ?T1 .\n      ?T2 :transactions\\#date_of_transaction ?T2_date_of_transaction .\n      ?T2 :transactions\\#share_count ?T2_share_count\n      FILTER(?T2_share_count < 10)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/purchases",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__purchases/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions_lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/sales",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__sales/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_transaction_types",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__ref_transaction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql"
      },
      {
        "class": "http://valuenet/ontop/investors",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__investors/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_share_transactions_2133",
    "kg_name": "tracking_share_transactions",
    "split": "train",
    "question": "Show details of all investors if they make any transaction with share count greater than 100.",
    "original_sparql": "SELECT ?T1_investor_details WHERE { ?T1 a :investors . ?T2 a :transactions . ?T2 :transactions\\#ref-investor_id ?T1 .  ?T1 :investors\\#investor_details ?T1_investor_details . ?T2 :transactions\\#share_count ?T2_share_count . FILTER(?T2_share_count > 100) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_investor_details WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__investors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_investor_details WHERE {\n      ?T1 a :investors .\n      ?T1 :investors\\#investor_details ?T1_investor_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql> {\n    ?T2 a :transactions .\n      ?T2 :transactions\\#ref-investor_id ?T1 .\n      ?T2 :transactions\\#share_count ?T2_share_count\n      FILTER(?T2_share_count > 100)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/purchases",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__purchases/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions_lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/sales",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__sales/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_transaction_types",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__ref_transaction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql"
      },
      {
        "class": "http://valuenet/ontop/investors",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__investors/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_share_transactions_2139",
    "kg_name": "tracking_share_transactions",
    "split": "train",
    "question": "Show the average amount of transactions for different lots.",
    "original_sparql": "SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_184 ) WHERE { ?T1 a :transactions_lots . ?T2 a :transactions . ?T1 :transactions_lots\\#ref-transaction_id ?T2 .  ?T1 :transactions_lots\\#lot_id ?T1_lot_id . ?T2 :transactions\\#amount_of_transaction ?T2_amount_of_transaction .        } GROUP BY ?T1_lot_id",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_184 ) WHERE {\n  {\n    SELECT ?T1 ?T1_lot_id ?T2 ?T2_amount_of_transaction WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_amount_of_transaction WHERE {\n      ?T2 a :transactions .\n      ?T2 :transactions\\#amount_of_transaction ?T2_amount_of_transaction\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql> {\n    ?T1 a :transactions_lots .\n      ?T1 :transactions_lots\\#ref-transaction_id ?T2 .\n      ?T1 :transactions_lots\\#lot_id ?T1_lot_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_lot_id",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/purchases",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__purchases/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions_lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/sales",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__sales/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_transaction_types",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__ref_transaction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql"
      },
      {
        "class": "http://valuenet/ontop/investors",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__investors/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 9,
      "federated_count": 9,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_share_transactions_2140",
    "kg_name": "tracking_share_transactions",
    "split": "train",
    "question": "Show the average amount of transactions for different lots, ordered by average amount of transactions.",
    "original_sparql": "SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_160 ) WHERE { ?T1 a :transactions_lots . ?T2 a :transactions . ?T1 :transactions_lots\\#ref-transaction_id ?T2 .  ?T1 :transactions_lots\\#lot_id ?T1_lot_id . ?T2 :transactions\\#amount_of_transaction ?T2_amount_of_transaction . ?T2 :transactions\\#amount_of_transaction ?T2_amount_of_transaction .        } GROUP BY ?T1_lot_id ORDER BY ASC ((avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_200 ))",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_160 ) WHERE {\n  {\n    SELECT ?T1 ?T1_lot_id ?T2 ?T2_amount_of_transaction WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_amount_of_transaction WHERE {\n      ?T2 a :transactions .\n      ?T2 :transactions\\#amount_of_transaction ?T2_amount_of_transaction .\n      ?T2 :transactions\\#amount_of_transaction ?T2_amount_of_transaction\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql> {\n    ?T1 a :transactions_lots .\n      ?T1 :transactions_lots\\#ref-transaction_id ?T2 .\n      ?T1 :transactions_lots\\#lot_id ?T1_lot_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_lot_id ORDER BY ASC ((avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_200 ))",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/purchases",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__purchases/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions_lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/sales",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__sales/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_transaction_types",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__ref_transaction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql"
      },
      {
        "class": "http://valuenet/ontop/investors",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__investors/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "tracking_share_transactions_2142",
    "kg_name": "tracking_share_transactions",
    "split": "train",
    "question": "Show the id and details of the investor that has the largest number of transactions.",
    "original_sparql": "SELECT ?T1_investor_id (count( *) as ?aggregation_all) ?T2_investor_details WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :transactions\\#ref-investor_id ?T2 .  ?T1 :transactions\\#investor_id ?T1_investor_id . ?T2 :investors\\#investor_details ?T2_investor_details .        } GROUP BY ?T1_investor_id ?T2_investor_details  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_investor_id (count( *) as ?aggregation_all) ?T2_investor_details WHERE {\n  {\n    SELECT ?T1 ?T1_investor_id ?T2 ?T2_investor_details WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__investors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_investor_details WHERE {\n      ?T2 a :investors .\n      ?T2 :investors\\#investor_details ?T2_investor_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql> {\n    ?T1 a :transactions .\n      ?T1 :transactions\\#ref-investor_id ?T2 .\n      ?T1 :transactions\\#investor_id ?T1_investor_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_investor_id ?T2_investor_details  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/purchases",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__purchases/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions_lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/sales",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__sales/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_transaction_types",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__ref_transaction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql"
      },
      {
        "class": "http://valuenet/ontop/investors",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__investors/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_share_transactions_2144",
    "kg_name": "tracking_share_transactions",
    "split": "train",
    "question": "Show the ids of the investors who have at least two transactions.",
    "original_sparql": "SELECT ?T1_investor_id WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :transactions\\#ref-investor_id ?T2 .  ?T1 :transactions\\#investor_id ?T1_investor_id .        } GROUP BY ?T1_investor_id   HAVING(count( *)  >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_investor_id WHERE {\n  {\n    SELECT ?T1 ?T1_investor_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__investors/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :investors\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql> {\n    ?T1 a :transactions .\n      ?T1 :transactions\\#ref-investor_id ?T2 .\n      ?T1 :transactions\\#investor_id ?T1_investor_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_investor_id   HAVING(count( *)  >= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/purchases",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__purchases/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions_lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions_lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/lots",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__lots/sparql"
      },
      {
        "class": "http://valuenet/ontop/sales",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__sales/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_transaction_types",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__ref_transaction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/transactions",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__transactions/sparql"
      },
      {
        "class": "http://valuenet/ontop/investors",
        "url": "http://host.docker.internal:3030/tracking_share_transactions__investors/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "twitter_1_2158",
    "kg_name": "twitter_1",
    "split": "train",
    "question": "Find the names of the users whose number of followers is greater than that of the user named 'Tyler Swift'.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T2 a :follows . ?T2 :follows\\#ref-f1 ?T1 .  ?T1 :user_profiles\\#name ?T1_name .       {SELECT (count( *) as ?aggregation_all) WHERE { ?T23 a :follows . ?T24 a :user_profiles . ?T23 :follows\\#ref-f1 ?T24 .  ?T24 :user_profiles\\#name ?T24_name . FILTER(?T24_name = 'Tyler Swift') .        }    } } GROUP BY ?T1_name   HAVING(count( *)  > (?T24_name))",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/twitter_1__user_profiles/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :user_profiles .\n      ?T1 :user_profiles\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/twitter_1__follows/sparql> {\n    ?T2 a :follows .\n      ?T2 :follows\\#ref-f1 ?T1\n  }\n    }\n  }\n  {\n    SELECT (count( *) as ?aggregation_all) WHERE {\n      SERVICE <http://host.docker.internal:3030/twitter_1__follows/sparql> {\n        ?T23 a :follows . ?T24 a :user_profiles . ?T23 :follows\\#ref-f1 ?T24 . ?T24 :user_profiles\\#name ?T24_name . FILTER(?T24_name = 'Tyler Swift') . }\n      }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  > (?T24_name))",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tweets",
        "url": "http://host.docker.internal:3030/twitter_1__tweets/sparql"
      },
      {
        "class": "http://valuenet/ontop/user_profiles",
        "url": "http://host.docker.internal:3030/twitter_1__user_profiles/sparql"
      },
      {
        "class": "http://valuenet/ontop/follows",
        "url": "http://host.docker.internal:3030/twitter_1__follows/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "twitter_1_2159",
    "kg_name": "twitter_1",
    "split": "train",
    "question": "Find the name and email for the users who have more than one follower.",
    "original_sparql": "SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T2 a :follows . ?T2 :follows\\#ref-f1 ?T1 .  ?T1 :user_profiles\\#name ?T1_name . ?T1 :user_profiles\\#email ?T1_email .        } GROUP BY ?T1_name ?T1_email   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_email WHERE {\n  {\n    SELECT ?T1 ?T1_email ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/twitter_1__user_profiles/sparql> {\n    SELECT DISTINCT ?T1 ?T1_email ?T1_name WHERE {\n      ?T1 a :user_profiles .\n      ?T1 :user_profiles\\#name ?T1_name .\n      ?T1 :user_profiles\\#email ?T1_email\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/twitter_1__follows/sparql> {\n    ?T2 a :follows .\n      ?T2 :follows\\#ref-f1 ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T1_email   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tweets",
        "url": "http://host.docker.internal:3030/twitter_1__tweets/sparql"
      },
      {
        "class": "http://valuenet/ontop/user_profiles",
        "url": "http://host.docker.internal:3030/twitter_1__user_profiles/sparql"
      },
      {
        "class": "http://valuenet/ontop/follows",
        "url": "http://host.docker.internal:3030/twitter_1__follows/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "twitter_1_2160",
    "kg_name": "twitter_1",
    "split": "train",
    "question": "Find the names of users who have more than one tweet.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :tweets\\#ref-uid ?T1 .  ?T1 :user_profiles\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/twitter_1__user_profiles/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :user_profiles .\n      ?T1 :user_profiles\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/twitter_1__tweets/sparql> {\n    ?T2 a :tweets .\n      ?T2 :tweets\\#ref-uid ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tweets",
        "url": "http://host.docker.internal:3030/twitter_1__tweets/sparql"
      },
      {
        "class": "http://valuenet/ontop/user_profiles",
        "url": "http://host.docker.internal:3030/twitter_1__user_profiles/sparql"
      },
      {
        "class": "http://valuenet/ontop/follows",
        "url": "http://host.docker.internal:3030/twitter_1__follows/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "twitter_1_2161",
    "kg_name": "twitter_1",
    "split": "train",
    "question": "Find the id of users who are followed by Mary and Susan.",
    "original_sparql": "SELECT DISTINCT ?T1_f1 WHERE { ?T1 a :follows . ?T2 a :user_profiles . ?T1 :follows\\#ref-f1 ?T2 .  ?T1 :follows\\#f1 ?T1_f1 . ?T2 :user_profiles\\#name ?T2_name . FILTER(?T2_name = 'Mary') . FILTER (?T1_f1 in (?T3_f1)) .   ?T3 a :follows . ?T4 a :user_profiles . ?T3 :follows\\#ref-f1 ?T4 .  ?T3 :follows\\#f1 ?T3_f1 . ?T4 :user_profiles\\#name ?T4_name .  FILTER(?T4_name = 'Susan') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_f1 WHERE {\n  SERVICE <http://host.docker.internal:3030/twitter_1__user_profiles/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name ?T4 ?T4_name WHERE {\n      ?T2 a :user_profiles .\n      ?T2 :user_profiles\\#name ?T2_name .\n      ?T4 a :user_profiles .\n      ?T4 :user_profiles\\#name ?T4_name\n      FILTER(?T2_name = 'Mary')\n      FILTER(?T4_name = 'Susan')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/twitter_1__follows/sparql> {\n    ?T1 a :follows .\n      ?T1 :follows\\#ref-f1 ?T2 .\n      ?T1 :follows\\#f1 ?T1_f1 .\n      ?T3 a :follows .\n      ?T3 :follows\\#ref-f1 ?T4 .\n      ?T3 :follows\\#f1 ?T3_f1\n      FILTER (?T1_f1 in (?T3_f1))\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tweets",
        "url": "http://host.docker.internal:3030/twitter_1__tweets/sparql"
      },
      {
        "class": "http://valuenet/ontop/user_profiles",
        "url": "http://host.docker.internal:3030/twitter_1__user_profiles/sparql"
      },
      {
        "class": "http://valuenet/ontop/follows",
        "url": "http://host.docker.internal:3030/twitter_1__follows/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  }
]