[
  {
    "id": "game_injury_1123",
    "kg_name": "game_injury",
    "split": "train",
    "question": "For each injury accident, find the date of the game and the name of the injured player in the game, and sort the results in descending order of game season.",
    "original_sparql": "SELECT ?T1_date ?T2_player WHERE { ?T1 a :game . ?T2 a :injury_accident . ?T2 :injury_accident\\#ref-game_id ?T1 .  ?T1 :game\\#date ?T1_date . ?T2 :injury_accident\\#player ?T2_player . ?T1 :game\\#season ?T1_season .        }  ORDER BY DESC (?T1_season)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date ?T2_player WHERE {\n  SERVICE <http://host.docker.internal:3030/game_injury__game/sparql> {\n    SELECT DISTINCT ?T1 ?T1_date ?T1_season WHERE {\n      ?T1 a :game .\n      ?T1 :game\\#date ?T1_date .\n      ?T1 :game\\#season ?T1_season\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/game_injury__injury_accident/sparql> {\n    ?T2 a :injury_accident .\n      ?T2 :injury_accident\\#ref-game_id ?T1 .\n      ?T2 :injury_accident\\#player ?T2_player\n  }\n}\nORDER BY DESC (?T1_season)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/injury_accident",
        "url": "http://host.docker.internal:3030/game_injury__injury_accident/sparql"
      },
      {
        "class": "http://valuenet/ontop/game",
        "url": "http://host.docker.internal:3030/game_injury__game/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/game_injury__stadium/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gas_company_1124",
    "kg_name": "gas_company",
    "split": "train",
    "question": "Show the company name with the number of gas station.",
    "original_sparql": "SELECT ?T1_company (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T2 a :station_company . ?T2 :station_company\\#ref-company_id ?T1 .  ?T1 :company\\#company ?T1_company .        } GROUP BY ?T1_company",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_company (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_company ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/gas_company__company/sparql> {\n    SELECT DISTINCT ?T1 ?T1_company WHERE {\n      ?T1 a :company .\n      ?T1 :company\\#company ?T1_company\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gas_company__station_company/sparql> {\n    ?T2 a :station_company .\n      ?T2 :station_company\\#ref-company_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_company",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/company",
        "url": "http://host.docker.internal:3030/gas_company__company/sparql"
      },
      {
        "class": "http://valuenet/ontop/gas_station",
        "url": "http://host.docker.internal:3030/gas_company__gas_station/sparql"
      },
      {
        "class": "http://valuenet/ontop/station_company",
        "url": "http://host.docker.internal:3030/gas_company__station_company/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gas_company_1126",
    "kg_name": "gas_company",
    "split": "train",
    "question": "Show the manager name for gas stations belonging to the ExxonMobil company.",
    "original_sparql": "SELECT ?T1_manager_name WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :station_company\\#ref-station_id ?T1 .  ?T1 :gas_station\\#manager_name ?T1_manager_name . ?T2 :company\\#company ?T2_company . ?T2 a :company . ?T13 :station_company\\#ref-company_id ?T2 .  ?T1 :gas_station\\#manager_name ?T1_manager_name . ?T2 :company\\#company ?T2_company . FILTER(?T2_company = 'ExxonMobil') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_manager_name WHERE {\n  SERVICE <http://host.docker.internal:3030/gas_company__gas_station/sparql> {\n    SELECT DISTINCT ?T1 ?T1_manager_name WHERE {\n      ?T1 a :gas_station .\n      ?T1 :gas_station\\#manager_name ?T1_manager_name .\n      ?T1 :gas_station\\#manager_name ?T1_manager_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gas_company__company/sparql> {\n    SELECT DISTINCT ?T2 ?T2_company WHERE {\n      ?T2 :company\\#company ?T2_company .\n      ?T2 a :company .\n      ?T2 :company\\#company ?T2_company\n      FILTER(?T2_company = 'ExxonMobil')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gas_company__station_company/sparql> {\n    ?T13 a :station_company .\n      ?T13 :station_company\\#ref-station_id ?T1 .\n      ?T13 :station_company\\#ref-company_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/company",
        "url": "http://host.docker.internal:3030/gas_company__company/sparql"
      },
      {
        "class": "http://valuenet/ontop/gas_station",
        "url": "http://host.docker.internal:3030/gas_company__gas_station/sparql"
      },
      {
        "class": "http://valuenet/ontop/station_company",
        "url": "http://host.docker.internal:3030/gas_company__station_company/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gas_company_1128",
    "kg_name": "gas_company",
    "split": "train",
    "question": "Show all locations where a gas station for company with market value greater than 100 is located.",
    "original_sparql": "SELECT ?T1_location WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :station_company\\#ref-station_id ?T1 .  ?T1 :gas_station\\#location ?T1_location . ?T2 :company\\#market_value ?T2_market_value . ?T2 a :company . ?T13 :station_company\\#ref-company_id ?T2 .  ?T1 :gas_station\\#location ?T1_location . ?T2 :company\\#market_value ?T2_market_value . FILTER(?T2_market_value > 100) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_location WHERE {\n  SERVICE <http://host.docker.internal:3030/gas_company__gas_station/sparql> {\n    SELECT DISTINCT ?T1 ?T1_location WHERE {\n      ?T1 a :gas_station .\n      ?T1 :gas_station\\#location ?T1_location .\n      ?T1 :gas_station\\#location ?T1_location\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gas_company__company/sparql> {\n    SELECT DISTINCT ?T2 ?T2_market_value WHERE {\n      ?T2 :company\\#market_value ?T2_market_value .\n      ?T2 a :company .\n      ?T2 :company\\#market_value ?T2_market_value\n      FILTER(?T2_market_value > 100)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gas_company__station_company/sparql> {\n    ?T13 a :station_company .\n      ?T13 :station_company\\#ref-station_id ?T1 .\n      ?T13 :station_company\\#ref-company_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/company",
        "url": "http://host.docker.internal:3030/gas_company__company/sparql"
      },
      {
        "class": "http://valuenet/ontop/gas_station",
        "url": "http://host.docker.internal:3030/gas_company__gas_station/sparql"
      },
      {
        "class": "http://valuenet/ontop/station_company",
        "url": "http://host.docker.internal:3030/gas_company__station_company/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gas_company_1130",
    "kg_name": "gas_company",
    "split": "train",
    "question": "find the location and Representative name of the gas stations owned by the companies with top 3 Asset amounts.",
    "original_sparql": "SELECT ?T1_location ?T1_representative_name WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :station_company\\#ref-station_id ?T1 .  ?T1 :gas_station\\#location ?T1_location . ?T1 :gas_station\\#representative_name ?T1_representative_name . ?T2 :company\\#assets_billion ?T2_assets_billion . ?T2 a :company . ?T13 :station_company\\#ref-company_id ?T2 .  ?T1 :gas_station\\#location ?T1_location . ?T1 :gas_station\\#representative_name ?T1_representative_name . ?T2 :company\\#assets_billion ?T2_assets_billion .        }   ORDER BY DESC (?T2_assets_billion) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_location ?T1_representative_name WHERE {\n  SERVICE <http://host.docker.internal:3030/gas_company__gas_station/sparql> {\n    SELECT DISTINCT ?T1 ?T1_location ?T1_representative_name WHERE {\n      ?T1 a :gas_station .\n      ?T1 :gas_station\\#location ?T1_location .\n      ?T1 :gas_station\\#representative_name ?T1_representative_name .\n      ?T1 :gas_station\\#location ?T1_location .\n      ?T1 :gas_station\\#representative_name ?T1_representative_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gas_company__company/sparql> {\n    SELECT DISTINCT ?T2 ?T2_assets_billion WHERE {\n      ?T2 :company\\#assets_billion ?T2_assets_billion .\n      ?T2 a :company .\n      ?T2 :company\\#assets_billion ?T2_assets_billion\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gas_company__station_company/sparql> {\n    ?T13 a :station_company .\n      ?T13 :station_company\\#ref-station_id ?T1 .\n      ?T13 :station_company\\#ref-company_id ?T2\n  }\n}\nORDER BY DESC (?T2_assets_billion) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/company",
        "url": "http://host.docker.internal:3030/gas_company__company/sparql"
      },
      {
        "class": "http://valuenet/ontop/gas_station",
        "url": "http://host.docker.internal:3030/gas_company__gas_station/sparql"
      },
      {
        "class": "http://valuenet/ontop/station_company",
        "url": "http://host.docker.internal:3030/gas_company__station_company/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gymnast_1133",
    "kg_name": "gymnast",
    "split": "train",
    "question": "Return the total points of the gymnast with the lowest age.",
    "original_sparql": "SELECT ?T1_total_points WHERE { ?T1 a :gymnast . ?T2 a :people . ?T1 :gymnast\\#ref-gymnast_id ?T2 .  ?T1 :gymnast\\#total_points ?T1_total_points . ?T2 :people\\#age ?T2_age .        }   ORDER BY ASC (?T2_age) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_total_points WHERE {\n  SERVICE <http://host.docker.internal:3030/gymnast__people/sparql> {\n    SELECT DISTINCT ?T2 ?T2_age WHERE {\n      ?T2 a :people .\n      ?T2 :people\\#age ?T2_age\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gymnast__gymnast/sparql> {\n    ?T1 a :gymnast .\n      ?T1 :gymnast\\#ref-gymnast_id ?T2 .\n      ?T1 :gymnast\\#total_points ?T1_total_points\n  }\n}\nORDER BY ASC (?T2_age) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/gymnast",
        "url": "http://host.docker.internal:3030/gymnast__gymnast/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/gymnast__people/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gymnast_1135",
    "kg_name": "gymnast",
    "split": "train",
    "question": "Give the different hometowns of gymnasts that have a total point score of above 57.5.",
    "original_sparql": "SELECT DISTINCT ?T1_hometown WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\\#ref-gymnast_id ?T1 .  ?T1 :people\\#hometown ?T1_hometown . ?T2 :gymnast\\#total_points ?T2_total_points . FILTER(?T2_total_points > 57.5) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_hometown WHERE {\n  SERVICE <http://host.docker.internal:3030/gymnast__people/sparql> {\n    SELECT DISTINCT ?T1 ?T1_hometown WHERE {\n      ?T1 a :people .\n      ?T1 :people\\#hometown ?T1_hometown\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gymnast__gymnast/sparql> {\n    ?T2 a :gymnast .\n      ?T2 :gymnast\\#ref-gymnast_id ?T1 .\n      ?T2 :gymnast\\#total_points ?T2_total_points\n      FILTER(?T2_total_points > 57.5)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/gymnast",
        "url": "http://host.docker.internal:3030/gymnast__gymnast/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/gymnast__people/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gymnast_1139",
    "kg_name": "gymnast",
    "split": "train",
    "question": "Return the hometown that is most common among gymnasts.",
    "original_sparql": "SELECT ?T1_hometown (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\\#ref-gymnast_id ?T1 .  ?T1 :people\\#hometown ?T1_hometown .        } GROUP BY ?T1_hometown  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_hometown (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_hometown ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/gymnast__people/sparql> {\n    SELECT DISTINCT ?T1 ?T1_hometown WHERE {\n      ?T1 a :people .\n      ?T1 :people\\#hometown ?T1_hometown\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gymnast__gymnast/sparql> {\n    ?T2 a :gymnast .\n      ?T2 :gymnast\\#ref-gymnast_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_hometown  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/gymnast",
        "url": "http://host.docker.internal:3030/gymnast__gymnast/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/gymnast__people/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "gymnast_1142",
    "kg_name": "gymnast",
    "split": "train",
    "question": "Show the ages of gymnasts in descending order of total points.",
    "original_sparql": "SELECT ?T1_age WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\\#ref-gymnast_id ?T1 .  ?T1 :people\\#age ?T1_age . ?T2 :gymnast\\#total_points ?T2_total_points .        }  ORDER BY DESC (?T2_total_points)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_age WHERE {\n  SERVICE <http://host.docker.internal:3030/gymnast__people/sparql> {\n    SELECT DISTINCT ?T1 ?T1_age WHERE {\n      ?T1 a :people .\n      ?T1 :people\\#age ?T1_age\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/gymnast__gymnast/sparql> {\n    ?T2 a :gymnast .\n      ?T2 :gymnast\\#ref-gymnast_id ?T1 .\n      ?T2 :gymnast\\#total_points ?T2_total_points\n  }\n}\nORDER BY DESC (?T2_total_points)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/gymnast",
        "url": "http://host.docker.internal:3030/gymnast__gymnast/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/gymnast__people/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1145",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the name and position of the head of the department with the least employees.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_position WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :department\\#ref-head ?T1 .  ?T1 :physician\\#name ?T1_name . ?T1 :physician\\#position ?T1_position . ?T2 :department\\#departmentid ?T2_departmentid .        } GROUP BY ?T1_name ?T1_position  ORDER BY ASC ((count( ?T2_departmentid) as ?aggregation_T2_departmentid_184 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) ?T1_position WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T1_position ?T2 ?T2_departmentid WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T1_position WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name .\n      ?T1 :physician\\#position ?T1_position\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__department/sparql> {\n    ?T2 a :department .\n      ?T2 :department\\#ref-head ?T1 .\n      ?T2 :department\\#departmentid ?T2_departmentid\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T1_position  ORDER BY ASC ((count( ?T2_departmentid) as ?aggregation_T2_departmentid_184 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "hospital_1_1147",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Which patients made more than one appointment? Tell me the name and phone number of these patients.",
    "original_sparql": "SELECT ?T1_name ?T1_phone WHERE { ?T1 a :patient . ?T2 a :appointment . ?T2 :appointment\\#ref-patient ?T1 .  ?T1 :patient\\#name ?T1_name . ?T1 :patient\\#phone ?T1_phone .        } GROUP BY ?T1_name ?T1_phone   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_phone WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T1_phone ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__patient/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T1_phone WHERE {\n      ?T1 a :patient .\n      ?T1 :patient\\#name ?T1_name .\n      ?T1 :patient\\#phone ?T1_phone\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__appointment/sparql> {\n    ?T2 a :appointment .\n      ?T2 :appointment\\#ref-patient ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T1_phone   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1148",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the names of all physicians and their primary affiliated departments' names.",
    "original_sparql": "SELECT ?t1_name ?t3_name WHERE {?t1 a :physician . ?t2 a :affiliated_with . ?t3 a :department . ?t1 :physician\\#ref-employeeid ?t2 . ?t2 :affiliated_with\\#ref-department ?t3 . ?t2 :affiliated_with\\#primaryaffiliation ?t2_primaryaffiliation .    FILTER (?t2_primary_affiliation =True)}",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?t1_name ?t3_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__affiliated_with/sparql> {\n    SELECT DISTINCT ?t2 ?t2_primary_affiliation ?t2_primaryaffiliation ?t3 WHERE {\n      ?t2 a :affiliated_with .\n      ?t2 :affiliated_with\\#ref-department ?t3 .\n      ?t2 :affiliated_with\\#primaryaffiliation ?t2_primaryaffiliation\n      FILTER (?t2_primary_affiliation =True)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__department/sparql> {\n    SELECT DISTINCT ?t3 WHERE {\n      ?t3 a :department\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    ?t1 a :physician .\n      ?t1 :physician\\#ref-employeeid ?t2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1151",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the name of the patient who made the appointment with the most recent start date.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :patient . ?T2 a :appointment . ?T2 :appointment\\#ref-patient ?T1 .  ?T1 :patient\\#name ?T1_name . ?T2 :appointment\\#start ?T2_start .        }   ORDER BY DESC (?T2_start) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__patient/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :patient .\n      ?T1 :patient\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__appointment/sparql> {\n    ?T2 a :appointment .\n      ?T2 :appointment\\#ref-patient ?T1 .\n      ?T2 :appointment\\#start ?T2_start\n  }\n}\nORDER BY DESC (?T2_start) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]