[
  {
    "id": "assets_maintenance_102",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "How many assets does each maintenance contract contain? List the number and the contract id.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_maintenance_contract_id WHERE { ?T1 a :assets . ?T2 a :maintenance_contracts . ?T1 :assets\\#ref-maintenance_contract_id ?T2 .  ?T2 :maintenance_contracts\\#maintenance_contract_id ?T2_maintenance_contract_id .        } GROUP BY ?T2_maintenance_contract_id",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_maintenance_contract_id WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_maintenance_contract_id WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql> {\n    SELECT DISTINCT ?T2 ?T2_maintenance_contract_id WHERE {\n      ?T2 a :maintenance_contracts .\n      ?T2 :maintenance_contracts\\#maintenance_contract_id ?T2_maintenance_contract_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__assets/sparql> {\n    ?T1 a :assets .\n      ?T1 :assets\\#ref-maintenance_contract_id ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_maintenance_contract_id",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 10,
      "federated_count": 10,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_103",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "How many assets does each third party company supply? List the count and the company id.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_company_id WHERE { ?T13 a :maintenance_contracts . ?T2 a :third_party_companies . ?T13 :maintenance_contracts\\#ref-maintenance_contract_company_id ?T2 .  ?T2 :third_party_companies\\#company_id ?T2_company_id .        } GROUP BY ?T2_company_id",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_company_id WHERE {\n  {\n    SELECT ?T13 ?T2 ?T2_company_id WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql> {\n    SELECT DISTINCT ?T2 ?T2_company_id WHERE {\n      ?T2 a :third_party_companies .\n      ?T2 :third_party_companies\\#company_id ?T2_company_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql> {\n    ?T13 a :maintenance_contracts .\n      ?T13 :maintenance_contracts\\#ref-maintenance_contract_company_id ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_company_id",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 10,
      "federated_count": 10,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_104",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which engineer has visited the most times? Show the engineer id, first name and last name.",
    "original_sparql": "SELECT ?T1_engineer_id (count( *) as ?aggregation_all) ?T1_first_name ?T1_last_name WHERE { ?T1 a :maintenance_engineers . ?T2 a :engineer_visits . ?T2 :engineer_visits\\#ref-engineer_id ?T1 .  ?T1 :maintenance_engineers\\#engineer_id ?T1_engineer_id . ?T1 :maintenance_engineers\\#first_name ?T1_first_name . ?T1 :maintenance_engineers\\#last_name ?T1_last_name .        } GROUP BY ?T1_engineer_id ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_engineer_id (count( *) as ?aggregation_all) ?T1_first_name ?T1_last_name WHERE {\n  {\n    SELECT ?T1 ?T1_engineer_id ?T1_first_name ?T1_last_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_engineer_id ?T1_first_name ?T1_last_name WHERE {\n      ?T1 a :maintenance_engineers .\n      ?T1 :maintenance_engineers\\#engineer_id ?T1_engineer_id .\n      ?T1 :maintenance_engineers\\#first_name ?T1_first_name .\n      ?T1 :maintenance_engineers\\#last_name ?T1_last_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql> {\n    ?T2 a :engineer_visits .\n      ?T2 :engineer_visits\\#ref-engineer_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_engineer_id ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_105",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which parts have more than 2 faults? Show the part name and id.",
    "original_sparql": "SELECT ?T1_part_name ?T1_part_id WHERE { ?T1 a :parts . ?T2 a :part_faults . ?T2 :part_faults\\#ref-part_id ?T1 .  ?T1 :parts\\#part_name ?T1_part_name . ?T1 :parts\\#part_id ?T1_part_id .        } GROUP BY ?T1_part_name ?T1_part_id   HAVING(count( *)  > 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_part_name ?T1_part_id WHERE {\n  {\n    SELECT ?T1 ?T1_part_id ?T1_part_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__parts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_part_id ?T1_part_name WHERE {\n      ?T1 a :parts .\n      ?T1 :parts\\#part_name ?T1_part_name .\n      ?T1 :parts\\#part_id ?T1_part_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__part_faults/sparql> {\n    ?T2 a :part_faults .\n      ?T2 :part_faults\\#ref-part_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_part_name ?T1_part_id   HAVING(count( *)  > 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_106",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "List all every engineer's first name, last name, details and coresponding skill description.",
    "original_sparql": "SELECT ?T1_first_name ?T1_last_name ?T1_other_details ?T2_skill_description WHERE { ?T1 a :maintenance_engineers . ?T13 a :engineer_skills . ?T13 :engineer_skills\\#ref-engineer_id ?T1 .  ?T1 :maintenance_engineers\\#first_name ?T1_first_name . ?T1 :maintenance_engineers\\#last_name ?T1_last_name . ?T1 :maintenance_engineers\\#other_details ?T1_other_details . ?T2 :skills\\#skill_description ?T2_skill_description . ?T2 a :skills . ?T13 :engineer_skills\\#ref-skill_id ?T2 .  ?T1 :maintenance_engineers\\#first_name ?T1_first_name . ?T1 :maintenance_engineers\\#last_name ?T1_last_name . ?T1 :maintenance_engineers\\#other_details ?T1_other_details . ?T2 :skills\\#skill_description ?T2_skill_description .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name ?T1_last_name ?T1_other_details ?T2_skill_description WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_first_name ?T1_last_name ?T1_other_details WHERE {\n      ?T1 a :maintenance_engineers .\n      ?T1 :maintenance_engineers\\#first_name ?T1_first_name .\n      ?T1 :maintenance_engineers\\#last_name ?T1_last_name .\n      ?T1 :maintenance_engineers\\#other_details ?T1_other_details .\n      ?T1 :maintenance_engineers\\#first_name ?T1_first_name .\n      ?T1 :maintenance_engineers\\#last_name ?T1_last_name .\n      ?T1 :maintenance_engineers\\#other_details ?T1_other_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__skills/sparql> {\n    SELECT DISTINCT ?T2 ?T2_skill_description WHERE {\n      ?T2 :skills\\#skill_description ?T2_skill_description .\n      ?T2 a :skills .\n      ?T2 :skills\\#skill_description ?T2_skill_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql> {\n    ?T13 a :engineer_skills .\n      ?T13 :engineer_skills\\#ref-engineer_id ?T1 .\n      ?T13 :engineer_skills\\#ref-skill_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_108",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "How many assets can each parts be used in? List the part name and the number.",
    "original_sparql": "SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a :parts . ?T2 a :asset_parts . ?T2 :asset_parts\\#ref-part_id ?T1 .  ?T1 :parts\\#part_name ?T1_part_name .        } GROUP BY ?T1_part_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_part_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__parts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_part_name WHERE {\n      ?T1 a :parts .\n      ?T1 :parts\\#part_name ?T1_part_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql> {\n    ?T2 a :asset_parts .\n      ?T2 :asset_parts\\#ref-part_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_part_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 3,
      "federated_count": 3,
      "missing": 3,
      "extra": 3,
      "error": "result_mismatch"
    }
  },
  {
    "id": "assets_maintenance_110",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "How many engineer visits are required at most for a single fault log? List the number and the log entry id.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_fault_log_entry_id WHERE { ?T1 a :engineer_visits . ?T2 a :fault_log . ?T1 :engineer_visits\\#ref-fault_log_entry_id ?T2 .  ?T2 :fault_log\\#fault_log_entry_id ?T2_fault_log_entry_id .        } GROUP BY ?T2_fault_log_entry_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_fault_log_entry_id WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_fault_log_entry_id WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__fault_log/sparql> {\n    SELECT DISTINCT ?T2 ?T2_fault_log_entry_id WHERE {\n      ?T2 a :fault_log .\n      ?T2 :fault_log\\#fault_log_entry_id ?T2_fault_log_entry_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql> {\n    ?T1 a :engineer_visits .\n      ?T1 :engineer_visits\\#ref-fault_log_entry_id ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_fault_log_entry_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "assets_maintenance_111",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which kind of part has the least number of faults? List the part name.",
    "original_sparql": "SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a :parts . ?T2 a :part_faults . ?T2 :part_faults\\#ref-part_id ?T1 .  ?T1 :parts\\#part_name ?T1_part_name .        } GROUP BY ?T1_part_name  ORDER BY ASC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_part_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__parts/sparql> {\n    SELECT DISTINCT ?T1 ?T1_part_name WHERE {\n      ?T1 a :parts .\n      ?T1 :parts\\#part_name ?T1_part_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__part_faults/sparql> {\n    ?T2 a :part_faults .\n      ?T2 :part_faults\\#ref-part_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_part_name  ORDER BY ASC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]