[
  {
    "id": "hospital_1_1176",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "List the names of departments where some physicians are primarily affiliated with.",
    "original_sparql": "SELECT ?t2_name WHERE {?t1 a :affiliated_with . ?t1 :affiliated_with\\#primaryaffiliation ?t1_primaryaffiliation. ?t2 a :department . ?t1 :affiliated_with\\#ref-department ?t2 . ?t2 :department\\#name ?t2_name . FILTER (?t1_primaryaffiliation  =  True)}",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?t2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__department/sparql> {\n    SELECT DISTINCT ?t2 ?t2_name WHERE {\n      ?t2 a :department .\n      ?t2 :department\\#name ?t2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__affiliated_with/sparql> {\n    ?t1 a :affiliated_with .\n      ?t1 :affiliated_with\\#primaryaffiliation ?t1_primaryaffiliation .\n      ?t1 :affiliated_with\\#ref-department ?t2\n      FILTER (?t1_primaryaffiliation  =  True)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1178",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the physicians who are trained in a procedure that costs more than 5000.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :physician . ?T13 a :trained_in . ?T13 :trained_in\\#ref-physician ?T1 .  ?T1 :physician\\#name ?T1_name . ?T2 :procedures\\#cost ?T2_cost . ?T2 a :procedures . ?T13 :trained_in\\#ref-treatment ?T2 .  ?T1 :physician\\#name ?T1_name . ?T2 :procedures\\#cost ?T2_cost . FILTER(?T2_cost > 5000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name .\n      ?T1 :physician\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__procedures/sparql> {\n    SELECT DISTINCT ?T2 ?T2_cost WHERE {\n      ?T2 :procedures\\#cost ?T2_cost .\n      ?T2 a :procedures .\n      ?T2 :procedures\\#cost ?T2_cost\n      FILTER(?T2_cost > 5000)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__trained_in/sparql> {\n    ?T13 a :trained_in .\n      ?T13 :trained_in\\#ref-physician ?T1 .\n      ?T13 :trained_in\\#ref-treatment ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1181",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Which physician was trained in the procedure that costs the most.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :physician . ?T13 a :trained_in . ?T13 :trained_in\\#ref-physician ?T1 .  ?T1 :physician\\#name ?T1_name . ?T2 :procedures\\#cost ?T2_cost . ?T2 a :procedures . ?T13 :trained_in\\#ref-treatment ?T2 .  ?T1 :physician\\#name ?T1_name . ?T2 :procedures\\#cost ?T2_cost .        }   ORDER BY DESC (?T2_cost) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name .\n      ?T1 :physician\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__procedures/sparql> {\n    SELECT DISTINCT ?T2 ?T2_cost WHERE {\n      ?T2 :procedures\\#cost ?T2_cost .\n      ?T2 a :procedures .\n      ?T2 :procedures\\#cost ?T2_cost\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__trained_in/sparql> {\n    ?T13 a :trained_in .\n      ?T13 :trained_in\\#ref-physician ?T1 .\n      ?T13 :trained_in\\#ref-treatment ?T2\n  }\n}\nORDER BY DESC (?T2_cost) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1183",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Compute the mean price of procedures physician John Wen was trained in.",
    "original_sparql": "SELECT (avg( ?T1_cost) as ?aggregation_T1_cost_43 ) WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :trained_in\\#ref-treatment ?T1 .  ?T1 :procedures\\#cost ?T1_cost . ?T2 :physician\\#name ?T2_name . ?T2 a :physician . ?T13 :trained_in\\#ref-physician ?T2 .  ?T1 :procedures\\#cost ?T1_cost . ?T2 :physician\\#name ?T2_name . FILTER(?T2_name = 'John Wen') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_cost) as ?aggregation_T1_cost_43 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_cost ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__procedures/sparql> {\n    SELECT DISTINCT ?T1 ?T1_cost WHERE {\n      ?T1 a :procedures .\n      ?T1 :procedures\\#cost ?T1_cost .\n      ?T1 :procedures\\#cost ?T1_cost\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :physician\\#name ?T2_name .\n      ?T2 a :physician .\n      ?T2 :physician\\#name ?T2_name\n      FILTER(?T2_name = 'John Wen')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__trained_in/sparql> {\n    ?T13 a :trained_in .\n      ?T13 :trained_in\\#ref-treatment ?T1 .\n      ?T13 :trained_in\\#ref-physician ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1184",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the names of procedures which physician John Wen was trained in.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :trained_in\\#ref-treatment ?T1 .  ?T1 :procedures\\#name ?T1_name . ?T2 :physician\\#name ?T2_name . ?T2 a :physician . ?T13 :trained_in\\#ref-physician ?T2 .  ?T1 :procedures\\#name ?T1_name . ?T2 :physician\\#name ?T2_name . FILTER(?T2_name = 'John Wen') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__procedures/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :procedures .\n      ?T1 :procedures\\#name ?T1_name .\n      ?T1 :procedures\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 :physician\\#name ?T2_name .\n      ?T2 a :physician .\n      ?T2 :physician\\#name ?T2_name\n      FILTER(?T2_name = 'John Wen')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__trained_in/sparql> {\n    ?T13 a :trained_in .\n      ?T13 :trained_in\\#ref-treatment ?T1 .\n      ?T13 :trained_in\\#ref-physician ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1186",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the names of all procedures such that the cost is less than 5000 and physician John Wen was trained in.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :procedures . ?T1 :procedures\\#name ?T1_name . ?T1 :procedures\\#cost ?T1_cost . FILTER(?T1_cost < 5000) . FILTER (?T1_name in (?T2_name)) .   ?T2 a :procedures . ?T14 a :trained_in . ?T14 :trained_in\\#ref-treatment ?T2 .  ?T2 :procedures\\#name ?T2_name . ?T3 :physician\\#name ?T3_name . ?T3 a :physician . ?T14 :trained_in\\#ref-physician ?T3 .  ?T2 :procedures\\#name ?T2_name . ?T3 :physician\\#name ?T3_name .  FILTER(?T3_name = 'John Wen') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__procedures/sparql> {\n    SELECT DISTINCT ?T1 ?T1_cost ?T1_name ?T2 ?T2_name WHERE {\n      ?T1 a :procedures .\n      ?T1 :procedures\\#name ?T1_name .\n      ?T1 :procedures\\#cost ?T1_cost .\n      ?T2 a :procedures .\n      ?T2 :procedures\\#name ?T2_name .\n      ?T2 :procedures\\#name ?T2_name\n      FILTER(?T1_cost < 5000)\n      FILTER (?T1_name in (?T2_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T3 ?T3_name WHERE {\n      ?T3 :physician\\#name ?T3_name .\n      ?T3 a :physician .\n      ?T3 :physician\\#name ?T3_name\n      FILTER(?T3_name = 'John Wen')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__trained_in/sparql> {\n    ?T14 a :trained_in .\n      ?T14 :trained_in\\#ref-treatment ?T2 .\n      ?T14 :trained_in\\#ref-physician ?T3\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1188",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the name of physicians who are affiliated with both Surgery and Psychiatry departments.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :department\\#ref-head ?T1 .  ?T1 :physician\\#name ?T1_name . ?T2 :department\\#name ?T2_name . FILTER(?T2_name = 'Surgery') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :physician . ?T4 a :department . ?T4 :department\\#ref-head ?T3 .  ?T3 :physician\\#name ?T3_name . ?T4 :department\\#name ?T4_name .  FILTER(?T4_name = 'Psychiatry') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T3 ?T3_name WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name .\n      ?T3 a :physician .\n      ?T3 :physician\\#name ?T3_name\n      FILTER (?T1_name in (?T3_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__department/sparql> {\n    ?T2 a :department .\n      ?T2 :department\\#ref-head ?T1 .\n      ?T2 :department\\#name ?T2_name .\n      ?T4 a :department .\n      ?T4 :department\\#ref-head ?T3 .\n      ?T4 :department\\#name ?T4_name\n      FILTER(?T2_name = 'Surgery')\n      FILTER(?T4_name = 'Psychiatry')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1190",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the name of physicians who are affiliated with Surgery or Psychiatry department.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :department\\#ref-head ?T1 .  ?T1 :physician\\#name ?T1_name . ?T2 :department\\#name ?T2_name . ?T2 :department\\#name ?T2_name . FILTER(?T2_name = 'Surgery' || ?T2_name = 'Psychiatry') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__department/sparql> {\n    ?T2 a :department .\n      ?T2 :department\\#ref-head ?T1 .\n      ?T2 :department\\#name ?T2_name .\n      ?T2 :department\\#name ?T2_name\n      FILTER(?T2_name = 'Surgery' || ?T2_name = 'Psychiatry')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hr_1_1192",
    "kg_name": "hr_1",
    "split": "train",
    "question": "Display the first name and department name for each employee.",
    "original_sparql": "SELECT ?T1_first_name ?T2_department_name WHERE { ?T1 a :employees . ?T2 a :departments . ?T1 :employees\\#ref-department_id ?T2 .  ?T1 :employees\\#first_name ?T1_first_name . ?T2 :departments\\#department_name ?T2_department_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name ?T2_department_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hr_1__departments/sparql> {\n    SELECT DISTINCT ?T2 ?T2_department_name WHERE {\n      ?T2 a :departments .\n      ?T2 :departments\\#department_name ?T2_department_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hr_1__employees/sparql> {\n    ?T1 a :employees .\n      ?T1 :employees\\#ref-department_id ?T2 .\n      ?T1 :employees\\#first_name ?T1_first_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/hr_1__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/hr_1__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/countries",
        "url": "http://host.docker.internal:3030/hr_1__countries/sparql"
      },
      {
        "class": "http://valuenet/ontop/departments",
        "url": "http://host.docker.internal:3030/hr_1__departments/sparql"
      },
      {
        "class": "http://valuenet/ontop/jobs",
        "url": "http://host.docker.internal:3030/hr_1__jobs/sparql"
      },
      {
        "class": "http://valuenet/ontop/regions",
        "url": "http://host.docker.internal:3030/hr_1__regions/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 101,
      "federated_count": 101,
      "missing": 0,
      "extra": 0
    }
  }
]