[
  {
    "id": "cre_docs_and_epenses_567",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Give the details of the project with the document name 'King Book'.",
    "original_sparql": "SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :documents . ?T2 :documents\\#ref-project_id ?T1 .  ?T1 :projects\\#project_details ?T1_project_details . ?T2 :documents\\#document_name ?T2_document_name . FILTER(?T2_document_name = 'King Book') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_project_details WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql> {\n    SELECT DISTINCT ?T1 ?T1_project_details WHERE {\n      ?T1 a :projects .\n      ?T1 :projects\\#project_details ?T1_project_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql> {\n    ?T2 a :documents .\n      ?T2 :documents\\#ref-project_id ?T1 .\n      ?T2 :documents\\#document_name ?T2_document_name\n      FILTER(?T2_document_name = 'King Book')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_568",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Show the budget type code and description and the corresponding document id.",
    "original_sparql": "SELECT ?T1_budget_type_code ?T1_budget_type_description ?T2_document_id WHERE { ?T1 a :ref_budget_codes . ?T2 a :documents_with_expenses . ?T2 :documents_with_expenses\\#ref-budget_type_code ?T1 .  ?T1 :ref_budget_codes\\#budget_type_code ?T1_budget_type_code . ?T1 :ref_budget_codes\\#budget_type_description ?T1_budget_type_description . ?T2 :documents_with_expenses\\#document_id ?T2_document_id .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_budget_type_code ?T1_budget_type_description ?T2_document_id WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql> {\n    SELECT DISTINCT ?T1 ?T1_budget_type_code ?T1_budget_type_description WHERE {\n      ?T1 a :ref_budget_codes .\n      ?T1 :ref_budget_codes\\#budget_type_code ?T1_budget_type_code .\n      ?T1 :ref_budget_codes\\#budget_type_description ?T1_budget_type_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql> {\n    ?T2 a :documents_with_expenses .\n      ?T2 :documents_with_expenses\\#ref-budget_type_code ?T1 .\n      ?T2 :documents_with_expenses\\#document_id ?T2_document_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 10,
      "federated_count": 10,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_570",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Show ids for all documents with budget types described as 'Government'.",
    "original_sparql": "SELECT ?T1_document_id WHERE { ?T1 a :documents_with_expenses . ?T2 a :ref_budget_codes . ?T1 :documents_with_expenses\\#ref-budget_type_code ?T2 .  ?T1 :documents_with_expenses\\#document_id ?T1_document_id . ?T2 :ref_budget_codes\\#budget_type_description ?T2_budget_type_description . FILTER(?T2_budget_type_description = 'Government') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_document_id WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql> {\n    SELECT DISTINCT ?T2 ?T2_budget_type_description WHERE {\n      ?T2 a :ref_budget_codes .\n      ?T2 :ref_budget_codes\\#budget_type_description ?T2_budget_type_description\n      FILTER(?T2_budget_type_description = 'Government')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql> {\n    ?T1 a :documents_with_expenses .\n      ?T1 :documents_with_expenses\\#ref-budget_type_code ?T2 .\n      ?T1 :documents_with_expenses\\#document_id ?T1_document_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_573",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Give the dates of creation for documents that have both budget type codes 'GV' and 'SF'.",
    "original_sparql": "SELECT DISTINCT ?T1_document_date WHERE { ?T1 a :documents . ?T2 a :documents_with_expenses . ?T2 :documents_with_expenses\\#ref-document_id ?T1 .  ?T1 :documents\\#document_date ?T1_document_date . ?T2 :documents_with_expenses\\#budget_type_code ?T2_budget_type_code . FILTER(?T2_budget_type_code = 'GV') . FILTER (?T1_document_date in (?T3_document_date)) .   ?T3 a :documents . ?T4 a :documents_with_expenses . ?T4 :documents_with_expenses\\#ref-document_id ?T3 .  ?T3 :documents\\#document_date ?T3_document_date . ?T4 :documents_with_expenses\\#budget_type_code ?T4_budget_type_code .  FILTER(?T4_budget_type_code = 'SF') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_document_date WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql> {\n    SELECT DISTINCT ?T1 ?T1_document_date ?T3 ?T3_document_date WHERE {\n      ?T1 a :documents .\n      ?T1 :documents\\#document_date ?T1_document_date .\n      ?T3 a :documents .\n      ?T3 :documents\\#document_date ?T3_document_date\n      FILTER (?T1_document_date in (?T3_document_date))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql> {\n    ?T2 a :documents_with_expenses .\n      ?T2 :documents_with_expenses\\#ref-document_id ?T1 .\n      ?T2 :documents_with_expenses\\#budget_type_code ?T2_budget_type_code .\n      ?T4 a :documents_with_expenses .\n      ?T4 :documents_with_expenses\\#ref-document_id ?T3 .\n      ?T4 :documents_with_expenses\\#budget_type_code ?T4_budget_type_code\n      FILTER(?T2_budget_type_code = 'GV')\n      FILTER(?T4_budget_type_code = 'SF')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_575",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Find the city the store named 'FJA Filming' is in.",
    "original_sparql": "SELECT ?T1_city_town WHERE { ?T1 a :addresses . ?T2 a :stores . ?T2 :stores\\#ref-address_id ?T1 .  ?T1 :addresses\\#city_town ?T1_city_town . ?T2 :stores\\#store_name ?T2_store_name . FILTER(?T2_store_name = 'FJA Filming') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_city_town WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql> {\n    SELECT DISTINCT ?T1 ?T1_city_town WHERE {\n      ?T1 a :addresses .\n      ?T1 :addresses\\#city_town ?T1_city_town\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql> {\n    ?T2 a :stores .\n      ?T2 :stores\\#ref-address_id ?T1 .\n      ?T2 :stores\\#store_name ?T2_store_name\n      FILTER(?T2_store_name = 'FJA Filming')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_577",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Find the states or counties where the stores with marketing region code 'CA' are located.",
    "original_sparql": "SELECT ?T1_state_county WHERE { ?T1 a :addresses . ?T2 a :stores . ?T2 :stores\\#ref-address_id ?T1 .  ?T1 :addresses\\#state_county ?T1_state_county . ?T2 :stores\\#marketing_region_code ?T2_marketing_region_code . FILTER(?T2_marketing_region_code = 'CA') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_state_county WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql> {\n    SELECT DISTINCT ?T1 ?T1_state_county WHERE {\n      ?T1 a :addresses .\n      ?T1 :addresses\\#state_county ?T1_state_county\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql> {\n    ?T2 a :stores .\n      ?T2 :stores\\#ref-address_id ?T1 .\n      ?T2 :stores\\#marketing_region_code ?T2_marketing_region_code\n      FILTER(?T2_marketing_region_code = 'CA')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_579",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Return the name of the marketing region the store Rob Dinning is located in.",
    "original_sparql": "SELECT ?T1_marketing_region_name WHERE { ?T1 a :marketing_regions . ?T2 a :stores . ?T2 :stores\\#ref-marketing_region_code ?T1 .  ?T1 :marketing_regions\\#marketing_region_name ?T1_marketing_region_name . ?T2 :stores\\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Rob Dinning') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_marketing_region_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql> {\n    SELECT DISTINCT ?T1 ?T1_marketing_region_name WHERE {\n      ?T1 a :marketing_regions .\n      ?T1 :marketing_regions\\#marketing_region_name ?T1_marketing_region_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql> {\n    ?T2 a :stores .\n      ?T2 :stores\\#ref-marketing_region_code ?T1 .\n      ?T2 :stores\\#store_name ?T2_store_name\n      FILTER(?T2_store_name = 'Rob Dinning')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_581",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Give me the descriptions of the service types that cost more than 100.",
    "original_sparql": "SELECT ?T1_service_type_description WHERE { ?T1 a :ref_service_types . ?T2 a :services . ?T2 :services\\#ref-service_type_code ?T1 .  ?T1 :ref_service_types\\#service_type_description ?T1_service_type_description . ?T2 :services\\#product_price ?T2_product_price . FILTER(?T2_product_price > 100) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_service_type_description WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql> {\n    SELECT DISTINCT ?T1 ?T1_service_type_description WHERE {\n      ?T1 a :ref_service_types .\n      ?T1 :ref_service_types\\#service_type_description ?T1_service_type_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql> {\n    ?T2 a :services .\n      ?T2 :services\\#ref-service_type_code ?T1 .\n      ?T2 :services\\#product_price ?T2_product_price\n      FILTER(?T2_product_price > 100)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  }
]