[
  {
    "id": "cre_drama_workshop_groups_599",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "List the email addresses of the drama workshop groups located in Alaska state.",
    "original_sparql": "SELECT ?T1_store_email_address WHERE { ?T1 a :drama_workshop_groups . ?T2 a :addresses . ?T1 :drama_workshop_groups\\#ref-address_id ?T2 .  ?T1 :drama_workshop_groups\\#store_email_address ?T1_store_email_address . ?T2 :addresses\\#state_county ?T2_state_county . FILTER(?T2_state_county = 'Alaska') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_store_email_address WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql> {\n    SELECT DISTINCT ?T2 ?T2_state_county WHERE {\n      ?T2 a :addresses .\n      ?T2 :addresses\\#state_county ?T2_state_county\n      FILTER(?T2_state_county = 'Alaska')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql> {\n    ?T1 a :drama_workshop_groups .\n      ?T1 :drama_workshop_groups\\#ref-address_id ?T2 .\n      ?T1 :drama_workshop_groups\\#store_email_address ?T1_store_email_address\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_600",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Show all cities along with the number of drama workshop groups in each city.",
    "original_sparql": "SELECT ?T1_city_town (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :drama_workshop_groups . ?T2 :drama_workshop_groups\\#ref-address_id ?T1 .  ?T1 :addresses\\#city_town ?T1_city_town .        } GROUP BY ?T1_city_town",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_city_town (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_city_town ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql> {\n    SELECT DISTINCT ?T1 ?T1_city_town WHERE {\n      ?T1 a :addresses .\n      ?T1 :addresses\\#city_town ?T1_city_town\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql> {\n    ?T2 a :drama_workshop_groups .\n      ?T2 :drama_workshop_groups\\#ref-address_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_city_town",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 12,
      "federated_count": 12,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_603",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Which workshop groups have bookings with status code 'stop'? Give me the names.",
    "original_sparql": "SELECT ?T1_store_name WHERE { ?T1 a :drama_workshop_groups . ?T2 a :bookings . ?T2 :bookings\\#ref-workshop_group_id ?T1 .  ?T1 :drama_workshop_groups\\#store_name ?T1_store_name . ?T2 :bookings\\#status_code ?T2_status_code . FILTER(?T2_status_code = 'stop') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_store_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql> {\n    SELECT DISTINCT ?T1 ?T1_store_name WHERE {\n      ?T1 a :drama_workshop_groups .\n      ?T1 :drama_workshop_groups\\#store_name ?T1_store_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql> {\n    ?T2 a :bookings .\n      ?T2 :bookings\\#ref-workshop_group_id ?T1 .\n      ?T2 :bookings\\#status_code ?T2_status_code\n      FILTER(?T2_status_code = 'stop')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_607",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Give me the star rating descriptions of the hotels that cost more than 10000.",
    "original_sparql": "SELECT ?T1_star_rating_description WHERE { ?T1 a :ref_hotel_star_ratings . ?T2 a :hotels . ?T2 :hotels\\#ref-star_rating_code ?T1 .  ?T1 :ref_hotel_star_ratings\\#star_rating_description ?T1_star_rating_description . ?T2 :hotels\\#price_range ?T2_price_range . FILTER(?T2_price_range > 10000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_star_rating_description WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql> {\n    SELECT DISTINCT ?T1 ?T1_star_rating_description WHERE {\n      ?T1 a :ref_hotel_star_ratings .\n      ?T1 :ref_hotel_star_ratings\\#star_rating_description ?T1_star_rating_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__hotels/sparql> {\n    ?T2 a :hotels .\n      ?T2 :hotels\\#ref-star_rating_code ?T1 .\n      ?T2 :hotels\\#price_range ?T2_price_range\n      FILTER(?T2_price_range > 10000)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_609",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Give me the detail and opening hour for each museum.",
    "original_sparql": "SELECT ?T1_museum_details ?T2_opening_hours WHERE { ?T1 a :museums . ?T2 a :tourist_attractions . ?T1 :museums\\#ref-museum_id ?T2 .  ?T1 :museums\\#museum_details ?T1_museum_details . ?T2 :tourist_attractions\\#opening_hours ?T2_opening_hours .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_museum_details ?T2_opening_hours WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_opening_hours WHERE {\n      ?T2 a :tourist_attractions .\n      ?T2 :tourist_attractions\\#opening_hours ?T2_opening_hours\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__museums/sparql> {\n    ?T1 a :museums .\n      ?T1 :museums\\#ref-museum_id ?T2 .\n      ?T1 :museums\\#museum_details ?T1_museum_details\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_611",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Which tourist attraction is associated with the photo 'game1'? Return its name.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :tourist_attractions . ?T2 a :photos . ?T2 :photos\\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\\#name ?T1_name . ?T2 :photos\\#name ?T2_name . FILTER(?T2_name = 'game1') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :tourist_attractions .\n      ?T1 :tourist_attractions\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__photos/sparql> {\n    ?T2 a :photos .\n      ?T2 :photos\\#ref-tourist_attraction_id ?T1 .\n      ?T2 :photos\\#name ?T2_name\n      FILTER(?T2_name = 'game1')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_theme_park_613",
    "kg_name": "cre_theme_park",
    "split": "train",
    "question": "Find the names and descriptions of the photos taken at the tourist attraction called 'film festival'.",
    "original_sparql": "SELECT ?T1_name ?T1_description WHERE { ?T1 a :photos . ?T2 a :tourist_attractions . ?T1 :photos\\#ref-tourist_attraction_id ?T2 .  ?T1 :photos\\#name ?T1_name . ?T1 :photos\\#description ?T1_description . ?T2 :tourist_attractions\\#name ?T2_name . FILTER(?T2_name = 'film festival') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_description WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :tourist_attractions .\n      ?T2 :tourist_attractions\\#name ?T2_name\n      FILTER(?T2_name = 'film festival')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_theme_park__photos/sparql> {\n    ?T1 a :photos .\n      ?T1 :photos\\#ref-tourist_attraction_id ?T2 .\n      ?T1 :photos\\#name ?T1_name .\n      ?T1 :photos\\#description ?T1_description\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/locations",
        "url": "http://host.docker.internal:3030/cre_theme_park__locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/hotels",
        "url": "http://host.docker.internal:3030/cre_theme_park__hotels/sparql"
      },
      {
        "class": "http://valuenet/ontop/visits",
        "url": "http://host.docker.internal:3030/cre_theme_park__visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attractions",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attractions/sparql"
      },
      {
        "class": "http://valuenet/ontop/visitors",
        "url": "http://host.docker.internal:3030/cre_theme_park__visitors/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_attraction_types",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_attraction_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/photos",
        "url": "http://host.docker.internal:3030/cre_theme_park__photos/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/cre_theme_park__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_hotel_star_ratings",
        "url": "http://host.docker.internal:3030/cre_theme_park__ref_hotel_star_ratings/sparql"
      },
      {
        "class": "http://valuenet/ontop/tourist_attraction_features",
        "url": "http://host.docker.internal:3030/cre_theme_park__tourist_attraction_features/sparql"
      },
      {
        "class": "http://valuenet/ontop/features",
        "url": "http://host.docker.internal:3030/cre_theme_park__features/sparql"
      },
      {
        "class": "http://valuenet/ontop/theme_parks",
        "url": "http://host.docker.internal:3030/cre_theme_park__theme_parks/sparql"
      },
      {
        "class": "http://valuenet/ontop/shops",
        "url": "http://host.docker.internal:3030/cre_theme_park__shops/sparql"
      },
      {
        "class": "http://valuenet/ontop/museums",
        "url": "http://host.docker.internal:3030/cre_theme_park__museums/sparql"
      },
      {
        "class": "http://valuenet/ontop/street_markets",
        "url": "http://host.docker.internal:3030/cre_theme_park__street_markets/sparql"
      },
      {
        "class": "http://valuenet/ontop/royal_family",
        "url": "http://host.docker.internal:3030/cre_theme_park__royal_family/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  }
]