[
  {
    "id": "swimming_2031",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the names of swimmers who has a result of 'win'.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\\#ref-swimmer_id ?T1 .  ?T1 :swimmer\\#name ?T1_name . ?T2 :record\\#result ?T2_result . FILTER(?T2_result = 'Win') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__record/sparql> {\n    SELECT DISTINCT ?T2 ?T2_result WHERE {\n      ?T2 a :record .\n      ?T2 :record\\#result ?T2_result\n      FILTER(?T2_result = 'Win')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__swimmer/sparql> {\n    ?T1 a :swimmer .\n      ?T2 :record\\#ref-swimmer_id ?T1 .\n      ?T1 :swimmer\\#name ?T1_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 6,
      "federated_count": 0,
      "missing": 6,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "swimming_2033",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the name and capacity of the stadium where the event named 'World Junior' happened.",
    "original_sparql": "SELECT ?T1_name ?T1_capacity WHERE { ?T1 a :stadium . ?T2 a :event . ?T2 :event\\#ref-stadium_id ?T1 .  ?T1 :stadium\\#name ?T1_name . ?T1 :stadium\\#capacity ?T1_capacity . ?T2 :event\\#name ?T2_name . FILTER(?T2_name = 'World Junior') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_capacity WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__event/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :event .\n      ?T2 :event\\#name ?T2_name\n      FILTER(?T2_name = 'World Junior')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__stadium/sparql> {\n    ?T1 a :stadium .\n      ?T2 :event\\#ref-stadium_id ?T1 .\n      ?T1 :stadium\\#name ?T1_name .\n      ?T1 :stadium\\#capacity ?T1_capacity\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "swimming_2034",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the name of the swimmer who has the most records.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\\#ref-swimmer_id ?T1 .  ?T1 :swimmer\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__record/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :record\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__swimmer/sparql> {\n    ?T1 a :swimmer .\n      ?T2 :record\\#ref-swimmer_id ?T1 .\n      ?T1 :swimmer\\#name ?T1_name\n  }\n    }\n  }\n}\nGROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "swimming_2035",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the name of the swimmer who has at least 2 records.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\\#ref-swimmer_id ?T1 .  ?T1 :swimmer\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__record/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :record\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__swimmer/sparql> {\n    ?T1 a :swimmer .\n      ?T2 :record\\#ref-swimmer_id ?T1 .\n      ?T1 :swimmer\\#name ?T1_name\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  >= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 3,
      "federated_count": 0,
      "missing": 3,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "swimming_2036",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the name and nationality of the swimmer who has won (i.e., has a result of 'win') more than 1 time.",
    "original_sparql": "SELECT ?T1_name ?T1_nationality WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\\#ref-swimmer_id ?T1 .  ?T1 :swimmer\\#name ?T1_name . ?T1 :swimmer\\#nationality ?T1_nationality . ?T2 :record\\#result ?T2_result . FILTER(?T2_result = 'Win') .        } GROUP BY ?T1_name ?T1_nationality   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_nationality WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T1_nationality ?T2 ?T2_result WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__record/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :record .\n      ?T2 :record\\#result ?T2_result\n      FILTER(?T2_result = 'Win')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__swimmer/sparql> {\n    ?T1 a :swimmer .\n      ?T2 :record\\#ref-swimmer_id ?T1 .\n      ?T1 :swimmer\\#name ?T1_name .\n      ?T1 :swimmer\\#nationality ?T1_nationality\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T1_nationality   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 0,
      "missing": 2,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "swimming_2037",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the names of the swimmers who have both 'win' and 'loss' results in the record.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\\#ref-swimmer_id ?T1 .  ?T1 :swimmer\\#name ?T1_name . ?T2 :record\\#result ?T2_result . FILTER(?T2_result = 'Win') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :swimmer . ?T4 a :record . ?T4 :record\\#ref-swimmer_id ?T3 .  ?T3 :swimmer\\#name ?T3_name . ?T4 :record\\#result ?T4_result .  FILTER(?T4_result = 'Loss') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__record/sparql> {\n    SELECT DISTINCT ?T2 ?T2_result ?T4 ?T4_result WHERE {\n      ?T2 a :record .\n      ?T2 :record\\#result ?T2_result .\n      ?T4 a :record .\n      ?T4 :record\\#result ?T4_result\n      FILTER(?T2_result = 'Win')\n      FILTER(?T4_result = 'Loss')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__swimmer/sparql> {\n    ?T1 a :swimmer .\n      ?T2 :record\\#ref-swimmer_id ?T1 .\n      ?T1 :swimmer\\#name ?T1_name .\n      ?T3 a :swimmer .\n      ?T4 :record\\#ref-swimmer_id ?T3 .\n      ?T3 :swimmer\\#name ?T3_name\n      FILTER (?T1_name in (?T3_name))\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 3,
      "federated_count": 0,
      "missing": 3,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "swimming_2038",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the names of stadiums that some Australian swimmers have been to.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :stadium . ?T13 a :event . ?T13 :event\\#ref-stadium_id ?T1 .  ?T1 :stadium\\#name ?T1_name . ?T2 :swimmer\\#nationality ?T2_nationality . ?T14 a :record . ?T14 :record\\#ref-event_id ?T13 .  ?T1 :stadium\\#name ?T1_name . ?T2 :swimmer\\#nationality ?T2_nationality . ?T2 a :swimmer . ?T14 :record\\#ref-swimmer_id ?T2 .  ?T1 :stadium\\#name ?T1_name . ?T2 :swimmer\\#nationality ?T2_nationality . FILTER(?T2_nationality = 'Australia') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__event/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :event\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__record/sparql> {\n    SELECT DISTINCT ?T13 ?T14 WHERE {\n      ?T14 a :record .\n      ?T14 :record\\#ref-event_id ?T13\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__stadium/sparql> {\n    ?T1 a :stadium .\n      ?T13 :event\\#ref-stadium_id ?T1 .\n      ?T1 :stadium\\#name ?T1_name .\n      ?T1 :stadium\\#name ?T1_name .\n      ?T1 :stadium\\#name ?T1_name\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__swimmer/sparql> {\n    ?T2 :swimmer\\#nationality ?T2_nationality .\n      ?T2 :swimmer\\#nationality ?T2_nationality .\n      ?T2 a :swimmer .\n      ?T14 :record\\#ref-swimmer_id ?T2 .\n      ?T2 :swimmer\\#nationality ?T2_nationality\n      FILTER(?T2_nationality = 'Australia')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 4,
      "federated_count": 0,
      "missing": 4,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "swimming_2039",
    "kg_name": "swimming",
    "split": "train",
    "question": "Find the names of stadiums that the most swimmers have been to.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T13 a :event . ?T13 :event\\#ref-stadium_id ?T1 .  ?T1 :stadium\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/swimming__event/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :event\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/swimming__stadium/sparql> {\n    ?T1 a :stadium .\n      ?T13 :event\\#ref-stadium_id ?T1 .\n      ?T1 :stadium\\#name ?T1_name\n  }\n    }\n  }\n}\nGROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/swimmer",
        "url": "http://host.docker.internal:3030/swimming__swimmer/sparql"
      },
      {
        "class": "http://valuenet/ontop/event",
        "url": "http://host.docker.internal:3030/swimming__event/sparql"
      },
      {
        "class": "http://valuenet/ontop/stadium",
        "url": "http://host.docker.internal:3030/swimming__stadium/sparql"
      },
      {
        "class": "http://valuenet/ontop/record",
        "url": "http://host.docker.internal:3030/swimming__record/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "theme_gallery_2040",
    "kg_name": "theme_gallery",
    "split": "train",
    "question": "Show all artist names and the number of exhibitions for each artist.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :exhibition . ?T2 :exhibition\\#ref-artist_id ?T1 .  ?T1 :artist\\#name ?T1_name .        } GROUP BY ?T1_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/theme_gallery__artist/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :artist .\n      ?T1 :artist\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n    ?T2 a :exhibition .\n      ?T2 :exhibition\\#ref-artist_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/artist",
        "url": "http://host.docker.internal:3030/theme_gallery__artist/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition_record",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "theme_gallery_2043",
    "kg_name": "theme_gallery",
    "split": "train",
    "question": "Return the name and country corresponding to the artist who has had the most exhibitions.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_country WHERE { ?T1 a :artist . ?T2 a :exhibition . ?T2 :exhibition\\#ref-artist_id ?T1 .  ?T1 :artist\\#name ?T1_name . ?T1 :artist\\#country ?T1_country .        } GROUP BY ?T1_name ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) ?T1_country WHERE {\n  {\n    SELECT ?T1 ?T1_country ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/theme_gallery__artist/sparql> {\n    SELECT DISTINCT ?T1 ?T1_country ?T1_name WHERE {\n      ?T1 a :artist .\n      ?T1 :artist\\#name ?T1_name .\n      ?T1 :artist\\#country ?T1_country\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n    ?T2 a :exhibition .\n      ?T2 :exhibition\\#ref-artist_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/artist",
        "url": "http://host.docker.internal:3030/theme_gallery__artist/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition_record",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "theme_gallery_2045",
    "kg_name": "theme_gallery",
    "split": "train",
    "question": "Return the names of artists and the themes of their exhibitions that had a ticket price higher than average.",
    "original_sparql": "SELECT ?T1_theme ?T2_name WHERE { ?T1 a :exhibition . ?T2 a :artist . ?T1 :exhibition\\#ref-artist_id ?T2 .  ?T1 :exhibition\\#theme ?T1_theme . ?T2 :artist\\#name ?T2_name . ?T1 :exhibition\\#ticket_price ?T1_ticket_price . FILTER(?T1_ticket_price > (?aggregation_T23_ticket_price_15)) .       {SELECT (avg( ?T23_ticket_price) as ?aggregation_T23_ticket_price_15 ) WHERE { ?T23 a :exhibition . ?T23 :exhibition\\#ticket_price ?T23_ticket_price .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_theme ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/theme_gallery__artist/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :artist .\n      ?T2 :artist\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n    ?T1 a :exhibition .\n      ?T1 :exhibition\\#ref-artist_id ?T2 .\n      ?T1 :exhibition\\#theme ?T1_theme .\n      ?T1 :exhibition\\#ticket_price ?T1_ticket_price\n      FILTER(?T1_ticket_price > (?aggregation_T23_ticket_price_15))\n  }\n  {\n    SELECT (avg( ?T23_ticket_price) as ?aggregation_T23_ticket_price_15 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n        ?T23 a :exhibition . ?T23 :exhibition\\#ticket_price ?T23_ticket_price . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/artist",
        "url": "http://host.docker.internal:3030/theme_gallery__artist/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition_record",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "theme_gallery_2047",
    "kg_name": "theme_gallery",
    "split": "train",
    "question": "Return the themes, dates, and attendance for exhibitions that happened in 2004.",
    "original_sparql": "SELECT ?T1_theme ?T2_date ?T2_attendance WHERE { ?T1 a :exhibition . ?T2 a :exhibition_record . ?T2 :exhibition_record\\#ref-exhibition_id ?T1 .  ?T1 :exhibition\\#theme ?T1_theme . ?T2 :exhibition_record\\#date ?T2_date . ?T2 :exhibition_record\\#attendance ?T2_attendance . ?T1 :exhibition\\#year ?T1_year . FILTER(?T1_year = 2004) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_theme ?T2_date ?T2_attendance WHERE {\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n    SELECT DISTINCT ?T1 ?T1_theme ?T1_year WHERE {\n      ?T1 a :exhibition .\n      ?T1 :exhibition\\#theme ?T1_theme .\n      ?T1 :exhibition\\#year ?T1_year\n      FILTER(?T1_year = 2004)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql> {\n    ?T2 a :exhibition_record .\n      ?T2 :exhibition_record\\#ref-exhibition_id ?T1 .\n      ?T2 :exhibition_record\\#date ?T2_date .\n      ?T2 :exhibition_record\\#attendance ?T2_attendance\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/artist",
        "url": "http://host.docker.internal:3030/theme_gallery__artist/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition_record",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "theme_gallery_2048",
    "kg_name": "theme_gallery",
    "split": "train",
    "question": "Show the theme for exhibitions with both records of an attendance below 100 and above 500.",
    "original_sparql": "SELECT DISTINCT ?T1_theme WHERE { ?T1 a :exhibition . ?T2 a :exhibition_record . ?T2 :exhibition_record\\#ref-exhibition_id ?T1 .  ?T1 :exhibition\\#theme ?T1_theme . ?T2 :exhibition_record\\#attendance ?T2_attendance . FILTER(?T2_attendance < 100) . FILTER (?T1_theme in (?T3_theme)) .   ?T3 a :exhibition . ?T4 a :exhibition_record . ?T4 :exhibition_record\\#ref-exhibition_id ?T3 .  ?T3 :exhibition\\#theme ?T3_theme . ?T4 :exhibition_record\\#attendance ?T4_attendance .  FILTER(?T4_attendance > 500) .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_theme WHERE {\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n    SELECT DISTINCT ?T1 ?T1_theme ?T3 ?T3_theme WHERE {\n      ?T1 a :exhibition .\n      ?T1 :exhibition\\#theme ?T1_theme .\n      ?T3 a :exhibition .\n      ?T3 :exhibition\\#theme ?T3_theme\n      FILTER (?T1_theme in (?T3_theme))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql> {\n    ?T2 a :exhibition_record .\n      ?T2 :exhibition_record\\#ref-exhibition_id ?T1 .\n      ?T2 :exhibition_record\\#attendance ?T2_attendance .\n      ?T4 a :exhibition_record .\n      ?T4 :exhibition_record\\#ref-exhibition_id ?T3 .\n      ?T4 :exhibition_record\\#attendance ?T4_attendance\n      FILTER(?T2_attendance < 100)\n      FILTER(?T4_attendance > 500)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/artist",
        "url": "http://host.docker.internal:3030/theme_gallery__artist/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition_record",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "theme_gallery_2051",
    "kg_name": "theme_gallery",
    "split": "train",
    "question": "Count the number of exhibitions that have had an attendnance of over 100 or a ticket prices under 10.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :exhibition_record . ?T2 a :exhibition . ?T1 :exhibition_record\\#ref-exhibition_id ?T2 .  ?T1 :exhibition_record\\#attendance ?T1_attendance . ?T2 :exhibition\\#ticket_price ?T2_ticket_price . FILTER(?T1_attendance > 100 || ?T2_ticket_price < 10) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_attendance ?T2 ?T2_ticket_price WHERE {\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n    SELECT DISTINCT ?T2 ?T2_ticket_price WHERE {\n      ?T2 a :exhibition .\n      ?T2 :exhibition\\#ticket_price ?T2_ticket_price\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql> {\n    ?T1 a :exhibition_record .\n      ?T1 :exhibition_record\\#ref-exhibition_id ?T2 .\n      ?T1 :exhibition_record\\#attendance ?T1_attendance\n      FILTER(?T1_attendance > 100 || ?T2_ticket_price < 10)\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/artist",
        "url": "http://host.docker.internal:3030/theme_gallery__artist/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition_record",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "theme_gallery_2052",
    "kg_name": "theme_gallery",
    "split": "train",
    "question": "Show all artist names with an average exhibition attendance over 200.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :artist . ?T13 a :exhibition . ?T13 :exhibition\\#ref-artist_id ?T1 .  ?T1 :artist\\#name ?T1_name . ?T2 :exhibition_record\\#attendance ?T2_attendance . ?T2 a :exhibition_record . ?T2 :exhibition_record\\#ref-exhibition_id ?T13 .  ?T1 :artist\\#name ?T1_name . ?T2 :exhibition_record\\#attendance ?T2_attendance .        } GROUP BY ?T1_name   HAVING(avg( ?T2_attendance)  > 200)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_name ?T2 ?T2_attendance WHERE {\n  SERVICE <http://host.docker.internal:3030/theme_gallery__artist/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :artist .\n      ?T1 :artist\\#name ?T1_name .\n      ?T1 :artist\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition/sparql> {\n    SELECT DISTINCT ?T1 ?T13 WHERE {\n      ?T13 a :exhibition .\n      ?T13 :exhibition\\#ref-artist_id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql> {\n    ?T2 :exhibition_record\\#attendance ?T2_attendance .\n      ?T2 a :exhibition_record .\n      ?T2 :exhibition_record\\#ref-exhibition_id ?T13 .\n      ?T2 :exhibition_record\\#attendance ?T2_attendance\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(avg( ?T2_attendance)  > 200)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/artist",
        "url": "http://host.docker.internal:3030/theme_gallery__artist/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition_record",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition_record/sparql"
      },
      {
        "class": "http://valuenet/ontop/exhibition",
        "url": "http://host.docker.internal:3030/theme_gallery__exhibition/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  }
]