[
  {
    "id": "apartment_rentals_73",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the average room count of the apartments that have booking status code 'Provisional'.",
    "original_sparql": "SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_104 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\\#ref-apt_id ?T1 .  ?T1 :apartments\\#room_count ?T1_room_count . ?T2 :apartment_bookings\\#booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Provisional') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_104 ) WHERE {\n  {\n    SELECT ?T1 ?T1_room_count ?T2 ?T2_booking_status_code WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T1 ?T1_room_count WHERE {\n      ?T1 a :apartments .\n      ?T1 :apartments\\#room_count ?T1_room_count\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T2 a :apartment_bookings .\n      ?T2 :apartment_bookings\\#ref-apt_id ?T1 .\n      ?T2 :apartment_bookings\\#booking_status_code ?T2_booking_status_code\n      FILTER(?T2_booking_status_code = 'Provisional')\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_75",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the guest first names, start dates, and end dates of all the apartment bookings.",
    "original_sparql": "SELECT ?T1_guest_first_name ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a :guests . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\\#ref-guest_id ?T1 .  ?T1 :guests\\#guest_first_name ?T1_guest_first_name . ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date . ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_guest_first_name ?T2_booking_start_date ?T2_booking_start_date WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__guests/sparql> {\n    SELECT DISTINCT ?T1 ?T1_guest_first_name WHERE {\n      ?T1 a :guests .\n      ?T1 :guests\\#guest_first_name ?T1_guest_first_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T2 a :apartment_bookings .\n      ?T2 :apartment_bookings\\#ref-guest_id ?T1 .\n      ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date .\n      ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_77",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the start dates and end dates of all the apartment bookings made by guests with gender code 'Female'.",
    "original_sparql": "SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :guests . ?T1 :apartment_bookings\\#ref-guest_id ?T2 .  ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date . ?T2 :guests\\#gender_code ?T2_gender_code . FILTER(?T2_gender_code = 'Female') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_booking_start_date ?T1_booking_start_date WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__guests/sparql> {\n    SELECT DISTINCT ?T2 ?T2_gender_code WHERE {\n      ?T2 a :guests .\n      ?T2 :guests\\#gender_code ?T2_gender_code\n      FILTER(?T2_gender_code = 'Female')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T1 a :apartment_bookings .\n      ?T1 :apartment_bookings\\#ref-guest_id ?T2 .\n      ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date .\n      ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_79",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the first names and last names of all the guests that have apartment bookings with status code 'Confirmed'.",
    "original_sparql": "SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a :guests . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\\#ref-guest_id ?T1 .  ?T1 :guests\\#guest_first_name ?T1_guest_first_name . ?T1 :guests\\#guest_last_name ?T1_guest_last_name . ?T2 :apartment_bookings\\#booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_guest_first_name ?T1_guest_last_name WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__guests/sparql> {\n    SELECT DISTINCT ?T1 ?T1_guest_first_name ?T1_guest_last_name WHERE {\n      ?T1 a :guests .\n      ?T1 :guests\\#guest_first_name ?T1_guest_first_name .\n      ?T1 :guests\\#guest_last_name ?T1_guest_last_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T2 a :apartment_bookings .\n      ?T2 :apartment_bookings\\#ref-guest_id ?T1 .\n      ?T2 :apartment_bookings\\#booking_status_code ?T2_booking_status_code\n      FILTER(?T2_booking_status_code = 'Confirmed')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_81",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the facility codes of apartments with more than 4 bedrooms.",
    "original_sparql": "SELECT ?T1_facility_code WHERE { ?T1 a :apartment_facilities . ?T2 a :apartments . ?T1 :apartment_facilities\\#ref-apt_id ?T2 .  ?T1 :apartment_facilities\\#facility_code ?T1_facility_code . ?T2 :apartments\\#bedroom_count ?T2_bedroom_count . FILTER(?T2_bedroom_count > 4) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_facility_code WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T2 ?T2_bedroom_count WHERE {\n      ?T2 a :apartments .\n      ?T2 :apartments\\#bedroom_count ?T2_bedroom_count\n      FILTER(?T2_bedroom_count > 4)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql> {\n    ?T1 a :apartment_facilities .\n      ?T1 :apartment_facilities\\#ref-apt_id ?T2 .\n      ?T1 :apartment_facilities\\#facility_code ?T1_facility_code\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_83",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the total number of rooms of all apartments with facility code 'Gym'.",
    "original_sparql": "SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_83 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_facilities . ?T2 :apartment_facilities\\#ref-apt_id ?T1 .  ?T1 :apartments\\#room_count ?T1_room_count . ?T2 :apartment_facilities\\#facility_code ?T2_facility_code . FILTER(?T2_facility_code = 'Gym') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_83 ) WHERE {\n  {\n    SELECT ?T1 ?T1_room_count ?T2 ?T2_facility_code WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T1 ?T1_room_count WHERE {\n      ?T1 a :apartments .\n      ?T1 :apartments\\#room_count ?T1_room_count\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql> {\n    ?T2 a :apartment_facilities .\n      ?T2 :apartment_facilities\\#ref-apt_id ?T1 .\n      ?T2 :apartment_facilities\\#facility_code ?T2_facility_code\n      FILTER(?T2_facility_code = 'Gym')\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_85",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the total number of rooms of the apartments in the building with short name 'Columbus Square'.",
    "original_sparql": "SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_58 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :apartments\\#ref-building_id ?T2 .  ?T1 :apartments\\#room_count ?T1_room_count . ?T2 :apartment_buildings\\#building_short_name ?T2_building_short_name . FILTER(?T2_building_short_name = 'Columbus Square') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_58 ) WHERE {\n  {\n    SELECT ?T1 ?T1_room_count ?T2 ?T2_building_short_name WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :apartment_buildings .\n      ?T2 :apartment_buildings\\#building_short_name ?T2_building_short_name\n      FILTER(?T2_building_short_name = 'Columbus Square')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    ?T1 a :apartments .\n      ?T1 :apartments\\#ref-building_id ?T2 .\n      ?T1 :apartments\\#room_count ?T1_room_count\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_87",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the addresses of the buildings that have apartments with more than 2 bathrooms.",
    "original_sparql": "SELECT ?T1_building_address WHERE { ?T1 a :apartment_buildings . ?T2 a :apartments . ?T2 :apartments\\#ref-building_id ?T1 .  ?T1 :apartment_buildings\\#building_address ?T1_building_address . ?T2 :apartments\\#bathroom_count ?T2_bathroom_count . FILTER(?T2_bathroom_count > 2) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_building_address WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql> {\n    SELECT DISTINCT ?T1 ?T1_building_address WHERE {\n      ?T1 a :apartment_buildings .\n      ?T1 :apartment_buildings\\#building_address ?T1_building_address\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    ?T2 a :apartments .\n      ?T2 :apartments\\#ref-building_id ?T1 .\n      ?T2 :apartments\\#bathroom_count ?T2_bathroom_count\n      FILTER(?T2_bathroom_count > 2)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_89",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the apartment type codes and apartment numbers in the buildings managed by 'Kyle'.",
    "original_sparql": "SELECT ?T1_apt_type_code ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :apartments\\#ref-building_id ?T2 .  ?T1 :apartments\\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\\#apt_number ?T1_apt_number . ?T2 :apartment_buildings\\#building_manager ?T2_building_manager . FILTER(?T2_building_manager = 'Kyle') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_apt_type_code ?T1_apt_number WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql> {\n    SELECT DISTINCT ?T2 ?T2_building_manager WHERE {\n      ?T2 a :apartment_buildings .\n      ?T2 :apartment_buildings\\#building_manager ?T2_building_manager\n      FILTER(?T2_building_manager = 'Kyle')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    ?T1 a :apartments .\n      ?T1 :apartments\\#ref-building_id ?T2 .\n      ?T1 :apartments\\#apt_type_code ?T1_apt_type_code .\n      ?T1 :apartments\\#apt_number ?T1_apt_number\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_91",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the apartment numbers of apartments with bookings that have status code both 'Provisional' and 'Confirmed'",
    "original_sparql": "SELECT DISTINCT ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\\#ref-apt_id ?T1 .  ?T1 :apartments\\#apt_number ?T1_apt_number . ?T2 :apartment_bookings\\#booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') . FILTER (?T1_apt_number in (?T3_apt_number)) .   ?T3 a :apartments . ?T4 a :apartment_bookings . ?T4 :apartment_bookings\\#ref-apt_id ?T3 .  ?T3 :apartments\\#apt_number ?T3_apt_number . ?T4 :apartment_bookings\\#booking_status_code ?T4_booking_status_code .  FILTER(?T4_booking_status_code = 'Provisional') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_apt_number WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T1 ?T1_apt_number ?T3 ?T3_apt_number WHERE {\n      ?T1 a :apartments .\n      ?T1 :apartments\\#apt_number ?T1_apt_number .\n      ?T3 a :apartments .\n      ?T3 :apartments\\#apt_number ?T3_apt_number\n      FILTER (?T1_apt_number in (?T3_apt_number))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T2 a :apartment_bookings .\n      ?T2 :apartment_bookings\\#ref-apt_id ?T1 .\n      ?T2 :apartment_bookings\\#booking_status_code ?T2_booking_status_code .\n      ?T4 a :apartment_bookings .\n      ?T4 :apartment_bookings\\#ref-apt_id ?T3 .\n      ?T4 :apartment_bookings\\#booking_status_code ?T4_booking_status_code\n      FILTER(?T2_booking_status_code = 'Confirmed')\n      FILTER(?T4_booking_status_code = 'Provisional')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "architecture_100",
    "kg_name": "architecture",
    "split": "train",
    "question": "show the name of all bridges that was designed by american archtect, and sort the result by the bridge feet length.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :bridge . ?T2 a :architect . ?T1 :bridge\\#ref-architect_id ?T2 .  ?T1 :bridge\\#name ?T1_name . ?T1 :bridge\\#length_feet ?T1_length_feet . ?T2 :architect\\#nationality ?T2_nationality . FILTER(?T2_nationality = 'American') .        }  ORDER BY ASC (?T1_length_feet)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/architecture__bridge/sparql> {\n    SELECT DISTINCT ?T1 ?T1_length_feet ?T1_name WHERE {\n      ?T1 a :bridge .\n      ?T1 :bridge\\#name ?T1_name .\n      ?T1 :bridge\\#length_feet ?T1_length_feet\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/architecture__architect/sparql> {\n    ?T2 a :architect .\n      ?T1 :bridge\\#ref-architect_id ?T2 .\n      ?T2 :architect\\#nationality ?T2_nationality\n      FILTER(?T2_nationality = 'American')\n  }\n}\nORDER BY ASC (?T1_length_feet)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bridge",
        "url": "http://host.docker.internal:3030/architecture__bridge/sparql"
      },
      {
        "class": "http://valuenet/ontop/mill",
        "url": "http://host.docker.internal:3030/architecture__mill/sparql"
      },
      {
        "class": "http://valuenet/ontop/architect",
        "url": "http://host.docker.internal:3030/architecture__architect/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 4,
      "federated_count": 0,
      "missing": 4,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "assets_maintenance_101",
    "kg_name": "assets_maintenance",
    "split": "train",
    "question": "Which assets have 2 parts and have less than 2 fault logs? List the asset id and detail.",
    "original_sparql": "SELECT DISTINCT ?T1_asset_id ?T1_asset_details WHERE { ?T1 a :assets . ?T2 a :asset_parts . ?T2 :asset_parts\\#ref-asset_id ?T1 .  ?T1 :assets\\#asset_id ?T1_asset_id . ?T1 :assets\\#asset_details ?T1_asset_details . FILTER (?T1_asset_id in (?T3_asset_id)) . FILTER (?T1_asset_details in (?T3_asset_details)) .   ?T3 a :assets . ?T4 a :fault_log . ?T4 :fault_log\\#ref-asset_id ?T3 .  ?T3 :assets\\#asset_id ?T3_asset_id . ?T3 :assets\\#asset_details ?T3_asset_details .     GROUP BY ?T3_asset_id ?T3_asset_details   HAVING(count( *)  < 2)      } GROUP BY ?T1_asset_id ?T1_asset_details   HAVING(count( *)  = 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_asset_id ?T1_asset_details WHERE {\n  {\n    SELECT ?T1 ?T1_asset_details ?T1_asset_id ?T2 ?T3 ?T3_asset_details ?T3_asset_id ?T4 WHERE {\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__assets/sparql> {\n    SELECT DISTINCT ?T1 ?T1_asset_details ?T1_asset_id ?T3 ?T3_asset_details ?T3_asset_id WHERE {\n      ?T1 a :assets .\n      ?T1 :assets\\#asset_id ?T1_asset_id .\n      ?T1 :assets\\#asset_details ?T1_asset_details .\n      ?T3 a :assets .\n      ?T3 :assets\\#asset_id ?T3_asset_id .\n      ?T3 :assets\\#asset_details ?T3_asset_details\n      FILTER (?T1_asset_id in (?T3_asset_id))\n      FILTER (?T1_asset_details in (?T3_asset_details))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql> {\n    ?T2 a :asset_parts .\n      ?T2 :asset_parts\\#ref-asset_id ?T1\n  }\n  SERVICE <http://host.docker.internal:3030/assets_maintenance__fault_log/sparql> {\n    ?T4 a :fault_log .\n      ?T4 :fault_log\\#ref-asset_id ?T3\n  }\n    }\n  }\n}\nGROUP BY ?T1_asset_id ?T1_asset_details   HAVING(count( *)  = 2) GROUP BY ?T3_asset_id ?T3_asset_details   HAVING(count( *)  < 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/third_party_companies",
        "url": "http://host.docker.internal:3030/assets_maintenance__third_party_companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_engineers",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_engineers/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills/sparql"
      },
      {
        "class": "http://valuenet/ontop/part_faults",
        "url": "http://host.docker.internal:3030/assets_maintenance__part_faults/sparql"
      },
      {
        "class": "http://valuenet/ontop/asset_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__asset_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/maintenance_contracts",
        "url": "http://host.docker.internal:3030/assets_maintenance__maintenance_contracts/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log/sparql"
      },
      {
        "class": "http://valuenet/ontop/assets",
        "url": "http://host.docker.internal:3030/assets_maintenance__assets/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/assets_maintenance__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/fault_log_parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__fault_log_parts/sparql"
      },
      {
        "class": "http://valuenet/ontop/engineer_visits",
        "url": "http://host.docker.internal:3030/assets_maintenance__engineer_visits/sparql"
      },
      {
        "class": "http://valuenet/ontop/skills_required_to_fix",
        "url": "http://host.docker.internal:3030/assets_maintenance__skills_required_to_fix/sparql"
      },
      {
        "class": "http://valuenet/ontop/parts",
        "url": "http://host.docker.internal:3030/assets_maintenance__parts/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  }
]