[
  {
    "id": "insurance_fnol_1291",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "Count the total number of policies used by the customer named 'Dayana Robel'.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :customers_policies\\#ref-customer_id ?T2 .  ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_customer_name WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :customers .\n      ?T2 :customers\\#customer_name ?T2_customer_name\n      FILTER(?T2_customer_name = 'Dayana Robel')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql> {\n    ?T1 a :customers_policies .\n      ?T1 :customers_policies\\#ref-customer_id ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_fnol_1293",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "Which customer uses the most policies? Give me the customer name.",
    "original_sparql": "SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :customers_policies . ?T2 :customers_policies\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_customer_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql> {\n    ?T2 a :customers_policies .\n      ?T2 :customers_policies\\#ref-customer_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_fnol_1295",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "Tell me the types of the policy used by the customer named 'Dayana Robel'.",
    "original_sparql": "SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T13 a :customers_policies . ?T13 :customers_policies\\#ref-policy_id ?T1 .  ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code . ?T2 :customers\\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customers_policies\\#ref-customer_id ?T2 .  ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code . ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_policy_type_code WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__available_policies/sparql> {\n    SELECT DISTINCT ?T1 ?T1_policy_type_code WHERE {\n      ?T1 a :available_policies .\n      ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code .\n      ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_customer_name WHERE {\n      ?T2 :customers\\#customer_name ?T2_customer_name .\n      ?T2 a :customers .\n      ?T2 :customers\\#customer_name ?T2_customer_name\n      FILTER(?T2_customer_name = 'Dayana Robel')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql> {\n    ?T13 a :customers_policies .\n      ?T13 :customers_policies\\#ref-policy_id ?T1 .\n      ?T13 :customers_policies\\#ref-customer_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_fnol_1297",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "List all the policy types used by the customer enrolled in the most policies.",
    "original_sparql": "SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T13 a :customers_policies . ?T13 :customers_policies\\#ref-policy_id ?T1 .  ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code . ?T2 :customers\\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customers_policies\\#ref-customer_id ?T2 .  ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code . ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = (?T23_customer_name)) .       {SELECT ?T23_customer_name (count( *) as ?aggregation_all) WHERE { ?T23 a :customers . ?T24 a :customers_policies . ?T24 :customers_policies\\#ref-customer_id ?T23 .  ?T23 :customers\\#customer_name ?T23_customer_name .        } GROUP BY ?T23_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1 } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_policy_type_code WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__available_policies/sparql> {\n    SELECT DISTINCT ?T1 ?T1_policy_type_code WHERE {\n      ?T1 a :available_policies .\n      ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code .\n      ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers/sparql> {\n    SELECT DISTINCT ?T2 ?T23_customer_name ?T2_customer_name WHERE {\n      ?T2 :customers\\#customer_name ?T2_customer_name .\n      ?T2 a :customers .\n      ?T2 :customers\\#customer_name ?T2_customer_name\n      FILTER(?T2_customer_name = (?T23_customer_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql> {\n    ?T13 a :customers_policies .\n      ?T13 :customers_policies\\#ref-policy_id ?T1 .\n      ?T13 :customers_policies\\#ref-customer_id ?T2\n  }\n  {\n    SELECT ?T23_customer_name (count( *) as ?aggregation_all) WHERE {\n      SERVICE <http://host.docker.internal:3030/insurance_fnol__customers/sparql> {\n        ?T23 a :customers . ?T24 a :customers_policies . ?T24 :customers_policies\\#ref-customer_id ?T23 . ?T23 :customers\\#customer_name ?T23_customer_name . } GROUP BY ?T23_customer_name ORDER BY DESC (?aggregation_all) LIMIT 1\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "insurance_fnol_1298",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "Find the names of customers who have used either the service 'Close a policy' or the service 'Upgrade a policy'.",
    "original_sparql": "SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customers_policies . ?T13 :customers_policies\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :services\\#service_name ?T2_service_name . ?T2 :services\\#service_name ?T2_service_name . ?T14 a :first_notification_of_loss . ?T14 :first_notification_of_loss\\#ref-customer_id ?T13 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :services\\#service_name ?T2_service_name . ?T2 :services\\#service_name ?T2_service_name . ?T2 a :services . ?T14 :first_notification_of_loss\\#ref-service_id ?T2 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :services\\#service_name ?T2_service_name . ?T2 :services\\#service_name ?T2_service_name . FILTER(?T2_service_name = 'Close a policy' || ?T2_service_name = 'Upgrade a policy') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_name WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name .\n      ?T1 :customers\\#customer_name ?T1_customer_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql> {\n    SELECT DISTINCT ?T1 ?T13 WHERE {\n      ?T13 a :customers_policies .\n      ?T13 :customers_policies\\#ref-customer_id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__services/sparql> {\n    SELECT DISTINCT ?T2 ?T2_service_name WHERE {\n      ?T2 :services\\#service_name ?T2_service_name .\n      ?T2 :services\\#service_name ?T2_service_name .\n      ?T2 :services\\#service_name ?T2_service_name .\n      ?T2 :services\\#service_name ?T2_service_name .\n      ?T2 a :services .\n      ?T2 :services\\#service_name ?T2_service_name .\n      ?T2 :services\\#service_name ?T2_service_name\n      FILTER(?T2_service_name = 'Close a policy' || ?T2_service_name = 'Upgrade a policy')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql> {\n    ?T14 a :first_notification_of_loss .\n      ?T14 :first_notification_of_loss\\#ref-customer_id ?T13 .\n      ?T14 :first_notification_of_loss\\#ref-service_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_fnol_1302",
    "kg_name": "insurance_fnol",
    "split": "train",
    "question": "Retrieve the open and close dates of all the policies associated with the customer whose name contains 'Diana'",
    "original_sparql": "SELECT ?T1_date_opened ?T1_date_closed WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :customers_policies\\#ref-customer_id ?T2 .  ?T1 :customers_policies\\#date_opened ?T1_date_opened . ?T1 :customers_policies\\#date_closed ?T1_date_closed . ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(contains (?T2_customer_name, 'Diana')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date_opened ?T1_date_closed WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_customer_name WHERE {\n      ?T2 a :customers .\n      ?T2 :customers\\#customer_name ?T2_customer_name\n      FILTER(contains (?T2_customer_name, 'Diana'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql> {\n    ?T1 a :customers_policies .\n      ?T1 :customers_policies\\#ref-customer_id ?T2 .\n      ?T1 :customers_policies\\#date_opened ?T1_date_opened .\n      ?T1 :customers_policies\\#date_closed ?T1_date_closed\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/first_notification_of_loss",
        "url": "http://host.docker.internal:3030/insurance_fnol__first_notification_of_loss/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/available_policies",
        "url": "http://host.docker.internal:3030/insurance_fnol__available_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_fnol__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_fnol__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_fnol__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/insurance_fnol__services/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_policies_1304",
    "kg_name": "insurance_policies",
    "split": "train",
    "question": "How many settlements does each claim correspond to? List the claim id and the number of settlements.",
    "original_sparql": "SELECT ?T1_claim_id (count( *) as ?aggregation_all) WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\\#ref-claim_id ?T1 .  ?T1 :claims\\#claim_id ?T1_claim_id .        } GROUP BY ?T1_claim_id",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_claim_id (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_claim_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_policies__claims/sparql> {\n    SELECT DISTINCT ?T1 ?T1_claim_id WHERE {\n      ?T1 a :claims .\n      ?T1 :claims\\#claim_id ?T1_claim_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_policies__settlements/sparql> {\n    ?T2 a :settlements .\n      ?T2 :settlements\\#ref-claim_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_claim_id",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/customer_policies",
        "url": "http://host.docker.internal:3030/insurance_policies__customer_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_policies__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/payments",
        "url": "http://host.docker.internal:3030/insurance_policies__payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_policies__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_policies__customers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 9,
      "federated_count": 9,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_policies_1306",
    "kg_name": "insurance_policies",
    "split": "train",
    "question": "Which claim incurred the most number of settlements? List the claim id, the date the claim was made, and the number.",
    "original_sparql": "SELECT ?T1_claim_id (count( *) as ?aggregation_all) ?T1_date_claim_made (count( *) as ?aggregation_all) WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\\#ref-claim_id ?T1 .  ?T1 :claims\\#claim_id ?T1_claim_id . ?T1 :claims\\#date_claim_made ?T1_date_claim_made .        } GROUP BY ?T1_claim_id ?T1_date_claim_made  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_claim_id (count( *) as ?aggregation_all) ?T1_date_claim_made (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_claim_id ?T1_date_claim_made ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_policies__claims/sparql> {\n    SELECT DISTINCT ?T1 ?T1_claim_id ?T1_date_claim_made WHERE {\n      ?T1 a :claims .\n      ?T1 :claims\\#claim_id ?T1_claim_id .\n      ?T1 :claims\\#date_claim_made ?T1_date_claim_made\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_policies__settlements/sparql> {\n    ?T2 a :settlements .\n      ?T2 :settlements\\#ref-claim_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_claim_id ?T1_date_claim_made  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/customer_policies",
        "url": "http://host.docker.internal:3030/insurance_policies__customer_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_policies__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/payments",
        "url": "http://host.docker.internal:3030/insurance_policies__payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_policies__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_policies__customers/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "insurance_policies_1308",
    "kg_name": "insurance_policies",
    "split": "train",
    "question": "How many settlements were made on the claim with the most recent claim settlement date? List the number and the claim id.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_claim_id WHERE { ?T1 a :settlements . ?T2 a :claims . ?T1 :settlements\\#ref-claim_id ?T2 .  ?T2 :claims\\#claim_id ?T2_claim_id . ?T2 :claims\\#date_claim_settled ?T2_date_claim_settled .        } GROUP BY ?T2_claim_id  ORDER BY DESC (?T2_date_claim_settled) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_claim_id WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_claim_id ?T2_date_claim_settled WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_policies__claims/sparql> {\n    SELECT DISTINCT ?T2 ?T2_claim_id ?T2_date_claim_settled WHERE {\n      ?T2 a :claims .\n      ?T2 :claims\\#claim_id ?T2_claim_id .\n      ?T2 :claims\\#date_claim_settled ?T2_date_claim_settled\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_policies__settlements/sparql> {\n    ?T1 a :settlements .\n      ?T1 :settlements\\#ref-claim_id ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_claim_id  ORDER BY DESC (?T2_date_claim_settled) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/customer_policies",
        "url": "http://host.docker.internal:3030/insurance_policies__customer_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_policies__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/payments",
        "url": "http://host.docker.internal:3030/insurance_policies__payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_policies__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_policies__customers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_policies_1310",
    "kg_name": "insurance_policies",
    "split": "train",
    "question": "Who are the customers that had more than 1 policy? List the customer details and id.",
    "original_sparql": "SELECT ?T1_customer_details ?T1_customer_id WHERE { ?T1 a :customers . ?T2 a :customer_policies . ?T2 :customer_policies\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_details ?T1_customer_details . ?T1 :customers\\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_details ?T1_customer_id   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_customer_details ?T1_customer_id WHERE {\n  {\n    SELECT ?T1 ?T1_customer_details ?T1_customer_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_policies__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_customer_details ?T1_customer_id WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#customer_details ?T1_customer_details .\n      ?T1 :customers\\#customer_id ?T1_customer_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_policies__customer_policies/sparql> {\n    ?T2 a :customer_policies .\n      ?T2 :customer_policies\\#ref-customer_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_customer_details ?T1_customer_id   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/customer_policies",
        "url": "http://host.docker.internal:3030/insurance_policies__customer_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_policies__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/payments",
        "url": "http://host.docker.internal:3030/insurance_policies__payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_policies__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_policies__customers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "insurance_policies_1312",
    "kg_name": "insurance_policies",
    "split": "train",
    "question": "List the date the claim was made, the date it was settled and the amount settled for all the claims which had exactly one settlement.",
    "original_sparql": "SELECT ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\\#ref-claim_id ?T1 .  ?T1 :claims\\#claim_id ?T1_claim_id . ?T1 :claims\\#date_claim_made ?T1_date_claim_made . ?T1 :claims\\#date_claim_settled ?T1_date_claim_settled .        } GROUP BY ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled   HAVING(count( *)  = 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled WHERE {\n  {\n    SELECT ?T1 ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/insurance_policies__claims/sparql> {\n    SELECT DISTINCT ?T1 ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled WHERE {\n      ?T1 a :claims .\n      ?T1 :claims\\#claim_id ?T1_claim_id .\n      ?T1 :claims\\#date_claim_made ?T1_date_claim_made .\n      ?T1 :claims\\#date_claim_settled ?T1_date_claim_settled\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/insurance_policies__settlements/sparql> {\n    ?T2 a :settlements .\n      ?T2 :settlements\\#ref-claim_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled   HAVING(count( *)  = 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/customer_policies",
        "url": "http://host.docker.internal:3030/insurance_policies__customer_policies/sparql"
      },
      {
        "class": "http://valuenet/ontop/claims",
        "url": "http://host.docker.internal:3030/insurance_policies__claims/sparql"
      },
      {
        "class": "http://valuenet/ontop/payments",
        "url": "http://host.docker.internal:3030/insurance_policies__payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/settlements",
        "url": "http://host.docker.internal:3030/insurance_policies__settlements/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/insurance_policies__customers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "journal_committee_1314",
    "kg_name": "journal_committee",
    "split": "train",
    "question": "Show the names of editors and the theme of journals for which they serve on committees.",
    "original_sparql": "SELECT ?T1_name ?T2_theme WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :journal_committee\\#ref-editor_id ?T1 .  ?T1 :editor\\#name ?T1_name . ?T2 :journal\\#theme ?T2_theme . ?T2 a :journal . ?T13 :journal_committee\\#ref-journal_id ?T2 .  ?T1 :editor\\#name ?T1_name . ?T2 :journal\\#theme ?T2_theme .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_theme WHERE {\n  SERVICE <http://host.docker.internal:3030/journal_committee__editor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :editor .\n      ?T1 :editor\\#name ?T1_name .\n      ?T1 :editor\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal/sparql> {\n    SELECT DISTINCT ?T2 ?T2_theme WHERE {\n      ?T2 :journal\\#theme ?T2_theme .\n      ?T2 a :journal .\n      ?T2 :journal\\#theme ?T2_theme\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal_committee/sparql> {\n    ?T13 a :journal_committee .\n      ?T13 :journal_committee\\#ref-editor_id ?T1 .\n      ?T13 :journal_committee\\#ref-journal_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/editor",
        "url": "http://host.docker.internal:3030/journal_committee__editor/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal_committee",
        "url": "http://host.docker.internal:3030/journal_committee__journal_committee/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal",
        "url": "http://host.docker.internal:3030/journal_committee__journal/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  }
]