[
  {
    "id": "club_1_271",
    "kg_name": "club_1",
    "split": "train",
    "question": "Find the club which has the largest number of members majoring in '600'.",
    "original_sparql": "SELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :member_of_club . ?T2 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T3 :student\\#major ?T3_major . ?T3 a :student . ?T2 :member_of_club\\#ref-stuid ?T3 .  ?T1 :club\\#clubname ?T1_clubname . ?T3 :student\\#major ?T3_major . FILTER(?T3_major = 600) .        } GROUP BY ?T1_clubname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_clubname ?T2 ?T3 ?T3_major WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_clubname WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#clubname ?T1_clubname .\n      ?T1 :club\\#clubname ?T1_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T3 WHERE {\n      ?T3 :student\\#major ?T3_major .\n      ?T3 a :student .\n      ?T3 :student\\#major ?T3_major\n      FILTER(?T3_major = 600)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T2 a :member_of_club .\n      ?T2 :member_of_club\\#ref-clubid ?T1 .\n      ?T2 :member_of_club\\#ref-stuid ?T3\n  }\n    }\n  }\n}\nGROUP BY ?T1_clubname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_272",
    "kg_name": "club_1",
    "split": "train",
    "question": "Find the name of the club that has the most female students.",
    "original_sparql": "SELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :member_of_club . ?T2 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T3 :student\\#sex ?T3_sex . ?T3 a :student . ?T2 :member_of_club\\#ref-stuid ?T3 .  ?T1 :club\\#clubname ?T1_clubname . ?T3 :student\\#sex ?T3_sex . FILTER(?T3_sex = 'F') .        } GROUP BY ?T1_clubname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_clubname ?T2 ?T3 ?T3_sex WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_clubname WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#clubname ?T1_clubname .\n      ?T1 :club\\#clubname ?T1_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T3 WHERE {\n      ?T3 :student\\#sex ?T3_sex .\n      ?T3 a :student .\n      ?T3 :student\\#sex ?T3_sex\n      FILTER(?T3_sex = 'F')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T2 a :member_of_club .\n      ?T2 :member_of_club\\#ref-clubid ?T1 .\n      ?T2 :member_of_club\\#ref-stuid ?T3\n  }\n    }\n  }\n}\nGROUP BY ?T1_clubname  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_275",
    "kg_name": "club_1",
    "split": "train",
    "question": "Who is the president of the club 'Bootup Baltimore'? Give me the first and last name.",
    "original_sparql": "SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T3 a :member_of_club . ?T3 :member_of_club\\#ref-stuid ?T1 .  ?T1 :student\\#fname ?T1_fname . ?T1 :student\\#lname ?T1_lname . ?T2 :club\\#clubname ?T2_clubname . ?T3 :member_of_club\\#position ?T3_position . ?T2 a :club . ?T3 :member_of_club\\#ref-clubid ?T2 .  ?T1 :student\\#fname ?T1_fname . ?T1 :student\\#lname ?T1_lname . ?T2 :club\\#clubname ?T2_clubname . ?T3 :member_of_club\\#position ?T3_position . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_position = 'President') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fname ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname ?T1_lname WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#fname ?T1_fname .\n      ?T1 :student\\#lname ?T1_lname .\n      ?T1 :student\\#fname ?T1_fname .\n      ?T1 :student\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T2 ?T2_clubname WHERE {\n      ?T2 :club\\#clubname ?T2_clubname .\n      ?T2 a :club .\n      ?T2 :club\\#clubname ?T2_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T3 a :member_of_club .\n      ?T3 :member_of_club\\#ref-stuid ?T1 .\n      ?T3 :member_of_club\\#position ?T3_position .\n      ?T3 :member_of_club\\#ref-clubid ?T2 .\n      ?T3 :member_of_club\\#position ?T3_position\n      FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_position = 'President')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "club_1_279",
    "kg_name": "club_1",
    "split": "train",
    "question": "Count the number of different positions in the club 'Bootup Baltimore'.",
    "original_sparql": "SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_5 ) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\\#ref-clubid ?T2 .  ?T1 :member_of_club\\#position ?T1_position . ?T2 :club\\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_5 ) WHERE {\n  {\n    SELECT ?T1 ?T1_position ?T2 ?T2_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :club .\n      ?T2 :club\\#clubname ?T2_clubname\n      FILTER(?T2_clubname = 'Bootup Baltimore')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T1 a :member_of_club .\n      ?T1 :member_of_club\\#ref-clubid ?T2 .\n      ?T1 :member_of_club\\#position ?T1_position\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_281",
    "kg_name": "club_1",
    "split": "train",
    "question": "Count the number of members in club 'Bootup Baltimore' whose age is above 18.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\\#ref-clubid ?T2 .  ?T2 :club\\#clubname ?T2_clubname . ?T3 :student\\#age ?T3_age . ?T3 a :student . ?T1 :member_of_club\\#ref-stuid ?T3 .  ?T2 :club\\#clubname ?T2_clubname . ?T3 :student\\#age ?T3_age . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age > 18) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_clubname ?T3 ?T3_age WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T2 ?T3_age WHERE {\n      ?T2 a :club .\n      ?T2 :club\\#clubname ?T2_clubname .\n      ?T2 :club\\#clubname ?T2_clubname\n      FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age > 18)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T3 ?T3_age WHERE {\n      ?T3 :student\\#age ?T3_age .\n      ?T3 a :student .\n      ?T3 :student\\#age ?T3_age\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T1 a :member_of_club .\n      ?T1 :member_of_club\\#ref-clubid ?T2 .\n      ?T1 :member_of_club\\#ref-stuid ?T3\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_284",
    "kg_name": "club_1",
    "split": "train",
    "question": "Find the names of all the clubs that have at least a member from the city with city code 'BAL'.",
    "original_sparql": "SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#city_code ?T2_city_code . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#city_code ?T2_city_code . FILTER(?T2_city_code = 'BAL') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_clubname WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#clubname ?T1_clubname .\n      ?T1 :club\\#clubname ?T1_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T2 ?T2_city_code WHERE {\n      ?T2 :student\\#city_code ?T2_city_code .\n      ?T2 a :student .\n      ?T2 :student\\#city_code ?T2_city_code\n      FILTER(?T2_city_code = 'BAL')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-clubid ?T1 .\n      ?T13 :member_of_club\\#ref-stuid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_286",
    "kg_name": "club_1",
    "split": "train",
    "question": "Find the names of the clubs that have at least a member from the city with city code 'HOU'.",
    "original_sparql": "SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#city_code ?T2_city_code . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#city_code ?T2_city_code . FILTER(?T2_city_code = 'HOU') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_clubname WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#clubname ?T1_clubname .\n      ?T1 :club\\#clubname ?T1_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T2 ?T2_city_code WHERE {\n      ?T2 :student\\#city_code ?T2_city_code .\n      ?T2 a :student .\n      ?T2 :student\\#city_code ?T2_city_code\n      FILTER(?T2_city_code = 'HOU')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-clubid ?T1 .\n      ?T13 :member_of_club\\#ref-stuid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_289",
    "kg_name": "club_1",
    "split": "train",
    "question": "Count the number of clubs for which the student named 'Eric Tai' is a member.",
    "original_sparql": "SELECT DISTINCT (count(DISTINCT ?T1_clubname) as ?aggregation_T1_clubname_11 ) WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Eric' && ?T2_lname = 'Tai') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT (count(DISTINCT ?T1_clubname) as ?aggregation_T1_clubname_11 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_clubname ?T2 ?T2_fname ?T2_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_clubname WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#clubname ?T1_clubname .\n      ?T1 :club\\#clubname ?T1_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname .\n      ?T2 a :student .\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname\n      FILTER(?T2_fname = 'Eric' && ?T2_lname = 'Tai')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-clubid ?T1 .\n      ?T13 :member_of_club\\#ref-stuid ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_290",
    "kg_name": "club_1",
    "split": "train",
    "question": "List the clubs having 'Davis Steven' as a member.",
    "original_sparql": "SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Davis' && ?T2_lname = 'Steven') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_clubname WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#clubname ?T1_clubname .\n      ?T1 :club\\#clubname ?T1_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T2 ?T2_fname ?T2_lname WHERE {\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname .\n      ?T2 a :student .\n      ?T2 :student\\#fname ?T2_fname .\n      ?T2 :student\\#lname ?T2_lname\n      FILTER(?T2_fname = 'Davis' && ?T2_lname = 'Steven')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-clubid ?T1 .\n      ?T13 :member_of_club\\#ref-stuid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_292",
    "kg_name": "club_1",
    "split": "train",
    "question": "List the clubs that have at least a member with advisor '1121'.",
    "original_sparql": "SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#advisor ?T2_advisor . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#advisor ?T2_advisor . FILTER(?T2_advisor = 1121) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_clubname WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#clubname ?T1_clubname .\n      ?T1 :club\\#clubname ?T1_clubname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T2 ?T2_advisor WHERE {\n      ?T2 :student\\#advisor ?T2_advisor .\n      ?T2 a :student .\n      ?T2 :student\\#advisor ?T2_advisor\n      FILTER(?T2_advisor = 1121)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-clubid ?T1 .\n      ?T13 :member_of_club\\#ref-stuid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_295",
    "kg_name": "club_1",
    "split": "train",
    "question": "Find the average age of the members in the club 'Bootup Baltimore'.",
    "original_sparql": "SELECT (avg( ?T1_age) as ?aggregation_T1_age_156 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-stuid ?T1 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\\#ref-clubid ?T2 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_age) as ?aggregation_T1_age_156 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_age ?T2 ?T2_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_age WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#age ?T1_age .\n      ?T1 :student\\#age ?T1_age\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :club\\#clubname ?T2_clubname .\n      ?T2 a :club .\n      ?T2 :club\\#clubname ?T2_clubname\n      FILTER(?T2_clubname = 'Bootup Baltimore')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-stuid ?T1 .\n      ?T13 :member_of_club\\#ref-clubid ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_296",
    "kg_name": "club_1",
    "split": "train",
    "question": "Find the average age of members of the club 'Hopkins Student Enterprises'.",
    "original_sparql": "SELECT (avg( ?T1_age) as ?aggregation_T1_age_192 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-stuid ?T1 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\\#ref-clubid ?T2 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Hopkins Student Enterprises') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_age) as ?aggregation_T1_age_192 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_age ?T2 ?T2_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_age WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#age ?T1_age .\n      ?T1 :student\\#age ?T1_age\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :club\\#clubname ?T2_clubname .\n      ?T2 a :club .\n      ?T2 :club\\#clubname ?T2_clubname\n      FILTER(?T2_clubname = 'Hopkins Student Enterprises')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-stuid ?T1 .\n      ?T13 :member_of_club\\#ref-clubid ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "club_1_298",
    "kg_name": "club_1",
    "split": "train",
    "question": "Retrieve the average age of members of the club 'Tennis Club'.",
    "original_sparql": "SELECT (avg( ?T1_age) as ?aggregation_T1_age_36 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-stuid ?T1 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\\#ref-clubid ?T2 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Tennis Club') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_age) as ?aggregation_T1_age_36 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_age ?T2 ?T2_clubname WHERE {\n  SERVICE <http://host.docker.internal:3030/club_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_age WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#age ?T1_age .\n      ?T1 :student\\#age ?T1_age\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__club/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :club\\#clubname ?T2_clubname .\n      ?T2 a :club .\n      ?T2 :club\\#clubname ?T2_clubname\n      FILTER(?T2_clubname = 'Tennis Club')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/club_1__member_of_club/sparql> {\n    ?T13 a :member_of_club .\n      ?T13 :member_of_club\\#ref-stuid ?T1 .\n      ?T13 :member_of_club\\#ref-clubid ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/club_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/club_1__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/member_of_club",
        "url": "http://host.docker.internal:3030/club_1__member_of_club/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_301",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the number of professors in accounting department.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T2 a :department . ?T1 :professor\\#ref-dept_code ?T2 .  ?T2 :department\\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Accounting') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_dept_name WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :department .\n      ?T2 :department\\#dept_name ?T2_dept_name\n      FILTER(?T2_dept_name = 'Accounting')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__professor/sparql> {\n    ?T1 a :professor .\n      ?T1 :professor\\#ref-dept_code ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_309",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the number of classes in each department.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a :class . ?T2 a :course . ?T1 :class\\#ref-crs_code ?T2 .  ?T2 :course\\#dept_code ?T2_dept_code .        } GROUP BY ?T2_dept_code",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_dept_code WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_dept_code WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__course/sparql> {\n    SELECT DISTINCT ?T2 ?T2_dept_code WHERE {\n      ?T2 a :course .\n      ?T2 :course\\#dept_code ?T2_dept_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__class/sparql> {\n    ?T1 a :class .\n      ?T1 :class\\#ref-crs_code ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_dept_code",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  }
]