[
  {
    "id": "activity_1_37",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Find the first names of the faculty members who participate in Canoeing and Kayaking.",
    "original_sparql": "SELECT DISTINCT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\\#ref-facid ?T1 .  ?T1 :faculty\\#lname ?T1_lname . ?T2 :activity\\#activity_name ?T2_activity_name . ?T2 a :activity . ?T13 :faculty_participates_in\\#ref-actid ?T2 .  ?T1 :faculty\\#lname ?T1_lname . ?T2 :activity\\#activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing') . FILTER (?T1_lname in (?T3_lname)) .   ?T3 a :faculty . ?T15 a :faculty_participates_in . ?T15 :faculty_participates_in\\#ref-facid ?T3 .  ?T3 :faculty\\#lname ?T3_lname . ?T4 :activity\\#activity_name ?T4_activity_name . ?T4 a :activity . ?T15 :faculty_participates_in\\#ref-actid ?T4 .  ?T3 :faculty\\#lname ?T3_lname . ?T4 :activity\\#activity_name ?T4_activity_name .  FILTER(?T4_activity_name = 'Kayaking') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty/sparql> {\n    SELECT DISTINCT ?T1 ?T1_lname ?T3 ?T3_lname WHERE {\n      ?T1 a :faculty .\n      ?T1 :faculty\\#lname ?T1_lname .\n      ?T1 :faculty\\#lname ?T1_lname .\n      ?T3 a :faculty .\n      ?T3 :faculty\\#lname ?T3_lname .\n      ?T3 :faculty\\#lname ?T3_lname\n      FILTER (?T1_lname in (?T3_lname))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T2 ?T2_activity_name ?T4 ?T4_activity_name WHERE {\n      ?T2 :activity\\#activity_name ?T2_activity_name .\n      ?T2 a :activity .\n      ?T2 :activity\\#activity_name ?T2_activity_name .\n      ?T4 :activity\\#activity_name ?T4_activity_name .\n      ?T4 a :activity .\n      ?T4 :activity\\#activity_name ?T4_activity_name\n      FILTER(?T2_activity_name = 'Canoeing')\n      FILTER(?T4_activity_name = 'Kayaking')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql> {\n    ?T13 a :faculty_participates_in .\n      ?T13 :faculty_participates_in\\#ref-facid ?T1 .\n      ?T13 :faculty_participates_in\\#ref-actid ?T2 .\n      ?T15 a :faculty_participates_in .\n      ?T15 :faculty_participates_in\\#ref-facid ?T3 .\n      ?T15 :faculty_participates_in\\#ref-actid ?T4\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "activity_1_39",
    "kg_name": "activity_1",
    "split": "train",
    "question": "Find the ids of the students who participate in Canoeing and Kayaking.",
    "original_sparql": "SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :participates_in . ?T2 a :activity . ?T1 :participates_in\\#ref-actid ?T2 .  ?T1 :participates_in\\#stuid ?T1_stuid . ?T2 :activity\\#activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing') . FILTER (?T1_stuid in (?T3_stuid)) .   ?T3 a :participates_in . ?T4 a :activity . ?T3 :participates_in\\#ref-actid ?T4 .  ?T3 :participates_in\\#stuid ?T3_stuid . ?T4 :activity\\#activity_name ?T4_activity_name .  FILTER(?T4_activity_name = 'Kayaking') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_stuid WHERE {\n  SERVICE <http://host.docker.internal:3030/activity_1__activity/sparql> {\n    SELECT DISTINCT ?T2 ?T2_activity_name ?T4 ?T4_activity_name WHERE {\n      ?T2 a :activity .\n      ?T2 :activity\\#activity_name ?T2_activity_name .\n      ?T4 a :activity .\n      ?T4 :activity\\#activity_name ?T4_activity_name\n      FILTER(?T2_activity_name = 'Canoeing')\n      FILTER(?T4_activity_name = 'Kayaking')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/activity_1__participates_in/sparql> {\n    ?T1 a :participates_in .\n      ?T1 :participates_in\\#ref-actid ?T2 .\n      ?T1 :participates_in\\#stuid ?T1_stuid .\n      ?T3 a :participates_in .\n      ?T3 :participates_in\\#ref-actid ?T4 .\n      ?T3 :participates_in\\#stuid ?T3_stuid\n      FILTER (?T1_stuid in (?T3_stuid))\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/participates_in",
        "url": "http://host.docker.internal:3030/activity_1__participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty_participates_in",
        "url": "http://host.docker.internal:3030/activity_1__faculty_participates_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/faculty",
        "url": "http://host.docker.internal:3030/activity_1__faculty/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/activity_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/activity",
        "url": "http://host.docker.internal:3030/activity_1__activity/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "aircraft_41",
    "kg_name": "aircraft",
    "split": "train",
    "question": "Please show the names of aircrafts associated with airport with name 'London Gatwick'.",
    "original_sparql": "SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\\#ref-aircraft_id ?T1 .  ?T1 :aircraft\\#aircraft ?T1_aircraft . ?T2 :airport\\#airport_name ?T2_airport_name . ?T2 a :airport . ?T13 :airport_aircraft\\#ref-airport_id ?T2 .  ?T1 :aircraft\\#aircraft ?T1_aircraft . ?T2 :airport\\#airport_name ?T2_airport_name . FILTER(?T2_airport_name = 'London Gatwick') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_aircraft WHERE {\n  SERVICE <http://host.docker.internal:3030/aircraft__aircraft/sparql> {\n    SELECT DISTINCT ?T1 ?T1_aircraft WHERE {\n      ?T1 a :aircraft .\n      ?T1 :aircraft\\#aircraft ?T1_aircraft .\n      ?T1 :aircraft\\#aircraft ?T1_aircraft\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__airport/sparql> {\n    SELECT DISTINCT ?T2 ?T2_airport_name WHERE {\n      ?T2 :airport\\#airport_name ?T2_airport_name .\n      ?T2 a :airport .\n      ?T2 :airport\\#airport_name ?T2_airport_name\n      FILTER(?T2_airport_name = 'London Gatwick')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__airport_aircraft/sparql> {\n    ?T13 a :airport_aircraft .\n      ?T13 :airport_aircraft\\#ref-aircraft_id ?T1 .\n      ?T13 :airport_aircraft\\#ref-airport_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/match",
        "url": "http://host.docker.internal:3030/aircraft__match/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport",
        "url": "http://host.docker.internal:3030/aircraft__airport/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport_aircraft",
        "url": "http://host.docker.internal:3030/aircraft__airport_aircraft/sparql"
      },
      {
        "class": "http://valuenet/ontop/pilot",
        "url": "http://host.docker.internal:3030/aircraft__pilot/sparql"
      },
      {
        "class": "http://valuenet/ontop/aircraft",
        "url": "http://host.docker.internal:3030/aircraft__aircraft/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "aircraft_43",
    "kg_name": "aircraft",
    "split": "train",
    "question": "Please show the names and descriptions of aircrafts associated with airports that have a total number of passengers bigger than 10000000.",
    "original_sparql": "SELECT ?T1_aircraft ?T1_description WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\\#ref-aircraft_id ?T1 .  ?T1 :aircraft\\#aircraft ?T1_aircraft . ?T1 :aircraft\\#description ?T1_description . ?T2 :airport\\#total_passengers ?T2_total_passengers . ?T2 a :airport . ?T13 :airport_aircraft\\#ref-airport_id ?T2 .  ?T1 :aircraft\\#aircraft ?T1_aircraft . ?T1 :aircraft\\#description ?T1_description . ?T2 :airport\\#total_passengers ?T2_total_passengers . FILTER(?T2_total_passengers > 10000000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_aircraft ?T1_description WHERE {\n  SERVICE <http://host.docker.internal:3030/aircraft__aircraft/sparql> {\n    SELECT DISTINCT ?T1 ?T1_aircraft ?T1_description WHERE {\n      ?T1 a :aircraft .\n      ?T1 :aircraft\\#aircraft ?T1_aircraft .\n      ?T1 :aircraft\\#description ?T1_description .\n      ?T1 :aircraft\\#aircraft ?T1_aircraft .\n      ?T1 :aircraft\\#description ?T1_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__airport/sparql> {\n    SELECT DISTINCT ?T2 ?T2_total_passengers WHERE {\n      ?T2 :airport\\#total_passengers ?T2_total_passengers .\n      ?T2 a :airport .\n      ?T2 :airport\\#total_passengers ?T2_total_passengers\n      FILTER(?T2_total_passengers > 10000000)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__airport_aircraft/sparql> {\n    ?T13 a :airport_aircraft .\n      ?T13 :airport_aircraft\\#ref-aircraft_id ?T1 .\n      ?T13 :airport_aircraft\\#ref-airport_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/match",
        "url": "http://host.docker.internal:3030/aircraft__match/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport",
        "url": "http://host.docker.internal:3030/aircraft__airport/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport_aircraft",
        "url": "http://host.docker.internal:3030/aircraft__airport_aircraft/sparql"
      },
      {
        "class": "http://valuenet/ontop/pilot",
        "url": "http://host.docker.internal:3030/aircraft__pilot/sparql"
      },
      {
        "class": "http://valuenet/ontop/aircraft",
        "url": "http://host.docker.internal:3030/aircraft__aircraft/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "aircraft_47",
    "kg_name": "aircraft",
    "split": "train",
    "question": "Please list the location and the winning aircraft name.",
    "original_sparql": "SELECT ?T1_location ?T2_aircraft WHERE { ?T1 a :match . ?T2 a :aircraft . ?T1 :match\\#ref-winning_aircraft ?T2 .  ?T1 :match\\#location ?T1_location . ?T2 :aircraft\\#aircraft ?T2_aircraft .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_location ?T2_aircraft WHERE {\n  SERVICE <http://host.docker.internal:3030/aircraft__match/sparql> {\n    SELECT DISTINCT ?T1 ?T1_location WHERE {\n      ?T1 a :match .\n      ?T1 :match\\#location ?T1_location\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__aircraft/sparql> {\n    ?T2 a :aircraft .\n      ?T1 :match\\#ref-winning_aircraft ?T2 .\n      ?T2 :aircraft\\#aircraft ?T2_aircraft\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/match",
        "url": "http://host.docker.internal:3030/aircraft__match/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport",
        "url": "http://host.docker.internal:3030/aircraft__airport/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport_aircraft",
        "url": "http://host.docker.internal:3030/aircraft__airport_aircraft/sparql"
      },
      {
        "class": "http://valuenet/ontop/pilot",
        "url": "http://host.docker.internal:3030/aircraft__pilot/sparql"
      },
      {
        "class": "http://valuenet/ontop/aircraft",
        "url": "http://host.docker.internal:3030/aircraft__aircraft/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 7,
      "federated_count": 0,
      "missing": 7,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "aircraft_49",
    "kg_name": "aircraft",
    "split": "train",
    "question": "List the name of the aircraft that has been named winning aircraft the most number of times.",
    "original_sparql": "SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_aircraft ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/aircraft__match/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :match\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__aircraft/sparql> {\n    ?T1 a :aircraft .\n      ?T2 :match\\#ref-winning_aircraft ?T1 .\n      ?T1 :aircraft\\#aircraft ?T1_aircraft\n  }\n    }\n  }\n}\nGROUP BY ?T1_aircraft  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/match",
        "url": "http://host.docker.internal:3030/aircraft__match/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport",
        "url": "http://host.docker.internal:3030/aircraft__airport/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport_aircraft",
        "url": "http://host.docker.internal:3030/aircraft__airport_aircraft/sparql"
      },
      {
        "class": "http://valuenet/ontop/pilot",
        "url": "http://host.docker.internal:3030/aircraft__pilot/sparql"
      },
      {
        "class": "http://valuenet/ontop/aircraft",
        "url": "http://host.docker.internal:3030/aircraft__aircraft/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "aircraft_55",
    "kg_name": "aircraft",
    "split": "train",
    "question": "Show the names of aircrafts that are associated with both an airport named 'London Heathrow' and an airport named 'London Gatwick'",
    "original_sparql": "SELECT DISTINCT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\\#ref-aircraft_id ?T1 .  ?T1 :aircraft\\#aircraft ?T1_aircraft . ?T2 :airport\\#airport_name ?T2_airport_name . ?T2 a :airport . ?T13 :airport_aircraft\\#ref-airport_id ?T2 .  ?T1 :aircraft\\#aircraft ?T1_aircraft . ?T2 :airport\\#airport_name ?T2_airport_name . FILTER(?T2_airport_name = 'London Heathrow') . FILTER (?T1_aircraft in (?T3_aircraft)) .   ?T3 a :aircraft . ?T15 a :airport_aircraft . ?T15 :airport_aircraft\\#ref-aircraft_id ?T3 .  ?T3 :aircraft\\#aircraft ?T3_aircraft . ?T4 :airport\\#airport_name ?T4_airport_name . ?T4 a :airport . ?T15 :airport_aircraft\\#ref-airport_id ?T4 .  ?T3 :aircraft\\#aircraft ?T3_aircraft . ?T4 :airport\\#airport_name ?T4_airport_name .  FILTER(?T4_airport_name = 'London Gatwick') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_aircraft WHERE {\n  SERVICE <http://host.docker.internal:3030/aircraft__aircraft/sparql> {\n    SELECT DISTINCT ?T1 ?T1_aircraft ?T3 ?T3_aircraft WHERE {\n      ?T1 a :aircraft .\n      ?T1 :aircraft\\#aircraft ?T1_aircraft .\n      ?T1 :aircraft\\#aircraft ?T1_aircraft .\n      ?T3 a :aircraft .\n      ?T3 :aircraft\\#aircraft ?T3_aircraft .\n      ?T3 :aircraft\\#aircraft ?T3_aircraft\n      FILTER (?T1_aircraft in (?T3_aircraft))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__airport/sparql> {\n    SELECT DISTINCT ?T2 ?T2_airport_name ?T4 ?T4_airport_name WHERE {\n      ?T2 :airport\\#airport_name ?T2_airport_name .\n      ?T2 a :airport .\n      ?T2 :airport\\#airport_name ?T2_airport_name .\n      ?T4 :airport\\#airport_name ?T4_airport_name .\n      ?T4 a :airport .\n      ?T4 :airport\\#airport_name ?T4_airport_name\n      FILTER(?T2_airport_name = 'London Heathrow')\n      FILTER(?T4_airport_name = 'London Gatwick')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__airport_aircraft/sparql> {\n    ?T13 a :airport_aircraft .\n      ?T13 :airport_aircraft\\#ref-aircraft_id ?T1 .\n      ?T13 :airport_aircraft\\#ref-airport_id ?T2 .\n      ?T15 a :airport_aircraft .\n      ?T15 :airport_aircraft\\#ref-aircraft_id ?T3 .\n      ?T15 :airport_aircraft\\#ref-airport_id ?T4\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/match",
        "url": "http://host.docker.internal:3030/aircraft__match/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport",
        "url": "http://host.docker.internal:3030/aircraft__airport/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport_aircraft",
        "url": "http://host.docker.internal:3030/aircraft__airport_aircraft/sparql"
      },
      {
        "class": "http://valuenet/ontop/pilot",
        "url": "http://host.docker.internal:3030/aircraft__pilot/sparql"
      },
      {
        "class": "http://valuenet/ontop/aircraft",
        "url": "http://host.docker.internal:3030/aircraft__aircraft/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "aircraft_57",
    "kg_name": "aircraft",
    "split": "train",
    "question": "find the name and age of the pilot who has won the most number of times among the pilots who are younger than 30.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_age WHERE { ?T1 a :pilot . ?T2 a :match . ?T2 :match\\#ref-winning_pilot ?T1 .  ?T1 :pilot\\#name ?T1_name . ?T1 :pilot\\#age ?T1_age . ?T1 :pilot\\#age ?T1_age . FILTER(?T1_age < 30) .        } GROUP BY ?T1_name ?T1_age  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) ?T1_age WHERE {\n  {\n    SELECT ?T1 ?T1_age ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/aircraft__match/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :match\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/aircraft__pilot/sparql> {\n    ?T1 a :pilot .\n      ?T2 :match\\#ref-winning_pilot ?T1 .\n      ?T1 :pilot\\#name ?T1_name .\n      ?T1 :pilot\\#age ?T1_age .\n      ?T1 :pilot\\#age ?T1_age\n      FILTER(?T1_age < 30)\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T1_age  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/match",
        "url": "http://host.docker.internal:3030/aircraft__match/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport",
        "url": "http://host.docker.internal:3030/aircraft__airport/sparql"
      },
      {
        "class": "http://valuenet/ontop/airport_aircraft",
        "url": "http://host.docker.internal:3030/aircraft__airport_aircraft/sparql"
      },
      {
        "class": "http://valuenet/ontop/pilot",
        "url": "http://host.docker.internal:3030/aircraft__pilot/sparql"
      },
      {
        "class": "http://valuenet/ontop/aircraft",
        "url": "http://host.docker.internal:3030/aircraft__aircraft/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "allergy_1_61",
    "kg_name": "allergy_1",
    "split": "train",
    "question": "Show all allergy type with number of students affected.",
    "original_sparql": "SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T2 a :has_allergy . ?T2 :has_allergy\\#ref-allergy ?T1 .  ?T1 :allergy_type\\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_allergytype ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/allergy_1__allergy_type/sparql> {\n    SELECT DISTINCT ?T1 ?T1_allergytype WHERE {\n      ?T1 a :allergy_type .\n      ?T1 :allergy_type\\#allergytype ?T1_allergytype\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/allergy_1__has_allergy/sparql> {\n    ?T2 a :has_allergy .\n      ?T2 :has_allergy\\#ref-allergy ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_allergytype",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/allergy_1__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/has_allergy",
        "url": "http://host.docker.internal:3030/allergy_1__has_allergy/sparql"
      },
      {
        "class": "http://valuenet/ontop/allergy_type",
        "url": "http://host.docker.internal:3030/allergy_1__allergy_type/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 3,
      "federated_count": 3,
      "missing": 3,
      "extra": 3,
      "error": "result_mismatch"
    }
  },
  {
    "id": "apartment_rentals_63",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Show the apartment numbers, start dates, and end dates of all the apartment bookings.",
    "original_sparql": "SELECT ?T1_apt_number ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\\#ref-apt_id ?T1 .  ?T1 :apartments\\#apt_number ?T1_apt_number . ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date . ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_apt_number ?T2_booking_start_date ?T2_booking_start_date WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T1 ?T1_apt_number WHERE {\n      ?T1 a :apartments .\n      ?T1 :apartments\\#apt_number ?T1_apt_number\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T2 a :apartment_bookings .\n      ?T2 :apartment_bookings\\#ref-apt_id ?T1 .\n      ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date .\n      ?T2 :apartment_bookings\\#booking_start_date ?T2_booking_start_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_66",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Return the booking start date and end date for the apartments that have type code 'Duplex'.",
    "original_sparql": "SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :apartments . ?T1 :apartment_bookings\\#ref-apt_id ?T2 .  ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date . ?T2 :apartments\\#apt_type_code ?T2_apt_type_code . FILTER(?T2_apt_type_code = 'Duplex') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_booking_start_date ?T1_booking_start_date WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T2 ?T2_apt_type_code WHERE {\n      ?T2 a :apartments .\n      ?T2 :apartments\\#apt_type_code ?T2_apt_type_code\n      FILTER(?T2_apt_type_code = 'Duplex')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T1 a :apartment_bookings .\n      ?T1 :apartment_bookings\\#ref-apt_id ?T2 .\n      ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date .\n      ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_68",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Find the booking start date and end date for the apartments that have more than two bedrooms.",
    "original_sparql": "SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :apartments . ?T1 :apartment_bookings\\#ref-apt_id ?T2 .  ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date . ?T2 :apartments\\#bedroom_count ?T2_bedroom_count . FILTER(?T2_bedroom_count > 2) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_booking_start_date ?T1_booking_start_date WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T2 ?T2_bedroom_count WHERE {\n      ?T2 a :apartments .\n      ?T2 :apartments\\#bedroom_count ?T2_bedroom_count\n      FILTER(?T2_bedroom_count > 2)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T1 a :apartment_bookings .\n      ?T1 :apartment_bookings\\#ref-apt_id ?T2 .\n      ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date .\n      ?T1 :apartment_bookings\\#booking_start_date ?T1_booking_start_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "apartment_rentals_70",
    "kg_name": "apartment_rentals",
    "split": "train",
    "question": "Tell me the booking status code for the apartment with number 'Suite 634'.",
    "original_sparql": "SELECT ?T1_booking_status_code WHERE { ?T1 a :apartment_bookings . ?T2 a :apartments . ?T1 :apartment_bookings\\#ref-apt_id ?T2 .  ?T1 :apartment_bookings\\#booking_status_code ?T1_booking_status_code . ?T2 :apartments\\#apt_number ?T2_apt_number . FILTER(?T2_apt_number = 'Suite 634') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_booking_status_code WHERE {\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartments/sparql> {\n    SELECT DISTINCT ?T2 ?T2_apt_number WHERE {\n      ?T2 a :apartments .\n      ?T2 :apartments\\#apt_number ?T2_apt_number\n      FILTER(?T2_apt_number = 'Suite 634')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql> {\n    ?T1 a :apartment_bookings .\n      ?T1 :apartment_bookings\\#ref-apt_id ?T2 .\n      ?T1 :apartment_bookings\\#booking_status_code ?T1_booking_status_code\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/apartment_bookings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_buildings",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/view_unit_status",
        "url": "http://host.docker.internal:3030/apartment_rentals__view_unit_status/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartments",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartments/sparql"
      },
      {
        "class": "http://valuenet/ontop/apartment_facilities",
        "url": "http://host.docker.internal:3030/apartment_rentals__apartment_facilities/sparql"
      },
      {
        "class": "http://valuenet/ontop/guests",
        "url": "http://host.docker.internal:3030/apartment_rentals__guests/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  }
]