[
  {
    "id": "cre_doc_tracking_db_543",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Show the name and description of the role played by the employee named Ebba.",
    "original_sparql": "SELECT ?T1_role_name ?T1_role_description WHERE { ?T1 a :roles . ?T2 a :employees . ?T2 :employees\\#ref-role_code ?T1 .  ?T1 :roles\\#role_name ?T1_role_name . ?T1 :roles\\#role_description ?T1_role_description . ?T2 :employees\\#employee_name ?T2_employee_name . FILTER(?T2_employee_name = 'Ebba') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_role_name ?T1_role_description WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql> {\n    SELECT DISTINCT ?T1 ?T1_role_description ?T1_role_name WHERE {\n      ?T1 a :roles .\n      ?T1 :roles\\#role_name ?T1_role_name .\n      ?T1 :roles\\#role_description ?T1_role_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql> {\n    ?T2 a :employees .\n      ?T2 :employees\\#ref-role_code ?T1 .\n      ?T2 :employees\\#employee_name ?T2_employee_name\n      FILTER(?T2_employee_name = 'Ebba')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_tracking_db_544",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Show the names of employees with role name Editor.",
    "original_sparql": "SELECT ?T1_employee_name WHERE { ?T1 a :employees . ?T2 a :roles . ?T1 :employees\\#ref-role_code ?T2 .  ?T1 :employees\\#employee_name ?T1_employee_name . ?T2 :roles\\#role_name ?T2_role_name . FILTER(?T2_role_name = 'Editor') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_employee_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql> {\n    SELECT DISTINCT ?T2 ?T2_role_name WHERE {\n      ?T2 a :roles .\n      ?T2 :roles\\#role_name ?T2_role_name\n      FILTER(?T2_role_name = 'Editor')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql> {\n    ?T1 a :employees .\n      ?T1 :employees\\#ref-role_code ?T2 .\n      ?T1 :employees\\#employee_name ?T1_employee_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_tracking_db_546",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Show the employee ids for all employees with role name 'Human Resource' or 'Manager'.",
    "original_sparql": "SELECT ?T1_employee_id WHERE { ?T1 a :employees . ?T2 a :roles . ?T1 :employees\\#ref-role_code ?T2 .  ?T1 :employees\\#employee_id ?T1_employee_id . ?T2 :roles\\#role_name ?T2_role_name . ?T2 :roles\\#role_name ?T2_role_name . FILTER(?T2_role_name = 'Human Resource' || ?T2_role_name = 'Manager') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_employee_id WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql> {\n    SELECT DISTINCT ?T2 ?T2_role_name WHERE {\n      ?T2 a :roles .\n      ?T2 :roles\\#role_name ?T2_role_name .\n      ?T2 :roles\\#role_name ?T2_role_name\n      FILTER(?T2_role_name = 'Human Resource' || ?T2_role_name = 'Manager')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql> {\n    ?T1 a :employees .\n      ?T1 :employees\\#ref-role_code ?T2 .\n      ?T1 :employees\\#employee_id ?T1_employee_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_tracking_db_548",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Show the location name for document 'Robin CV'.",
    "original_sparql": "SELECT ?T1_location_name WHERE { ?T1 a :ref_locations . ?T13 a :document_locations . ?T13 :document_locations\\#ref-location_code ?T1 .  ?T1 :ref_locations\\#location_name ?T1_location_name . ?T2 :all_documents\\#document_name ?T2_document_name . ?T2 a :all_documents . ?T13 :document_locations\\#ref-document_id ?T2 .  ?T1 :ref_locations\\#location_name ?T1_location_name . ?T2 :all_documents\\#document_name ?T2_document_name . FILTER(?T2_document_name = 'Robin CV') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_location_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql> {\n    SELECT DISTINCT ?T1 ?T1_location_name WHERE {\n      ?T1 a :ref_locations .\n      ?T1 :ref_locations\\#location_name ?T1_location_name .\n      ?T1 :ref_locations\\#location_name ?T1_location_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql> {\n    SELECT DISTINCT ?T2 ?T2_document_name WHERE {\n      ?T2 :all_documents\\#document_name ?T2_document_name .\n      ?T2 a :all_documents .\n      ?T2 :all_documents\\#document_name ?T2_document_name\n      FILTER(?T2_document_name = 'Robin CV')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql> {\n    ?T13 a :document_locations .\n      ?T13 :document_locations\\#ref-location_code ?T1 .\n      ?T13 :document_locations\\#ref-document_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_tracking_db_551",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Find the starting date and ending data in location for the document named 'Robin CV'.",
    "original_sparql": "SELECT ?T1_date_in_location_from ?T1_date_in_locaton_to WHERE { ?T1 a :document_locations . ?T2 a :all_documents . ?T1 :document_locations\\#ref-document_id ?T2 .  ?T1 :document_locations\\#date_in_location_from ?T1_date_in_location_from . ?T1 :document_locations\\#date_in_locaton_to ?T1_date_in_locaton_to . ?T2 :all_documents\\#document_name ?T2_document_name . FILTER(?T2_document_name = 'Robin CV') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date_in_location_from ?T1_date_in_locaton_to WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql> {\n    SELECT DISTINCT ?T2 ?T2_document_name WHERE {\n      ?T2 a :all_documents .\n      ?T2 :all_documents\\#document_name ?T2_document_name\n      FILTER(?T2_document_name = 'Robin CV')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql> {\n    ?T1 a :document_locations .\n      ?T1 :document_locations\\#ref-document_id ?T2 .\n      ?T1 :document_locations\\#date_in_location_from ?T1_date_in_location_from .\n      ?T1 :document_locations\\#date_in_locaton_to ?T1_date_in_locaton_to\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_tracking_db_552",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Show the location name and code with the least documents.",
    "original_sparql": "SELECT ?T1_location_name (count( *) as ?aggregation_all) ?T2_location_code WHERE { ?T1 a :ref_locations . ?T2 a :document_locations . ?T2 :document_locations\\#ref-location_code ?T1 .  ?T1 :ref_locations\\#location_name ?T1_location_name . ?T2 :document_locations\\#location_code ?T2_location_code .        } GROUP BY ?T1_location_name ?T2_location_code  ORDER BY ASC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_location_name (count( *) as ?aggregation_all) ?T2_location_code WHERE {\n  {\n    SELECT ?T1 ?T1_location_name ?T2 ?T2_location_code WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql> {\n    SELECT DISTINCT ?T1 ?T1_location_name WHERE {\n      ?T1 a :ref_locations .\n      ?T1 :ref_locations\\#location_name ?T1_location_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql> {\n    ?T2 a :document_locations .\n      ?T2 :document_locations\\#ref-location_code ?T1 .\n      ?T2 :document_locations\\#location_code ?T2_location_code\n  }\n    }\n  }\n}\nGROUP BY ?T1_location_name ?T2_location_code  ORDER BY ASC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_554",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Show statement id, statement detail, account detail for accounts.",
    "original_sparql": "SELECT ?T1_statement_id ?T2_statement_details ?T1_account_details WHERE { ?T1 a :accounts . ?T2 a :statements . ?T1 :accounts\\#ref-statement_id ?T2 .  ?T1 :accounts\\#statement_id ?T1_statement_id . ?T2 :statements\\#statement_details ?T2_statement_details . ?T1 :accounts\\#account_details ?T1_account_details .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_statement_id ?T2_statement_details ?T1_account_details WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql> {\n    SELECT DISTINCT ?T2 ?T2_statement_details WHERE {\n      ?T2 a :statements .\n      ?T2 :statements\\#statement_details ?T2_statement_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql> {\n    ?T1 a :accounts .\n      ?T1 :accounts\\#ref-statement_id ?T2 .\n      ?T1 :accounts\\#statement_id ?T1_statement_id .\n      ?T1 :accounts\\#account_details ?T1_account_details\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_558",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Show the document name and the document date for all documents on project with details 'Graph Database project'.",
    "original_sparql": "SELECT ?T1_document_name ?T1_document_date WHERE { ?T1 a :documents . ?T2 a :projects . ?T1 :documents\\#ref-project_id ?T2 .  ?T1 :documents\\#document_name ?T1_document_name . ?T1 :documents\\#document_date ?T1_document_date . ?T2 :projects\\#project_details ?T2_project_details . FILTER(?T2_project_details = 'Graph Database project') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_document_name ?T1_document_date WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql> {\n    SELECT DISTINCT ?T2 ?T2_project_details WHERE {\n      ?T2 a :projects .\n      ?T2 :projects\\#project_details ?T2_project_details\n      FILTER(?T2_project_details = 'Graph Database project')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql> {\n    ?T1 a :documents .\n      ?T1 :documents\\#ref-project_id ?T2 .\n      ?T1 :documents\\#document_name ?T1_document_name .\n      ?T1 :documents\\#document_date ?T1_document_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_560",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Show the statement detail and the corresponding document name for the statement with detail 'Private Project'.",
    "original_sparql": "SELECT ?T1_statement_details ?T2_document_name WHERE { ?T1 a :statements . ?T2 a :documents . ?T1 :statements\\#ref-statement_id ?T2 .  ?T1 :statements\\#statement_details ?T1_statement_details . ?T2 :documents\\#document_name ?T2_document_name . ?T1 :statements\\#statement_details ?T1_statement_details . FILTER(?T1_statement_details = 'Private Project') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_statement_details ?T2_document_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql> {\n    SELECT DISTINCT ?T2 ?T2_document_name WHERE {\n      ?T2 a :documents .\n      ?T2 :documents\\#document_name ?T2_document_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql> {\n    ?T1 a :statements .\n      ?T1 :statements\\#ref-statement_id ?T2 .\n      ?T1 :statements\\#statement_details ?T1_statement_details .\n      ?T1 :statements\\#statement_details ?T1_statement_details\n      FILTER(?T1_statement_details = 'Private Project')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_563",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Return the type name, type description, and date of creation for each document.",
    "original_sparql": "SELECT ?T1_document_type_name ?T1_document_type_description ?T2_document_date WHERE { ?T1 a :ref_document_types . ?T2 a :documents . ?T2 :documents\\#ref-document_type_code ?T1 .  ?T1 :ref_document_types\\#document_type_name ?T1_document_type_name . ?T1 :ref_document_types\\#document_type_description ?T1_document_type_description . ?T2 :documents\\#document_date ?T2_document_date .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_document_type_name ?T1_document_type_description ?T2_document_date WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql> {\n    SELECT DISTINCT ?T1 ?T1_document_type_description ?T1_document_type_name WHERE {\n      ?T1 a :ref_document_types .\n      ?T1 :ref_document_types\\#document_type_name ?T1_document_type_name .\n      ?T1 :ref_document_types\\#document_type_description ?T1_document_type_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql> {\n    ?T2 a :documents .\n      ?T2 :documents\\#ref-document_type_code ?T1 .\n      ?T2 :documents\\#document_date ?T2_document_date\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 15,
      "federated_count": 15,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_docs_and_epenses_565",
    "kg_name": "cre_docs_and_epenses",
    "split": "train",
    "question": "Return the ids and details corresponding to projects for which there are more than two documents.",
    "original_sparql": "SELECT ?T1_project_id ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :documents . ?T2 :documents\\#ref-project_id ?T1 .  ?T1 :projects\\#project_id ?T1_project_id . ?T1 :projects\\#project_details ?T1_project_details .        } GROUP BY ?T1_project_id ?T1_project_details   HAVING(count( *)  > 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_project_id ?T1_project_details WHERE {\n  {\n    SELECT ?T1 ?T1_project_details ?T1_project_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql> {\n    SELECT DISTINCT ?T1 ?T1_project_details ?T1_project_id WHERE {\n      ?T1 a :projects .\n      ?T1 :projects\\#project_id ?T1_project_id .\n      ?T1 :projects\\#project_details ?T1_project_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql> {\n    ?T2 a :documents .\n      ?T2 :documents\\#ref-project_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_project_id ?T1_project_details   HAVING(count( *)  > 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/accounts",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__accounts/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_with_expenses",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__documents_with_expenses/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_budget_codes",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__ref_budget_codes/sparql"
      },
      {
        "class": "http://valuenet/ontop/statements",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__statements/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/cre_docs_and_epenses__projects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  }
]