[
  {
    "id": "journal_committee_1316",
    "kg_name": "journal_committee",
    "split": "train",
    "question": "Show the names and ages of editors and the theme of journals for which they serve on committees, in ascending alphabetical order of theme.",
    "original_sparql": "SELECT ?T1_name ?T1_age ?T2_theme WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :journal_committee\\#ref-editor_id ?T1 .  ?T1 :editor\\#name ?T1_name . ?T1 :editor\\#age ?T1_age . ?T2 :journal\\#theme ?T2_theme . ?T2 :journal\\#theme ?T2_theme . ?T2 a :journal . ?T13 :journal_committee\\#ref-journal_id ?T2 .  ?T1 :editor\\#name ?T1_name . ?T1 :editor\\#age ?T1_age . ?T2 :journal\\#theme ?T2_theme . ?T2 :journal\\#theme ?T2_theme .        }  ORDER BY ASC (?T2_theme)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T1_age ?T2_theme WHERE {\n  SERVICE <http://host.docker.internal:3030/journal_committee__editor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_age ?T1_name WHERE {\n      ?T1 a :editor .\n      ?T1 :editor\\#name ?T1_name .\n      ?T1 :editor\\#age ?T1_age .\n      ?T1 :editor\\#name ?T1_name .\n      ?T1 :editor\\#age ?T1_age\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal/sparql> {\n    SELECT DISTINCT ?T2 ?T2_theme WHERE {\n      ?T2 :journal\\#theme ?T2_theme .\n      ?T2 :journal\\#theme ?T2_theme .\n      ?T2 a :journal .\n      ?T2 :journal\\#theme ?T2_theme .\n      ?T2 :journal\\#theme ?T2_theme\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal_committee/sparql> {\n    ?T13 a :journal_committee .\n      ?T13 :journal_committee\\#ref-editor_id ?T1 .\n      ?T13 :journal_committee\\#ref-journal_id ?T2\n  }\n}\nORDER BY ASC (?T2_theme)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/editor",
        "url": "http://host.docker.internal:3030/journal_committee__editor/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal_committee",
        "url": "http://host.docker.internal:3030/journal_committee__journal_committee/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal",
        "url": "http://host.docker.internal:3030/journal_committee__journal/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "journal_committee_1317",
    "kg_name": "journal_committee",
    "split": "train",
    "question": "Show the names of editors that are on the committee of journals with sales bigger than 3000.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :journal_committee\\#ref-editor_id ?T1 .  ?T1 :editor\\#name ?T1_name . ?T2 :journal\\#sales ?T2_sales . ?T2 a :journal . ?T13 :journal_committee\\#ref-journal_id ?T2 .  ?T1 :editor\\#name ?T1_name . ?T2 :journal\\#sales ?T2_sales . FILTER(?T2_sales > 3000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/journal_committee__editor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :editor .\n      ?T1 :editor\\#name ?T1_name .\n      ?T1 :editor\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal/sparql> {\n    SELECT DISTINCT ?T2 ?T2_sales WHERE {\n      ?T2 :journal\\#sales ?T2_sales .\n      ?T2 a :journal .\n      ?T2 :journal\\#sales ?T2_sales\n      FILTER(?T2_sales > 3000)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal_committee/sparql> {\n    ?T13 a :journal_committee .\n      ?T13 :journal_committee\\#ref-editor_id ?T1 .\n      ?T13 :journal_committee\\#ref-journal_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/editor",
        "url": "http://host.docker.internal:3030/journal_committee__editor/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal_committee",
        "url": "http://host.docker.internal:3030/journal_committee__journal_committee/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal",
        "url": "http://host.docker.internal:3030/journal_committee__journal/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "journal_committee_1318",
    "kg_name": "journal_committee",
    "split": "train",
    "question": "Show the id, name of each editor and the number of journal committees they are on.",
    "original_sparql": "SELECT ?T1_editor_id ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :editor . ?T2 a :journal_committee . ?T2 :journal_committee\\#ref-editor_id ?T1 .  ?T1 :editor\\#editor_id ?T1_editor_id . ?T1 :editor\\#name ?T1_name .        } GROUP BY ?T1_editor_id ?T1_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_editor_id ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_editor_id ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/journal_committee__editor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_editor_id ?T1_name WHERE {\n      ?T1 a :editor .\n      ?T1 :editor\\#editor_id ?T1_editor_id .\n      ?T1 :editor\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal_committee/sparql> {\n    ?T2 a :journal_committee .\n      ?T2 :journal_committee\\#ref-editor_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_editor_id ?T1_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/editor",
        "url": "http://host.docker.internal:3030/journal_committee__editor/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal_committee",
        "url": "http://host.docker.internal:3030/journal_committee__journal_committee/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal",
        "url": "http://host.docker.internal:3030/journal_committee__journal/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "journal_committee_1319",
    "kg_name": "journal_committee",
    "split": "train",
    "question": "Show the names of editors that are on at least two journal committees.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :editor . ?T2 a :journal_committee . ?T2 :journal_committee\\#ref-editor_id ?T1 .  ?T1 :editor\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/journal_committee__editor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :editor .\n      ?T1 :editor\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/journal_committee__journal_committee/sparql> {\n    ?T2 a :journal_committee .\n      ?T2 :journal_committee\\#ref-editor_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  >= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/editor",
        "url": "http://host.docker.internal:3030/journal_committee__editor/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal_committee",
        "url": "http://host.docker.internal:3030/journal_committee__journal_committee/sparql"
      },
      {
        "class": "http://valuenet/ontop/journal",
        "url": "http://host.docker.internal:3030/journal_committee__journal/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1321",
    "kg_name": "loan_1",
    "split": "train",
    "question": "List the name of all different customers who have some loan sorted by their total loan amount.",
    "original_sparql": "SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\\#ref-cust_id ?T1 .  ?T1 :customer\\#cust_name ?T1_cust_name . ?T2 :loan\\#amount ?T2_amount .        } GROUP BY ?T1_cust_name ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_11 ))",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_cust_name WHERE {\n  {\n    SELECT ?T1 ?T1_cust_name ?T2 ?T2_amount WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__customer/sparql> {\n    SELECT DISTINCT ?T1 ?T1_cust_name WHERE {\n      ?T1 a :customer .\n      ?T1 :customer\\#cust_name ?T1_cust_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-cust_id ?T1 .\n      ?T2 :loan\\#amount ?T2_amount\n  }\n    }\n  }\n}\nGROUP BY ?T1_cust_name ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_11 ))",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "loan_1_1323",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the name of customers who have loans of both Mortgages and Auto.",
    "original_sparql": "SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\\#ref-cust_id ?T1 .  ?T1 :customer\\#cust_name ?T1_cust_name . ?T2 :loan\\#loan_type ?T2_loan_type . FILTER(?T2_loan_type = 'Mortgages') . FILTER (?T1_cust_name in (?T3_cust_name)) .   ?T3 a :customer . ?T4 a :loan . ?T4 :loan\\#ref-cust_id ?T3 .  ?T3 :customer\\#cust_name ?T3_cust_name . ?T4 :loan\\#loan_type ?T4_loan_type .  FILTER(?T4_loan_type = 'Auto') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_cust_name WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__customer/sparql> {\n    SELECT DISTINCT ?T1 ?T1_cust_name ?T3 ?T3_cust_name WHERE {\n      ?T1 a :customer .\n      ?T1 :customer\\#cust_name ?T1_cust_name .\n      ?T3 a :customer .\n      ?T3 :customer\\#cust_name ?T3_cust_name\n      FILTER (?T1_cust_name in (?T3_cust_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-cust_id ?T1 .\n      ?T2 :loan\\#loan_type ?T2_loan_type .\n      ?T4 a :loan .\n      ?T4 :loan\\#ref-cust_id ?T3 .\n      ?T4 :loan\\#loan_type ?T4_loan_type\n      FILTER(?T2_loan_type = 'Mortgages')\n      FILTER(?T4_loan_type = 'Auto')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1327",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the total amount of loans offered by each bank branch.",
    "original_sparql": "SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_198 ) ?T2_bname WHERE { ?T1 a :loan . ?T2 a :bank . ?T1 :loan\\#ref-branch_id ?T2 .  ?T1 :loan\\#amount ?T1_amount . ?T2 :bank\\#bname ?T2_bname .        } GROUP BY ?T2_bname",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_amount) as ?aggregation_T1_amount_198 ) ?T2_bname WHERE {\n  {\n    SELECT ?T1 ?T1_amount ?T2 ?T2_bname WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__bank/sparql> {\n    SELECT DISTINCT ?T2 ?T2_bname WHERE {\n      ?T2 a :bank .\n      ?T2 :bank\\#bname ?T2_bname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T1 a :loan .\n      ?T1 :loan\\#ref-branch_id ?T2 .\n      ?T1 :loan\\#amount ?T1_amount\n  }\n    }\n  }\n}\nGROUP BY ?T2_bname",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1329",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the name of customers who have more than one loan.",
    "original_sparql": "SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\\#ref-cust_id ?T1 .  ?T1 :customer\\#cust_name ?T1_cust_name .        } GROUP BY ?T1_cust_name   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_cust_name WHERE {\n  {\n    SELECT ?T1 ?T1_cust_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__customer/sparql> {\n    SELECT DISTINCT ?T1 ?T1_cust_name WHERE {\n      ?T1 a :customer .\n      ?T1 :customer\\#cust_name ?T1_cust_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-cust_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_cust_name   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1331",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the name and account balance of the customers who have loans with a total amount of more than 5000.",
    "original_sparql": "SELECT ?T1_cust_name ?T1_acc_type WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\\#ref-cust_id ?T1 .  ?T1 :customer\\#cust_name ?T1_cust_name . ?T1 :customer\\#acc_type ?T1_acc_type . ?T2 :loan\\#amount ?T2_amount .        } GROUP BY ?T1_cust_name ?T1_acc_type   HAVING(sum( ?T2_amount)  > 5000)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_cust_name ?T1_acc_type WHERE {\n  {\n    SELECT ?T1 ?T1_acc_type ?T1_cust_name ?T2 ?T2_amount WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__customer/sparql> {\n    SELECT DISTINCT ?T1 ?T1_acc_type ?T1_cust_name WHERE {\n      ?T1 a :customer .\n      ?T1 :customer\\#cust_name ?T1_cust_name .\n      ?T1 :customer\\#acc_type ?T1_acc_type\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-cust_id ?T1 .\n      ?T2 :loan\\#amount ?T2_amount\n  }\n    }\n  }\n}\nGROUP BY ?T1_cust_name ?T1_acc_type   HAVING(sum( ?T2_amount)  > 5000)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1333",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the name of bank branch that provided the greatest total amount of loans.",
    "original_sparql": "SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\\#ref-branch_id ?T1 .  ?T1 :bank\\#bname ?T1_bname . ?T2 :loan\\#amount ?T2_amount .        } GROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_85 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_bname WHERE {\n  {\n    SELECT ?T1 ?T1_bname ?T2 ?T2_amount WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__bank/sparql> {\n    SELECT DISTINCT ?T1 ?T1_bname WHERE {\n      ?T1 a :bank .\n      ?T1 :bank\\#bname ?T1_bname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-branch_id ?T1 .\n      ?T2 :loan\\#amount ?T2_amount\n  }\n    }\n  }\n}\nGROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_85 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "loan_1_1335",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the name of bank branch that provided the greatest total amount of loans to customers with credit score is less than 100.",
    "original_sparql": "SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\\#ref-branch_id ?T1 .  ?T1 :bank\\#bname ?T1_bname . ?T2 :loan\\#amount ?T2_amount . ?T3 :customer\\#credit_score ?T3_credit_score . ?T3 a :customer . ?T2 :loan\\#ref-cust_id ?T3 .  ?T1 :bank\\#bname ?T1_bname . ?T2 :loan\\#amount ?T2_amount . ?T3 :customer\\#credit_score ?T3_credit_score . FILTER(?T3_credit_score < 100) .        } GROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_144 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_bname WHERE {\n  {\n    SELECT ?T1 ?T1_bname ?T2 ?T2_amount ?T3 ?T3_credit_score WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__bank/sparql> {\n    SELECT DISTINCT ?T1 ?T1_bname WHERE {\n      ?T1 a :bank .\n      ?T1 :bank\\#bname ?T1_bname .\n      ?T1 :bank\\#bname ?T1_bname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__customer/sparql> {\n    SELECT DISTINCT ?T3 WHERE {\n      ?T3 :customer\\#credit_score ?T3_credit_score .\n      ?T3 a :customer .\n      ?T3 :customer\\#credit_score ?T3_credit_score\n      FILTER(?T3_credit_score < 100)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-branch_id ?T1 .\n      ?T2 :loan\\#amount ?T2_amount .\n      ?T2 :loan\\#ref-cust_id ?T3 .\n      ?T2 :loan\\#amount ?T2_amount\n  }\n    }\n  }\n}\nGROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_144 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "loan_1_1339",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the city and name of bank branches that provide business loans.",
    "original_sparql": "SELECT ?T1_bname ?T1_city WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\\#ref-branch_id ?T1 .  ?T1 :bank\\#bname ?T1_bname . ?T1 :bank\\#city ?T1_city . ?T2 :loan\\#loan_type ?T2_loan_type . FILTER(?T2_loan_type = 'Business') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_bname ?T1_city WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__bank/sparql> {\n    SELECT DISTINCT ?T1 ?T1_bname ?T1_city WHERE {\n      ?T1 a :bank .\n      ?T1 :bank\\#bname ?T1_bname .\n      ?T1 :bank\\#city ?T1_city\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-branch_id ?T1 .\n      ?T2 :loan\\#loan_type ?T2_loan_type\n      FILTER(?T2_loan_type = 'Business')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1341",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the names of bank branches that have provided a loan to any customer whose credit score is below 100.",
    "original_sparql": "SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :customer . ?T2 :customer\\#ref-branch_id ?T1 .  ?T1 :bank\\#bname ?T1_bname . ?T2 :customer\\#credit_score ?T2_credit_score . FILTER(?T2_credit_score < 100) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_bname WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__bank/sparql> {\n    SELECT DISTINCT ?T1 ?T1_bname WHERE {\n      ?T1 a :bank .\n      ?T1 :bank\\#bname ?T1_bname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__customer/sparql> {\n    ?T2 a :customer .\n      ?T2 :customer\\#ref-branch_id ?T1 .\n      ?T2 :customer\\#credit_score ?T2_credit_score\n      FILTER(?T2_credit_score < 100)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1343",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the total amount of loans provided by bank branches in the state of New York.",
    "original_sparql": "SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_23 ) WHERE { ?T1 a :loan . ?T2 a :bank . ?T1 :loan\\#ref-branch_id ?T2 .  ?T1 :loan\\#amount ?T1_amount . ?T2 :bank\\#state ?T2_state . FILTER(?T2_state = 'New York') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_amount) as ?aggregation_T1_amount_23 ) WHERE {\n  {\n    SELECT ?T1 ?T1_amount ?T2 ?T2_state WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__bank/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :bank .\n      ?T2 :bank\\#state ?T2_state\n      FILTER(?T2_state = 'New York')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T1 a :loan .\n      ?T1 :loan\\#ref-branch_id ?T2 .\n      ?T1 :loan\\#amount ?T1_amount\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "loan_1_1345",
    "kg_name": "loan_1",
    "split": "train",
    "question": "Find the average credit score of the customers who have some loan.",
    "original_sparql": "SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_168 ) WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\\#ref-cust_id ?T1 .  ?T1 :customer\\#credit_score ?T1_credit_score . ?T1 :customer\\#cust_id ?T1_cust_id .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_168 ) WHERE {\n  {\n    SELECT ?T1 ?T1_credit_score ?T1_cust_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/loan_1__customer/sparql> {\n    SELECT DISTINCT ?T1 ?T1_credit_score WHERE {\n      ?T1 a :customer .\n      ?T1 :customer\\#credit_score ?T1_credit_score .\n      ?T1 :customer\\#cust_id ?T1_cust_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/loan_1__loan/sparql> {\n    ?T2 a :loan .\n      ?T2 :loan\\#ref-cust_id ?T1\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/bank",
        "url": "http://host.docker.internal:3030/loan_1__bank/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/loan_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/loan",
        "url": "http://host.docker.internal:3030/loan_1__loan/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "local_govt_and_lot_1347",
    "kg_name": "local_govt_and_lot",
    "split": "train",
    "question": "How many residents does each property have? List property id and resident count.",
    "original_sparql": "SELECT ?T1_property_id (count( *) as ?aggregation_all) WHERE { ?T1 a :properties . ?T2 a :residents . ?T2 :residents\\#ref-property_id ?T1 .  ?T1 :properties\\#property_id ?T1_property_id .        } GROUP BY ?T1_property_id",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_property_id (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_property_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__properties/sparql> {\n    SELECT DISTINCT ?T1 ?T1_property_id WHERE {\n      ?T1 a :properties .\n      ?T1 :properties\\#property_id ?T1_property_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/local_govt_and_lot__residents/sparql> {\n    ?T2 a :residents .\n      ?T2 :residents\\#ref-property_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_property_id",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/residents_services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/organizations",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__organizations/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_locations_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_locations_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_event_notes",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_event_notes/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__things/sparql"
      },
      {
        "class": "http://valuenet/ontop/timed_status_of_things",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__timed_status_of_things/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_events",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customer_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/properties",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__properties/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/residents",
        "url": "http://host.docker.internal:3030/local_govt_and_lot__residents/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 11,
      "federated_count": 11,
      "missing": 0,
      "extra": 0
    }
  }
]