[
  {
    "id": "store_product_1948",
    "kg_name": "store_product",
    "split": "train",
    "question": "Find all the stores in the district with the most population.",
    "original_sparql": "SELECT ?T1_store_name WHERE { ?T1 a :store . ?T2 a :store_district . ?T2 :store_district\\#ref-store_id ?T1 .  ?T1 :store\\#store_name ?T1_store_name . ?T2 :store_district\\#district_id ?T2_district_id . FILTER(?T2_district_id = (?T23_city_population)) .       {SELECT ?T23_district_id WHERE { ?T23 a :district . ?T23 :district\\#district_id ?T23_district_id . ?T23 :district\\#city_population ?T23_city_population .        }   ORDER BY DESC (?T23_city_population) LIMIT 1 } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_store_name WHERE {\n  SERVICE <http://host.docker.internal:3030/store_product__store/sparql> {\n    SELECT DISTINCT ?T1 ?T1_store_name WHERE {\n      ?T1 a :store .\n      ?T1 :store\\#store_name ?T1_store_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/store_product__store_district/sparql> {\n    ?T2 a :store_district .\n      ?T2 :store_district\\#ref-store_id ?T1 .\n      ?T2 :store_district\\#district_id ?T2_district_id\n      FILTER(?T2_district_id = (?T23_city_population))\n  }\n  {\n    SELECT ?T23_district_id WHERE {\n      SERVICE <http://host.docker.internal:3030/store_product__district/sparql> {\n        ?T23 a :district . ?T23 :district\\#district_id ?T23_district_id . ?T23 :district\\#city_population ?T23_city_population . } ORDER BY DESC (?T23_city_population) LIMIT 1\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/product",
        "url": "http://host.docker.internal:3030/store_product__product/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_product",
        "url": "http://host.docker.internal:3030/store_product__store_product/sparql"
      },
      {
        "class": "http://valuenet/ontop/district",
        "url": "http://host.docker.internal:3030/store_product__district/sparql"
      },
      {
        "class": "http://valuenet/ontop/store",
        "url": "http://host.docker.internal:3030/store_product__store/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_district",
        "url": "http://host.docker.internal:3030/store_product__store_district/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "store_product_1952",
    "kg_name": "store_product",
    "split": "train",
    "question": "Find the number of stores in each city.",
    "original_sparql": "SELECT ?T1_headquartered_city (count( *) as ?aggregation_all) WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\\#ref-district_id ?T1 .  ?T1 :district\\#headquartered_city ?T1_headquartered_city .        } GROUP BY ?T1_headquartered_city",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_headquartered_city (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_headquartered_city WHERE {\n  SERVICE <http://host.docker.internal:3030/store_product__district/sparql> {\n    SELECT DISTINCT ?T1 ?T1_headquartered_city WHERE {\n      ?T1 a :district .\n      ?T1 :district\\#headquartered_city ?T1_headquartered_city\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/store_product__store_district/sparql> {\n    ?T13 a :store_district .\n      ?T13 :store_district\\#ref-district_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_headquartered_city",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/product",
        "url": "http://host.docker.internal:3030/store_product__product/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_product",
        "url": "http://host.docker.internal:3030/store_product__store_product/sparql"
      },
      {
        "class": "http://valuenet/ontop/district",
        "url": "http://host.docker.internal:3030/store_product__district/sparql"
      },
      {
        "class": "http://valuenet/ontop/store",
        "url": "http://host.docker.internal:3030/store_product__store/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_district",
        "url": "http://host.docker.internal:3030/store_product__store_district/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "store_product_1958",
    "kg_name": "store_product",
    "split": "train",
    "question": "Find the names of districts where have both city mall and village store type stores.",
    "original_sparql": "SELECT DISTINCT ?T1_district_name WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\\#ref-district_id ?T1 .  ?T1 :district\\#district_name ?T1_district_name . ?T2 :store\\#type ?T2_type . ?T2 a :store . ?T13 :store_district\\#ref-store_id ?T2 .  ?T1 :district\\#district_name ?T1_district_name . ?T2 :store\\#type ?T2_type . FILTER(?T2_type = 'City Mall') . FILTER (?T1_district_name in (?T3_district_name)) .   ?T3 a :district . ?T15 a :store_district . ?T15 :store_district\\#ref-district_id ?T3 .  ?T3 :district\\#district_name ?T3_district_name . ?T4 :store\\#type ?T4_type . ?T4 a :store . ?T15 :store_district\\#ref-store_id ?T4 .  ?T3 :district\\#district_name ?T3_district_name . ?T4 :store\\#type ?T4_type .  FILTER(?T4_type = 'Village Store') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_district_name WHERE {\n  SERVICE <http://host.docker.internal:3030/store_product__district/sparql> {\n    SELECT DISTINCT ?T1 ?T1_district_name ?T3 ?T3_district_name WHERE {\n      ?T1 a :district .\n      ?T1 :district\\#district_name ?T1_district_name .\n      ?T1 :district\\#district_name ?T1_district_name .\n      ?T3 a :district .\n      ?T3 :district\\#district_name ?T3_district_name .\n      ?T3 :district\\#district_name ?T3_district_name\n      FILTER (?T1_district_name in (?T3_district_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/store_product__store/sparql> {\n    SELECT DISTINCT ?T2 ?T2_type ?T4 ?T4_type WHERE {\n      ?T2 :store\\#type ?T2_type .\n      ?T2 a :store .\n      ?T2 :store\\#type ?T2_type .\n      ?T4 :store\\#type ?T4_type .\n      ?T4 a :store .\n      ?T4 :store\\#type ?T4_type\n      FILTER(?T2_type = 'City Mall')\n      FILTER(?T4_type = 'Village Store')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/store_product__store_district/sparql> {\n    ?T13 a :store_district .\n      ?T13 :store_district\\#ref-district_id ?T1 .\n      ?T13 :store_district\\#ref-store_id ?T2 .\n      ?T15 a :store_district .\n      ?T15 :store_district\\#ref-district_id ?T3 .\n      ?T15 :store_district\\#ref-store_id ?T4\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/product",
        "url": "http://host.docker.internal:3030/store_product__product/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_product",
        "url": "http://host.docker.internal:3030/store_product__store_product/sparql"
      },
      {
        "class": "http://valuenet/ontop/district",
        "url": "http://host.docker.internal:3030/store_product__district/sparql"
      },
      {
        "class": "http://valuenet/ontop/store",
        "url": "http://host.docker.internal:3030/store_product__store/sparql"
      },
      {
        "class": "http://valuenet/ontop/store_district",
        "url": "http://host.docker.internal:3030/store_product__store_district/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "storm_record_1960",
    "kg_name": "storm_record",
    "split": "train",
    "question": "Show the name for regions and the number of storms for each region.",
    "original_sparql": "SELECT ?T1_region_name (count( *) as ?aggregation_all) WHERE { ?T1 a :region . ?T2 a :affected_region . ?T2 :affected_region\\#ref-region_id ?T1 .  ?T1 :region\\#region_name ?T1_region_name .        } GROUP BY ?T1_region_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_region_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_region_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__region/sparql> {\n    SELECT DISTINCT ?T1 ?T1_region_name WHERE {\n      ?T1 a :region .\n      ?T1 :region\\#region_name ?T1_region_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T2 a :affected_region .\n      ?T2 :affected_region\\#ref-region_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_region_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "storm_record_1962",
    "kg_name": "storm_record",
    "split": "train",
    "question": "List the name for storms and the number of affected regions for each storm.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\\#ref-storm_id ?T1 .  ?T1 :storm\\#name ?T1_name .        } GROUP BY ?T1_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__storm/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :storm .\n      ?T1 :storm\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T2 a :affected_region .\n      ?T2 :affected_region\\#ref-storm_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "storm_record_1965",
    "kg_name": "storm_record",
    "split": "train",
    "question": "Return the name and max speed of the storm that affected the most regions.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_max_speed WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\\#ref-storm_id ?T1 .  ?T1 :storm\\#name ?T1_name . ?T1 :storm\\#max_speed ?T1_max_speed .        } GROUP BY ?T1_name ?T1_max_speed  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) ?T1_max_speed WHERE {\n  {\n    SELECT ?T1 ?T1_max_speed ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__storm/sparql> {\n    SELECT DISTINCT ?T1 ?T1_max_speed ?T1_name WHERE {\n      ?T1 a :storm .\n      ?T1 :storm\\#name ?T1_name .\n      ?T1 :storm\\#max_speed ?T1_max_speed\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T2 a :affected_region .\n      ?T2 :affected_region\\#ref-storm_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name ?T1_max_speed  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "storm_record_1966",
    "kg_name": "storm_record",
    "split": "train",
    "question": "Show storm name with at least two regions and 10 cities affected.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\\#ref-storm_id ?T1 .  ?T1 :storm\\#name ?T1_name . FILTER (?T1_name in (?T3_name)) .   ?T3 a :storm . ?T4 a :affected_region . ?T4 :affected_region\\#ref-storm_id ?T3 .  ?T3 :storm\\#name ?T3_name . ?T4 :affected_region\\#number_city_affected ?T4_number_city_affected .     GROUP BY ?T3_name   HAVING(sum( ?T4_number_city_affected)  >= 10)      } GROUP BY ?T1_name   HAVING(count( *)  >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 ?T3 ?T3_name ?T4 ?T4_number_city_affected WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__storm/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T3 ?T3_name WHERE {\n      ?T1 a :storm .\n      ?T1 :storm\\#name ?T1_name .\n      ?T3 a :storm .\n      ?T3 :storm\\#name ?T3_name\n      FILTER (?T1_name in (?T3_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T2 a :affected_region .\n      ?T2 :affected_region\\#ref-storm_id ?T1 .\n      ?T4 a :affected_region .\n      ?T4 :affected_region\\#ref-storm_id ?T3 .\n      ?T4 :affected_region\\#number_city_affected ?T4_number_city_affected\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  >= 2) GROUP BY ?T3_name   HAVING(sum( ?T4_number_city_affected)  >= 10)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "storm_record_1969",
    "kg_name": "storm_record",
    "split": "train",
    "question": "Return the names of the regions affected by storms that had a death count of at least 10.",
    "original_sparql": "SELECT ?T1_region_name WHERE { ?T1 a :region . ?T13 a :affected_region . ?T13 :affected_region\\#ref-region_id ?T1 .  ?T1 :region\\#region_name ?T1_region_name . ?T2 :storm\\#number_deaths ?T2_number_deaths . ?T2 a :storm . ?T13 :affected_region\\#ref-storm_id ?T2 .  ?T1 :region\\#region_name ?T1_region_name . ?T2 :storm\\#number_deaths ?T2_number_deaths . FILTER(?T2_number_deaths >= 10) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_region_name WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__region/sparql> {\n    SELECT DISTINCT ?T1 ?T1_region_name WHERE {\n      ?T1 a :region .\n      ?T1 :region\\#region_name ?T1_region_name .\n      ?T1 :region\\#region_name ?T1_region_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__storm/sparql> {\n    SELECT DISTINCT ?T2 ?T2_number_deaths WHERE {\n      ?T2 :storm\\#number_deaths ?T2_number_deaths .\n      ?T2 a :storm .\n      ?T2 :storm\\#number_deaths ?T2_number_deaths\n      FILTER(?T2_number_deaths >= 10)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T13 a :affected_region .\n      ?T13 :affected_region\\#ref-region_id ?T1 .\n      ?T13 :affected_region\\#ref-storm_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "storm_record_1970",
    "kg_name": "storm_record",
    "split": "train",
    "question": "Show all storm names affecting region 'Denmark'.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :storm . ?T13 a :affected_region . ?T13 :affected_region\\#ref-storm_id ?T1 .  ?T1 :storm\\#name ?T1_name . ?T2 :region\\#region_name ?T2_region_name . ?T2 a :region . ?T13 :affected_region\\#ref-region_id ?T2 .  ?T1 :storm\\#name ?T1_name . ?T2 :region\\#region_name ?T2_region_name . FILTER(?T2_region_name = 'Denmark') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__storm/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :storm .\n      ?T1 :storm\\#name ?T1_name .\n      ?T1 :storm\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__region/sparql> {\n    SELECT DISTINCT ?T2 ?T2_region_name WHERE {\n      ?T2 :region\\#region_name ?T2_region_name .\n      ?T2 a :region .\n      ?T2 :region\\#region_name ?T2_region_name\n      FILTER(?T2_region_name = 'Denmark')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T13 a :affected_region .\n      ?T13 :affected_region\\#ref-storm_id ?T1 .\n      ?T13 :affected_region\\#ref-region_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "storm_record_1974",
    "kg_name": "storm_record",
    "split": "train",
    "question": "Find the names of the regions which were affected by the storm that killed the greatest number of people.",
    "original_sparql": "SELECT ?T1_region_name WHERE { ?T1 a :region . ?T13 a :affected_region . ?T13 :affected_region\\#ref-region_id ?T1 .  ?T1 :region\\#region_name ?T1_region_name . ?T2 :storm\\#number_deaths ?T2_number_deaths . ?T2 a :storm . ?T13 :affected_region\\#ref-storm_id ?T2 .  ?T1 :region\\#region_name ?T1_region_name . ?T2 :storm\\#number_deaths ?T2_number_deaths .        }   ORDER BY DESC (?T2_number_deaths) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_region_name WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__region/sparql> {\n    SELECT DISTINCT ?T1 ?T1_region_name WHERE {\n      ?T1 a :region .\n      ?T1 :region\\#region_name ?T1_region_name .\n      ?T1 :region\\#region_name ?T1_region_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__storm/sparql> {\n    SELECT DISTINCT ?T2 ?T2_number_deaths WHERE {\n      ?T2 :storm\\#number_deaths ?T2_number_deaths .\n      ?T2 a :storm .\n      ?T2 :storm\\#number_deaths ?T2_number_deaths\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T13 a :affected_region .\n      ?T13 :affected_region\\#ref-region_id ?T1 .\n      ?T13 :affected_region\\#ref-storm_id ?T2\n  }\n}\nORDER BY DESC (?T2_number_deaths) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "storm_record_1976",
    "kg_name": "storm_record",
    "split": "train",
    "question": "Find the name of the storm that affected both Afghanistan and Albania regions.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :storm . ?T13 a :affected_region . ?T13 :affected_region\\#ref-storm_id ?T1 .  ?T1 :storm\\#name ?T1_name . ?T2 :region\\#region_name ?T2_region_name . ?T2 a :region . ?T13 :affected_region\\#ref-region_id ?T2 .  ?T1 :storm\\#name ?T1_name . ?T2 :region\\#region_name ?T2_region_name . FILTER(?T2_region_name = 'Afghanistan') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :storm . ?T15 a :affected_region . ?T15 :affected_region\\#ref-storm_id ?T3 .  ?T3 :storm\\#name ?T3_name . ?T4 :region\\#region_name ?T4_region_name . ?T4 a :region . ?T15 :affected_region\\#ref-region_id ?T4 .  ?T3 :storm\\#name ?T3_name . ?T4 :region\\#region_name ?T4_region_name .  FILTER(?T4_region_name = 'Albania') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/storm_record__storm/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T3 ?T3_name WHERE {\n      ?T1 a :storm .\n      ?T1 :storm\\#name ?T1_name .\n      ?T1 :storm\\#name ?T1_name .\n      ?T3 a :storm .\n      ?T3 :storm\\#name ?T3_name .\n      ?T3 :storm\\#name ?T3_name\n      FILTER (?T1_name in (?T3_name))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__region/sparql> {\n    SELECT DISTINCT ?T2 ?T2_region_name ?T4 ?T4_region_name WHERE {\n      ?T2 :region\\#region_name ?T2_region_name .\n      ?T2 a :region .\n      ?T2 :region\\#region_name ?T2_region_name .\n      ?T4 :region\\#region_name ?T4_region_name .\n      ?T4 a :region .\n      ?T4 :region\\#region_name ?T4_region_name\n      FILTER(?T2_region_name = 'Afghanistan')\n      FILTER(?T4_region_name = 'Albania')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/storm_record__affected_region/sparql> {\n    ?T13 a :affected_region .\n      ?T13 :affected_region\\#ref-storm_id ?T1 .\n      ?T13 :affected_region\\#ref-region_id ?T2 .\n      ?T15 a :affected_region .\n      ?T15 :affected_region\\#ref-storm_id ?T3 .\n      ?T15 :affected_region\\#ref-region_id ?T4\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/affected_region",
        "url": "http://host.docker.internal:3030/storm_record__affected_region/sparql"
      },
      {
        "class": "http://valuenet/ontop/storm",
        "url": "http://host.docker.internal:3030/storm_record__storm/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/storm_record__region/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "student_assessment_1997",
    "kg_name": "student_assessment",
    "split": "train",
    "question": "List the id of students who registered course statistics in the order of registration date.",
    "original_sparql": "SELECT ?T1_student_id WHERE { ?T1 a :student_course_registrations . ?T2 a :courses . ?T1 :student_course_registrations\\#ref-course_id ?T2 .  ?T1 :student_course_registrations\\#student_id ?T1_student_id . ?T1 :student_course_registrations\\#registration_date ?T1_registration_date . ?T2 :courses\\#course_name ?T2_course_name . FILTER(?T2_course_name = 'statistics') .        }  ORDER BY ASC (?T1_registration_date)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_student_id WHERE {\n  SERVICE <http://host.docker.internal:3030/student_assessment__courses/sparql> {\n    SELECT DISTINCT ?T2 ?T2_course_name WHERE {\n      ?T2 a :courses .\n      ?T2 :courses\\#course_name ?T2_course_name\n      FILTER(?T2_course_name = 'statistics')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/student_assessment__student_course_registrations/sparql> {\n    ?T1 a :student_course_registrations .\n      ?T1 :student_course_registrations\\#ref-course_id ?T2 .\n      ?T1 :student_course_registrations\\#student_id ?T1_student_id .\n      ?T1 :student_course_registrations\\#registration_date ?T1_registration_date\n  }\n}\nORDER BY ASC (?T1_registration_date)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/candidate_assessments",
        "url": "http://host.docker.internal:3030/student_assessment__candidate_assessments/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/student_assessment__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/student_assessment__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/student_assessment__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_course_attendance",
        "url": "http://host.docker.internal:3030/student_assessment__student_course_attendance/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_course_registrations",
        "url": "http://host.docker.internal:3030/student_assessment__student_course_registrations/sparql"
      },
      {
        "class": "http://valuenet/ontop/people_addresses",
        "url": "http://host.docker.internal:3030/student_assessment__people_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/candidates",
        "url": "http://host.docker.internal:3030/student_assessment__candidates/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/student_assessment__students/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "student_assessment_1999",
    "kg_name": "student_assessment",
    "split": "train",
    "question": "List the id of students who attended  statistics courses in the order of attendance date.",
    "original_sparql": "SELECT ?T1_student_id WHERE { ?T1 a :student_course_attendance . ?T13 a :student_course_registrations . ?T1 :student_course_attendance\\#ref-student_id ?T13 .  ?T1 :student_course_attendance\\#student_id ?T1_student_id . ?T1 :student_course_attendance\\#date_of_attendance ?T1_date_of_attendance . ?T2 :courses\\#course_name ?T2_course_name . ?T2 a :courses . ?T13 :student_course_registrations\\#ref-course_id ?T2 .  ?T1 :student_course_attendance\\#student_id ?T1_student_id . ?T1 :student_course_attendance\\#date_of_attendance ?T1_date_of_attendance . ?T2 :courses\\#course_name ?T2_course_name . FILTER(?T2_course_name = 'statistics') .        }  ORDER BY ASC (?T1_date_of_attendance)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_student_id WHERE {\n  SERVICE <http://host.docker.internal:3030/student_assessment__student_course_registrations/sparql> {\n    SELECT DISTINCT ?T13 ?T2 WHERE {\n      ?T13 a :student_course_registrations .\n      ?T13 :student_course_registrations\\#ref-course_id ?T2\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/student_assessment__courses/sparql> {\n    SELECT DISTINCT ?T2 ?T2_course_name WHERE {\n      ?T2 :courses\\#course_name ?T2_course_name .\n      ?T2 a :courses .\n      ?T2 :courses\\#course_name ?T2_course_name\n      FILTER(?T2_course_name = 'statistics')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/student_assessment__student_course_attendance/sparql> {\n    ?T1 a :student_course_attendance .\n      ?T1 :student_course_attendance\\#ref-student_id ?T13 .\n      ?T1 :student_course_attendance\\#student_id ?T1_student_id .\n      ?T1 :student_course_attendance\\#date_of_attendance ?T1_date_of_attendance .\n      ?T1 :student_course_attendance\\#student_id ?T1_student_id .\n      ?T1 :student_course_attendance\\#date_of_attendance ?T1_date_of_attendance\n  }\n}\nORDER BY ASC (?T1_date_of_attendance)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/candidate_assessments",
        "url": "http://host.docker.internal:3030/student_assessment__candidate_assessments/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/student_assessment__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/student_assessment__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/student_assessment__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_course_attendance",
        "url": "http://host.docker.internal:3030/student_assessment__student_course_attendance/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_course_registrations",
        "url": "http://host.docker.internal:3030/student_assessment__student_course_registrations/sparql"
      },
      {
        "class": "http://valuenet/ontop/people_addresses",
        "url": "http://host.docker.internal:3030/student_assessment__people_addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/candidates",
        "url": "http://host.docker.internal:3030/student_assessment__candidates/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/student_assessment__students/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  }
]