[
  {
    "id": "college_1_375",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find names of all students who took some course and the course description.",
    "original_sparql": "SELECT ?T1_stu_fname ?T1_stu_lname ?T2_crs_description WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\\#ref-dept_name ?T13 .  ?T1 :student\\#stu_fname ?T1_stu_fname . ?T1 :student\\#stu_lname ?T1_stu_lname . ?T2 :course\\#crs_description ?T2_crs_description . ?T2 a :course . ?T2 :course\\#ref-dept_code ?T13 .  ?T1 :student\\#stu_fname ?T1_stu_fname . ?T1 :student\\#stu_lname ?T1_stu_lname . ?T2 :course\\#crs_description ?T2_crs_description .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_stu_fname ?T1_stu_lname ?T2_crs_description WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :department\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__student/sparql> {\n    ?T1 a :student .\n      ?T1 :student\\#ref-dept_name ?T13 .\n      ?T1 :student\\#stu_fname ?T1_stu_fname .\n      ?T1 :student\\#stu_lname ?T1_stu_lname .\n      ?T1 :student\\#stu_fname ?T1_stu_fname .\n      ?T1 :student\\#stu_lname ?T1_stu_lname\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__course/sparql> {\n    ?T2 :course\\#crs_description ?T2_crs_description .\n      ?T2 a :course .\n      ?T2 :course\\#ref-dept_code ?T13 .\n      ?T2 :course\\#crs_description ?T2_crs_description\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_377",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find names of all students who took some course and got A or C.",
    "original_sparql": "SELECT ?T1_stu_fname ?T1_stu_lname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\\#ref-stu_num ?T1 .  ?T1 :student\\#stu_fname ?T1_stu_fname . ?T1 :student\\#stu_lname ?T1_stu_lname . ?T2 :enroll\\#enroll_grade ?T2_enroll_grade . ?T2 :enroll\\#enroll_grade ?T2_enroll_grade . FILTER(?T2_enroll_grade = 'C' || ?T2_enroll_grade = 'A') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_stu_fname ?T1_stu_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_stu_fname ?T1_stu_lname WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#stu_fname ?T1_stu_fname .\n      ?T1 :student\\#stu_lname ?T1_stu_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__enroll/sparql> {\n    ?T2 a :enroll .\n      ?T2 :enroll\\#ref-stu_num ?T1 .\n      ?T2 :enroll\\#enroll_grade ?T2_enroll_grade .\n      ?T2 :enroll\\#enroll_grade ?T2_enroll_grade\n      FILTER(?T2_enroll_grade = 'C' || ?T2_enroll_grade = 'A')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_379",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names of all professors in the Accounting department who is teaching some course and the class room.",
    "original_sparql": "SELECT ?T1_emp_fname ?T2_class_room WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\\#ref-prof_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :class\\#class_room ?T2_class_room . ?T3 :department\\#dept_name ?T3_dept_name . ?T3 a :department . ?T3 :department\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :class\\#class_room ?T2_class_room . ?T3 :department\\#dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Accounting') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname ?T2_class_room WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__class/sparql> {\n    ?T2 a :class .\n      ?T2 :class\\#ref-prof_num ?T1 .\n      ?T2 :class\\#class_room ?T2_class_room .\n      ?T2 :class\\#class_room ?T2_class_room\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    ?T3 :department\\#dept_name ?T3_dept_name .\n      ?T3 a :department .\n      ?T3 :department\\#ref-emp_num ?T1 .\n      ?T3 :department\\#dept_name ?T3_dept_name\n      FILTER(?T3_dept_name = 'Accounting')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_381",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names and degree of all professors who are teaching some class in Computer Info. Systems department.",
    "original_sparql": "SELECT DISTINCT ?T1_emp_fname ?T2_prof_high_degree WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree . ?T3 :department\\#dept_name ?T3_dept_name . ?T3 a :department . ?T2 :professor\\#ref-dept_code ?T3 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree . ?T3 :department\\#dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Computer Info. Systems') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_emp_fname ?T2_prof_high_degree WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__department/sparql> {\n    SELECT DISTINCT ?T3 ?T3_dept_name WHERE {\n      ?T3 :department\\#dept_name ?T3_dept_name .\n      ?T3 a :department .\n      ?T3 :department\\#dept_name ?T3_dept_name\n      FILTER(?T3_dept_name = 'Computer Info. Systems')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__professor/sparql> {\n    ?T2 a :professor .\n      ?T2 :professor\\#ref-emp_num ?T1 .\n      ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree .\n      ?T2 :professor\\#ref-dept_code ?T3 .\n      ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_383",
    "kg_name": "college_1",
    "split": "train",
    "question": "What is the last name of the student who got a grade A in the class with code 10018.",
    "original_sparql": "SELECT ?T1_stu_lname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\\#ref-stu_num ?T1 .  ?T1 :student\\#stu_lname ?T1_stu_lname . ?T2 :enroll\\#enroll_grade ?T2_enroll_grade . ?T2 :enroll\\#class_code ?T2_class_code . FILTER(?T2_enroll_grade = 'A' && ?T2_class_code = '10018') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_stu_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_stu_lname WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#stu_lname ?T1_stu_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__enroll/sparql> {\n    ?T2 a :enroll .\n      ?T2 :enroll\\#ref-stu_num ?T1 .\n      ?T2 :enroll\\#enroll_grade ?T2_enroll_grade .\n      ?T2 :enroll\\#class_code ?T2_class_code\n      FILTER(?T2_enroll_grade = 'A' && ?T2_class_code = '10018')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_387",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names of professors who are teaching more than one class.",
    "original_sparql": "SELECT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\\#ref-prof_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname .        } GROUP BY ?T1_emp_fname   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_emp_fname WHERE {\n  {\n    SELECT ?T1 ?T1_emp_fname ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__employee/sparql> {\n    SELECT DISTINCT ?T1 ?T1_emp_fname WHERE {\n      ?T1 a :employee .\n      ?T1 :employee\\#emp_fname ?T1_emp_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__class/sparql> {\n    ?T2 a :class .\n      ?T2 :class\\#ref-prof_num ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_emp_fname   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_1_389",
    "kg_name": "college_1",
    "split": "train",
    "question": "Find the first names of students who took exactly one class.",
    "original_sparql": "SELECT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\\#ref-stu_num ?T1 .  ?T1 :student\\#stu_fname ?T1_stu_fname .        } GROUP BY ?T1_stu_fname   HAVING(count( *)  = 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_stu_fname WHERE {\n  {\n    SELECT ?T1 ?T1_stu_fname ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/college_1__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_stu_fname WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#stu_fname ?T1_stu_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_1__enroll/sparql> {\n    ?T2 a :enroll .\n      ?T2 :enroll\\#ref-stu_num ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_stu_fname   HAVING(count( *)  = 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/professor",
        "url": "http://host.docker.internal:3030/college_1__professor/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_1__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/class",
        "url": "http://host.docker.internal:3030/college_1__class/sparql"
      },
      {
        "class": "http://valuenet/ontop/employee",
        "url": "http://host.docker.internal:3030/college_1__employee/sparql"
      },
      {
        "class": "http://valuenet/ontop/enroll",
        "url": "http://host.docker.internal:3030/college_1__enroll/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_1__student/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_399",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the name of students who took any class in the years of 2009 and 2010.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :student . ?T2 a :takes . ?T2 :takes\\#ref-id ?T1 .  ?T1 :student\\#name ?T1_name . ?T2 :takes\\#year ?T2_year . ?T2 :takes\\#year ?T2_year . FILTER(?T2_year = 2009 || ?T2_year = 2010) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__takes/sparql> {\n    ?T2 a :takes .\n      ?T2 :takes\\#ref-id ?T1 .\n      ?T2 :takes\\#year ?T2_year .\n      ?T2 :takes\\#year ?T2_year\n      FILTER(?T2_year = 2009 || ?T2_year = 2010)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1524,
      "federated_count": 1524,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_401",
    "kg_name": "college_2",
    "split": "train",
    "question": "list in alphabetic order all course names and their instructors' names in year 2008.",
    "original_sparql": "SELECT ?T1_title ?T2_name WHERE { ?T1 a :course . ?T14 a :department . ?T1 :course\\#ref-dept_code ?T14 .  ?T1 :course\\#title ?T1_title . ?T2 :instructor\\#name ?T2_name . ?T1 :course\\#title ?T1_title . ?T3 :teaches\\#year ?T3_year . ?T2 a :instructor . ?T2 :instructor\\#ref-dept_name ?T14 .  ?T1 :course\\#title ?T1_title . ?T2 :instructor\\#name ?T2_name . ?T1 :course\\#title ?T1_title . ?T3 :teaches\\#year ?T3_year . ?T3 a :teaches . ?T3 :teaches\\#ref-id ?T2 .  ?T1 :course\\#title ?T1_title . ?T2 :instructor\\#name ?T2_name . ?T1 :course\\#title ?T1_title . ?T3 :teaches\\#year ?T3_year . FILTER(?T3_year = 2008) .        }  ORDER BY ASC (?T1_title)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__department/sparql> {\n    SELECT DISTINCT ?T14 WHERE {\n      ?T14 a :department\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__instructor/sparql> {\n    SELECT DISTINCT ?T14 ?T2 ?T2_name WHERE {\n      ?T2 :instructor\\#name ?T2_name .\n      ?T2 a :instructor .\n      ?T2 :instructor\\#ref-dept_name ?T14 .\n      ?T2 :instructor\\#name ?T2_name .\n      ?T2 :instructor\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__course/sparql> {\n    ?T1 a :course .\n      ?T1 :course\\#ref-dept_code ?T14 .\n      ?T1 :course\\#title ?T1_title .\n      ?T1 :course\\#title ?T1_title .\n      ?T1 :course\\#title ?T1_title .\n      ?T1 :course\\#title ?T1_title .\n      ?T1 :course\\#title ?T1_title .\n      ?T1 :course\\#title ?T1_title\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__teaches/sparql> {\n    ?T3 :teaches\\#year ?T3_year .\n      ?T3 :teaches\\#year ?T3_year .\n      ?T3 a :teaches .\n      ?T3 :teaches\\#ref-id ?T2 .\n      ?T3 :teaches\\#year ?T3_year\n      FILTER(?T3_year = 2008)\n  }\n}\nORDER BY ASC (?T1_title)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_403",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the name of instructors who are advising more than one student.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :instructor . ?T2 a :advisor . ?T2 :advisor\\#ref-i_id ?T1 .  ?T1 :instructor\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__instructor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :instructor .\n      ?T1 :instructor\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__advisor/sparql> {\n    ?T2 a :advisor .\n      ?T2 :advisor\\#ref-i_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 50,
      "federated_count": 50,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_408",
    "kg_name": "college_2",
    "split": "train",
    "question": "Give id of the instructor who advises students in the History department.",
    "original_sparql": "SELECT ?T1_i_id WHERE { ?T1 a :advisor . ?T2 a :student . ?T1 :advisor\\#ref-s_id ?T2 .  ?T1 :advisor\\#i_id ?T1_i_id . ?T2 :student\\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'History') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_i_id WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__student/sparql> {\n    SELECT DISTINCT ?T2 ?T2_dept_name WHERE {\n      ?T2 a :student .\n      ?T2 :student\\#dept_name ?T2_dept_name\n      FILTER(?T2_dept_name = 'History')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__advisor/sparql> {\n    ?T1 a :advisor .\n      ?T1 :advisor\\#ref-s_id ?T2 .\n      ?T1 :advisor\\#i_id ?T1_i_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 47,
      "federated_count": 47,
      "missing": 0,
      "extra": 0
    }
  }
]