[
  {
    "id": "cre_drama_workshop_groups_585",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Find the description and code of the service type that is performed the most times.",
    "original_sparql": "SELECT ?T1_service_type_description (count( *) as ?aggregation_all) ?T1_service_type_code WHERE { ?T1 a :ref_service_types . ?T2 a :services . ?T2 :services\\#ref-service_type_code ?T1 .  ?T1 :ref_service_types\\#service_type_description ?T1_service_type_description . ?T1 :ref_service_types\\#service_type_code ?T1_service_type_code .        } GROUP BY ?T1_service_type_description ?T1_service_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_service_type_description (count( *) as ?aggregation_all) ?T1_service_type_code WHERE {\n  {\n    SELECT ?T1 ?T1_service_type_code ?T1_service_type_description ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql> {\n    SELECT DISTINCT ?T1 ?T1_service_type_code ?T1_service_type_description WHERE {\n      ?T1 a :ref_service_types .\n      ?T1 :ref_service_types\\#service_type_description ?T1_service_type_description .\n      ?T1 :ref_service_types\\#service_type_code ?T1_service_type_code\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql> {\n    ?T2 a :services .\n      ?T2 :services\\#ref-service_type_code ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_service_type_description ?T1_service_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_587",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Find the names of the workshop groups where services with product name 'film' are performed.",
    "original_sparql": "SELECT ?T1_store_phone ?T1_store_email_address WHERE { ?T1 a :drama_workshop_groups . ?T2 a :services . ?T2 :services\\#ref-workshop_group_id ?T1 .  ?T1 :drama_workshop_groups\\#store_phone ?T1_store_phone . ?T1 :drama_workshop_groups\\#store_email_address ?T1_store_email_address . ?T2 :services\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'film') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_store_phone ?T1_store_email_address WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql> {\n    SELECT DISTINCT ?T1 ?T1_store_email_address ?T1_store_phone WHERE {\n      ?T1 a :drama_workshop_groups .\n      ?T1 :drama_workshop_groups\\#store_phone ?T1_store_phone .\n      ?T1 :drama_workshop_groups\\#store_email_address ?T1_store_email_address\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql> {\n    ?T2 a :services .\n      ?T2 :services\\#ref-workshop_group_id ?T1 .\n      ?T2 :services\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'film')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_589",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Compute the total order quantities of the product 'photo'.",
    "original_sparql": "SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_150 ) WHERE { ?T1 a :order_items . ?T2 a :products . ?T1 :order_items\\#ref-product_id ?T2 .  ?T1 :order_items\\#order_quantity ?T1_order_quantity . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'photo') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_150 ) WHERE {\n  {\n    SELECT ?T1 ?T1_order_quantity ?T2 ?T2_product_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :products .\n      ?T2 :products\\#product_name ?T2_product_name\n      FILTER(?T2_product_name = 'photo')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql> {\n    ?T1 a :order_items .\n      ?T1 :order_items\\#ref-product_id ?T2 .\n      ?T1 :order_items\\#order_quantity ?T1_order_quantity\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_591",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Find the order detail for the products with price above 2000.",
    "original_sparql": "SELECT ?T1_other_item_details WHERE { ?T1 a :order_items . ?T2 a :products . ?T1 :order_items\\#ref-product_id ?T2 .  ?T1 :order_items\\#other_item_details ?T1_other_item_details . ?T2 :products\\#product_price ?T2_product_price . FILTER(?T2_product_price > 2000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_other_item_details WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_price WHERE {\n      ?T2 a :products .\n      ?T2 :products\\#product_price ?T2_product_price\n      FILTER(?T2_product_price > 2000)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql> {\n    ?T1 a :order_items .\n      ?T1 :order_items\\#ref-product_id ?T2 .\n      ?T1 :order_items\\#other_item_details ?T1_other_item_details\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_593",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "List the actual delivery date for all the orders with quantity 1",
    "original_sparql": "SELECT ?T1_actual_delivery_date WHERE { ?T1 a :customer_orders . ?T2 a :order_items . ?T2 :order_items\\#ref-order_id ?T1 .  ?T1 :customer_orders\\#actual_delivery_date ?T1_actual_delivery_date . ?T2 :order_items\\#order_quantity ?T2_order_quantity . FILTER(?T2_order_quantity = 1) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_actual_delivery_date WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql> {\n    SELECT DISTINCT ?T1 ?T1_actual_delivery_date WHERE {\n      ?T1 a :customer_orders .\n      ?T1 :customer_orders\\#actual_delivery_date ?T1_actual_delivery_date\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql> {\n    ?T2 a :order_items .\n      ?T2 :order_items\\#ref-order_id ?T1 .\n      ?T2 :order_items\\#order_quantity ?T2_order_quantity\n      FILTER(?T2_order_quantity = 1)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_drama_workshop_groups_595",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Find the order dates of the orders with price above 1000.",
    "original_sparql": "SELECT ?T1_order_date WHERE { ?T1 a :customer_orders . ?T13 a :order_items . ?T13 :order_items\\#ref-order_id ?T1 .  ?T1 :customer_orders\\#order_date ?T1_order_date . ?T2 :products\\#product_price ?T2_product_price . ?T2 a :products . ?T13 :order_items\\#ref-product_id ?T2 .  ?T1 :customer_orders\\#order_date ?T1_order_date . ?T2 :products\\#product_price ?T2_product_price . FILTER(?T2_product_price > 1000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_order_date WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql> {\n    SELECT DISTINCT ?T1 ?T1_order_date WHERE {\n      ?T1 a :customer_orders .\n      ?T1 :customer_orders\\#order_date ?T1_order_date .\n      ?T1 :customer_orders\\#order_date ?T1_order_date\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql> {\n    SELECT DISTINCT ?T2 ?T2_product_price WHERE {\n      ?T2 :products\\#product_price ?T2_product_price .\n      ?T2 a :products .\n      ?T2 :products\\#product_price ?T2_product_price\n      FILTER(?T2_product_price > 1000)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql> {\n    ?T13 a :order_items .\n      ?T13 :order_items\\#ref-order_id ?T1 .\n      ?T13 :order_items\\#ref-product_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 10,
      "federated_count": 2,
      "missing": 8,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "cre_drama_workshop_groups_597",
    "kg_name": "cre_drama_workshop_groups",
    "split": "train",
    "question": "Return the the names of the drama workshop groups that are located in Feliciaberg city.",
    "original_sparql": "SELECT ?T1_store_name WHERE { ?T1 a :drama_workshop_groups . ?T2 a :addresses . ?T1 :drama_workshop_groups\\#ref-address_id ?T2 .  ?T1 :drama_workshop_groups\\#store_name ?T1_store_name . ?T2 :addresses\\#city_town ?T2_city_town . FILTER(?T2_city_town = 'Feliciaberg') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_store_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql> {\n    SELECT DISTINCT ?T2 ?T2_city_town WHERE {\n      ?T2 a :addresses .\n      ?T2 :addresses\\#city_town ?T2_city_town\n      FILTER(?T2_city_town = 'Feliciaberg')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql> {\n    ?T1 a :drama_workshop_groups .\n      ?T1 :drama_workshop_groups\\#ref-address_id ?T2 .\n      ?T1 :drama_workshop_groups\\#store_name ?T1_store_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/clients",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__clients/sparql"
      },
      {
        "class": "http://valuenet/ontop/drama_workshop_groups",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__drama_workshop_groups/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoices",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoices/sparql"
      },
      {
        "class": "http://valuenet/ontop/services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__services/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers_in_bookings",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers_in_bookings/sparql"
      },
      {
        "class": "http://valuenet/ontop/performers",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__performers/sparql"
      },
      {
        "class": "http://valuenet/ontop/bookings_services",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__bookings_services/sparql"
      },
      {
        "class": "http://valuenet/ontop/products",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__products/sparql"
      },
      {
        "class": "http://valuenet/ontop/stores",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__stores/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_service_types",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_service_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/marketing_regions",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__marketing_regions/sparql"
      },
      {
        "class": "http://valuenet/ontop/order_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__order_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_orders",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__customer_orders/sparql"
      },
      {
        "class": "http://valuenet/ontop/invoice_items",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__invoice_items/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_payment_methods",
        "url": "http://host.docker.internal:3030/cre_drama_workshop_groups__ref_payment_methods/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]