[
  {
    "id": "party_people_1586",
    "kg_name": "party_people",
    "split": "train",
    "question": "Return the name of the member who is in charge of the most events.",
    "original_sparql": "SELECT ?T1_member_name (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T2 a :party_events . ?T2 :party_events\\#ref-member_in_charge_id ?T1 .  ?T1 :member\\#member_name ?T1_member_name .        } GROUP BY ?T1_member_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_member_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_member_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/party_people__member/sparql> {\n    SELECT DISTINCT ?T1 ?T1_member_name WHERE {\n      ?T1 a :member .\n      ?T1 :member\\#member_name ?T1_member_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/party_people__party_events/sparql> {\n    ?T2 a :party_events .\n      ?T2 :party_events\\#ref-member_in_charge_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_member_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/party_events",
        "url": "http://host.docker.internal:3030/party_people__party_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/party",
        "url": "http://host.docker.internal:3030/party_people__party/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/party_people__region/sparql"
      },
      {
        "class": "http://valuenet/ontop/member",
        "url": "http://host.docker.internal:3030/party_people__member/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "party_people_1588",
    "kg_name": "party_people",
    "split": "train",
    "question": "Count the number of Annual Meeting events that took place in the region of the United Kingdom.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :region . ?T1 :party\\#ref-region_id ?T2 .  ?T2 :region\\#region_name ?T2_region_name . ?T3 :party_events\\#event_name ?T3_event_name . ?T3 a :party_events . ?T3 :party_events\\#ref-party_id ?T1 .  ?T2 :region\\#region_name ?T2_region_name . ?T3 :party_events\\#event_name ?T3_event_name . FILTER(?T2_region_name = 'United Kingdom' && ?T3_event_name = 'Annaual Meeting') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_region_name ?T3 ?T3_event_name WHERE {\n  SERVICE <http://host.docker.internal:3030/party_people__party/sparql> {\n    SELECT DISTINCT ?T1 WHERE {\n      ?T1 a :party\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/party_people__region/sparql> {\n    ?T2 a :region .\n      ?T1 :party\\#ref-region_id ?T2 .\n      ?T2 :region\\#region_name ?T2_region_name .\n      ?T2 :region\\#region_name ?T2_region_name\n      FILTER(?T2_region_name = 'United Kingdom' && ?T3_event_name = 'Annaual Meeting')\n  }\n  SERVICE <http://host.docker.internal:3030/party_people__party_events/sparql> {\n    ?T3 :party_events\\#event_name ?T3_event_name .\n      ?T3 a :party_events .\n      ?T3 :party_events\\#ref-party_id ?T1 .\n      ?T3 :party_events\\#event_name ?T3_event_name\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/party_events",
        "url": "http://host.docker.internal:3030/party_people__party_events/sparql"
      },
      {
        "class": "http://valuenet/ontop/party",
        "url": "http://host.docker.internal:3030/party_people__party/sparql"
      },
      {
        "class": "http://valuenet/ontop/region",
        "url": "http://host.docker.internal:3030/party_people__region/sparql"
      },
      {
        "class": "http://valuenet/ontop/member",
        "url": "http://host.docker.internal:3030/party_people__member/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "performance_attendance_1589",
    "kg_name": "performance_attendance",
    "split": "train",
    "question": "Show the names of members and the location of the performances they attended.",
    "original_sparql": "SELECT ?T1_name ?T2_location WHERE { ?T1 a :member . ?T13 a :member_attendance . ?T13 :member_attendance\\#ref-member_id ?T1 .  ?T1 :member\\#name ?T1_name . ?T2 :performance\\#location ?T2_location . ?T2 a :performance . ?T13 :member_attendance\\#ref-performance_id ?T2 .  ?T1 :member\\#name ?T1_name . ?T2 :performance\\#location ?T2_location .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_location WHERE {\n  SERVICE <http://host.docker.internal:3030/performance_attendance__member/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :member .\n      ?T1 :member\\#name ?T1_name .\n      ?T1 :member\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/performance_attendance__performance/sparql> {\n    SELECT DISTINCT ?T2 ?T2_location WHERE {\n      ?T2 :performance\\#location ?T2_location .\n      ?T2 a :performance .\n      ?T2 :performance\\#location ?T2_location\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/performance_attendance__member_attendance/sparql> {\n    ?T13 a :member_attendance .\n      ?T13 :member_attendance\\#ref-member_id ?T1 .\n      ?T13 :member_attendance\\#ref-performance_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/member_attendance",
        "url": "http://host.docker.internal:3030/performance_attendance__member_attendance/sparql"
      },
      {
        "class": "http://valuenet/ontop/performance",
        "url": "http://host.docker.internal:3030/performance_attendance__performance/sparql"
      },
      {
        "class": "http://valuenet/ontop/member",
        "url": "http://host.docker.internal:3030/performance_attendance__member/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "performance_attendance_1591",
    "kg_name": "performance_attendance",
    "split": "train",
    "question": "Show the dates of performances with attending members whose roles are 'Violin'.",
    "original_sparql": "SELECT ?T1_date WHERE { ?T1 a :performance . ?T13 a :member_attendance . ?T13 :member_attendance\\#ref-performance_id ?T1 .  ?T1 :performance\\#date ?T1_date . ?T2 :member\\#role ?T2_role . ?T2 a :member . ?T13 :member_attendance\\#ref-member_id ?T2 .  ?T1 :performance\\#date ?T1_date . ?T2 :member\\#role ?T2_role . FILTER(?T2_role = 'Violin') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date WHERE {\n  SERVICE <http://host.docker.internal:3030/performance_attendance__performance/sparql> {\n    SELECT DISTINCT ?T1 ?T1_date WHERE {\n      ?T1 a :performance .\n      ?T1 :performance\\#date ?T1_date .\n      ?T1 :performance\\#date ?T1_date\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/performance_attendance__member/sparql> {\n    SELECT DISTINCT ?T2 ?T2_role WHERE {\n      ?T2 :member\\#role ?T2_role .\n      ?T2 a :member .\n      ?T2 :member\\#role ?T2_role\n      FILTER(?T2_role = 'Violin')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/performance_attendance__member_attendance/sparql> {\n    ?T13 a :member_attendance .\n      ?T13 :member_attendance\\#ref-performance_id ?T1 .\n      ?T13 :member_attendance\\#ref-member_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/member_attendance",
        "url": "http://host.docker.internal:3030/performance_attendance__member_attendance/sparql"
      },
      {
        "class": "http://valuenet/ontop/performance",
        "url": "http://host.docker.internal:3030/performance_attendance__performance/sparql"
      },
      {
        "class": "http://valuenet/ontop/member",
        "url": "http://host.docker.internal:3030/performance_attendance__member/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "performance_attendance_1592",
    "kg_name": "performance_attendance",
    "split": "train",
    "question": "Show the names of members and the dates of performances they attended in descending order of attendance of the performances.",
    "original_sparql": "SELECT ?T1_name ?T2_date WHERE { ?T1 a :member . ?T13 a :member_attendance . ?T13 :member_attendance\\#ref-member_id ?T1 .  ?T1 :member\\#name ?T1_name . ?T2 :performance\\#date ?T2_date . ?T2 :performance\\#attendance ?T2_attendance . ?T2 a :performance . ?T13 :member_attendance\\#ref-performance_id ?T2 .  ?T1 :member\\#name ?T1_name . ?T2 :performance\\#date ?T2_date . ?T2 :performance\\#attendance ?T2_attendance .        }  ORDER BY DESC (?T2_attendance)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_date WHERE {\n  SERVICE <http://host.docker.internal:3030/performance_attendance__member/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :member .\n      ?T1 :member\\#name ?T1_name .\n      ?T1 :member\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/performance_attendance__performance/sparql> {\n    SELECT DISTINCT ?T2 ?T2_attendance ?T2_date WHERE {\n      ?T2 :performance\\#date ?T2_date .\n      ?T2 :performance\\#attendance ?T2_attendance .\n      ?T2 a :performance .\n      ?T2 :performance\\#date ?T2_date .\n      ?T2 :performance\\#attendance ?T2_attendance\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/performance_attendance__member_attendance/sparql> {\n    ?T13 a :member_attendance .\n      ?T13 :member_attendance\\#ref-member_id ?T1 .\n      ?T13 :member_attendance\\#ref-performance_id ?T2\n  }\n}\nORDER BY DESC (?T2_attendance)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/member_attendance",
        "url": "http://host.docker.internal:3030/performance_attendance__member_attendance/sparql"
      },
      {
        "class": "http://valuenet/ontop/performance",
        "url": "http://host.docker.internal:3030/performance_attendance__performance/sparql"
      },
      {
        "class": "http://valuenet/ontop/member",
        "url": "http://host.docker.internal:3030/performance_attendance__member/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "perpetrator_1594",
    "kg_name": "perpetrator",
    "split": "train",
    "question": "What is the total kills of the perpetrators with height more than 1.84.",
    "original_sparql": "SELECT (sum( ?T1_killed) as ?aggregation_T1_killed_124 ) WHERE { ?T1 a :perpetrator . ?T2 a :people . ?T1 :perpetrator\\#ref-people_id ?T2 .  ?T1 :perpetrator\\#killed ?T1_killed . ?T2 :people\\#height ?T2_height . FILTER(?T2_height > 1.84) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (sum( ?T1_killed) as ?aggregation_T1_killed_124 ) WHERE {\n  {\n    SELECT ?T1 ?T1_killed ?T2 ?T2_height WHERE {\n  SERVICE <http://host.docker.internal:3030/perpetrator__people/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :people .\n      ?T2 :people\\#height ?T2_height\n      FILTER(?T2_height > 1.84)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/perpetrator__perpetrator/sparql> {\n    ?T1 a :perpetrator .\n      ?T1 :perpetrator\\#ref-people_id ?T2 .\n      ?T1 :perpetrator\\#killed ?T1_killed\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/perpetrator__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/perpetrator",
        "url": "http://host.docker.internal:3030/perpetrator__perpetrator/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "perpetrator_1597",
    "kg_name": "perpetrator",
    "split": "train",
    "question": "List the names of perpetrators in descending order of the year.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :perpetrator . ?T2 :perpetrator\\#ref-people_id ?T1 .  ?T1 :people\\#name ?T1_name . ?T2 :perpetrator\\#year ?T2_year .        }  ORDER BY DESC (?T2_year)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/perpetrator__people/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :people .\n      ?T1 :people\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/perpetrator__perpetrator/sparql> {\n    ?T2 a :perpetrator .\n      ?T2 :perpetrator\\#ref-people_id ?T1 .\n      ?T2 :perpetrator\\#year ?T2_year\n  }\n}\nORDER BY DESC (?T2_year)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/perpetrator__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/perpetrator",
        "url": "http://host.docker.internal:3030/perpetrator__perpetrator/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "perpetrator_1598",
    "kg_name": "perpetrator",
    "split": "train",
    "question": "Show the date of the tallest perpetrator.",
    "original_sparql": "SELECT ?T1_date WHERE { ?T1 a :perpetrator . ?T2 a :people . ?T1 :perpetrator\\#ref-people_id ?T2 .  ?T1 :perpetrator\\#date ?T1_date . ?T2 :people\\#height ?T2_height .        }   ORDER BY DESC (?T2_height) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date WHERE {\n  SERVICE <http://host.docker.internal:3030/perpetrator__people/sparql> {\n    SELECT DISTINCT ?T2 ?T2_height WHERE {\n      ?T2 a :people .\n      ?T2 :people\\#height ?T2_height\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/perpetrator__perpetrator/sparql> {\n    ?T1 a :perpetrator .\n      ?T1 :perpetrator\\#ref-people_id ?T2 .\n      ?T1 :perpetrator\\#date ?T1_date\n  }\n}\nORDER BY DESC (?T2_height) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/perpetrator__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/perpetrator",
        "url": "http://host.docker.internal:3030/perpetrator__perpetrator/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "phone_1_1621",
    "kg_name": "phone_1",
    "split": "train",
    "question": "List the hardware model name and company name for all the phones that were launched in year 2002 or have RAM size greater than 32.",
    "original_sparql": "SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T2 a :chip_model . ?T1 :phone\\#ref-chip_model ?T2 .  ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name . ?T1 :phone\\#company_name ?T1_company_name . ?T2 :chip_model\\#launch_year ?T2_launch_year . ?T2 :chip_model\\#ram_mib ?T2_ram_mib . FILTER(?T2_launch_year = 2002 || ?T2_ram_mib > 32) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_hardware_model_name ?T1_company_name WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_1__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_company_name ?T1_hardware_model_name WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name .\n      ?T1 :phone\\#company_name ?T1_company_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__chip_model/sparql> {\n    ?T2 a :chip_model .\n      ?T1 :phone\\#ref-chip_model ?T2 .\n      ?T2 :chip_model\\#launch_year ?T2_launch_year .\n      ?T2 :chip_model\\#ram_mib ?T2_ram_mib\n      FILTER(?T2_launch_year = 2002 || ?T2_ram_mib > 32)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/chip_model",
        "url": "http://host.docker.internal:3030/phone_1__chip_model/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_1__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/screen_mode",
        "url": "http://host.docker.internal:3030/phone_1__screen_mode/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 7,
      "federated_count": 0,
      "missing": 7,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "phone_1_1622",
    "kg_name": "phone_1",
    "split": "train",
    "question": "Find the Char cells, Pixels and Hardware colours for the screen of the phone whose hardware model name is 'LG-P760'.",
    "original_sparql": "SELECT ?T1_char_cells ?T1_pixels ?T1_hardware_colours WHERE { ?T1 a :screen_mode . ?T2 a :phone . ?T2 :phone\\#ref-screen_mode ?T1 .  ?T1 :screen_mode\\#char_cells ?T1_char_cells . ?T1 :screen_mode\\#pixels ?T1_pixels . ?T1 :screen_mode\\#hardware_colours ?T1_hardware_colours . ?T2 :phone\\#hardware_model_name ?T2_hardware_model_name . FILTER(?T2_hardware_model_name = 'LG-P760') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_char_cells ?T1_pixels ?T1_hardware_colours WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_1__phone/sparql> {\n    SELECT DISTINCT ?T2 ?T2_hardware_model_name WHERE {\n      ?T2 a :phone .\n      ?T2 :phone\\#hardware_model_name ?T2_hardware_model_name\n      FILTER(?T2_hardware_model_name = 'LG-P760')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__screen_mode/sparql> {\n    ?T1 a :screen_mode .\n      ?T2 :phone\\#ref-screen_mode ?T1 .\n      ?T1 :screen_mode\\#char_cells ?T1_char_cells .\n      ?T1 :screen_mode\\#pixels ?T1_pixels .\n      ?T1 :screen_mode\\#hardware_colours ?T1_hardware_colours\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/chip_model",
        "url": "http://host.docker.internal:3030/phone_1__chip_model/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_1__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/screen_mode",
        "url": "http://host.docker.internal:3030/phone_1__screen_mode/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "phone_1_1624",
    "kg_name": "phone_1",
    "split": "train",
    "question": "List the name of the phone model launched in year 2002 and with the highest RAM size.",
    "original_sparql": "SELECT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :chip_model . ?T1 :phone\\#ref-chip_model ?T2 .  ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name . ?T2 :chip_model\\#ram_mib ?T2_ram_mib . ?T2 :chip_model\\#launch_year ?T2_launch_year . FILTER(?T2_launch_year = 2002) .        }   ORDER BY DESC (?T2_ram_mib) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_hardware_model_name WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_1__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_hardware_model_name WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__chip_model/sparql> {\n    ?T2 a :chip_model .\n      ?T1 :phone\\#ref-chip_model ?T2 .\n      ?T2 :chip_model\\#ram_mib ?T2_ram_mib .\n      ?T2 :chip_model\\#launch_year ?T2_launch_year\n      FILTER(?T2_launch_year = 2002)\n  }\n}\nORDER BY DESC (?T2_ram_mib) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/chip_model",
        "url": "http://host.docker.internal:3030/phone_1__chip_model/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_1__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/screen_mode",
        "url": "http://host.docker.internal:3030/phone_1__screen_mode/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "phone_1_1626",
    "kg_name": "phone_1",
    "split": "train",
    "question": "List the hardware model name for the phones that have screen mode type 'Text' or RAM size greater than 32.",
    "original_sparql": "SELECT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\\#ref-screen_mode ?T2 .  ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name . ?T2 :screen_mode\\#type ?T2_type . ?T3 :chip_model\\#ram_mib ?T3_ram_mib . ?T3 a :chip_model . ?T1 :phone\\#ref-chip_model ?T3 .  ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name . ?T2 :screen_mode\\#type ?T2_type . ?T3 :chip_model\\#ram_mib ?T3_ram_mib . FILTER(?T2_type = 'Text' || ?T3_ram_mib > 32) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_hardware_model_name WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_1__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_hardware_model_name WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name .\n      ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__screen_mode/sparql> {\n    ?T2 a :screen_mode .\n      ?T1 :phone\\#ref-screen_mode ?T2 .\n      ?T2 :screen_mode\\#type ?T2_type .\n      ?T2 :screen_mode\\#type ?T2_type\n      FILTER(?T2_type = 'Text' || ?T3_ram_mib > 32)\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__chip_model/sparql> {\n    ?T3 :chip_model\\#ram_mib ?T3_ram_mib .\n      ?T3 a :chip_model .\n      ?T1 :phone\\#ref-chip_model ?T3 .\n      ?T3 :chip_model\\#ram_mib ?T3_ram_mib\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/chip_model",
        "url": "http://host.docker.internal:3030/phone_1__chip_model/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_1__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/screen_mode",
        "url": "http://host.docker.internal:3030/phone_1__screen_mode/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 4,
      "federated_count": 0,
      "missing": 4,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "phone_1_1627",
    "kg_name": "phone_1",
    "split": "train",
    "question": "List the hardware model name for the phones that were produced by 'Nokia Corporation' or whose screen mode type is 'Graphics.'",
    "original_sparql": "SELECT DISTINCT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\\#ref-screen_mode ?T2 .  ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name . ?T2 :screen_mode\\#type ?T2_type . ?T1 :phone\\#company_name ?T1_company_name . FILTER(?T2_type = 'Graphics' || ?T1_company_name = 'Nokia Corporation') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_hardware_model_name WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_1__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_company_name ?T1_hardware_model_name ?T2_type WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name .\n      ?T1 :phone\\#company_name ?T1_company_name\n      FILTER(?T2_type = 'Graphics' || ?T1_company_name = 'Nokia Corporation')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__screen_mode/sparql> {\n    ?T2 a :screen_mode .\n      ?T1 :phone\\#ref-screen_mode ?T2 .\n      ?T2 :screen_mode\\#type ?T2_type\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/chip_model",
        "url": "http://host.docker.internal:3030/phone_1__chip_model/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_1__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/screen_mode",
        "url": "http://host.docker.internal:3030/phone_1__screen_mode/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 5,
      "federated_count": 0,
      "missing": 5,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "phone_1_1628",
    "kg_name": "phone_1",
    "split": "train",
    "question": "List the hardware model name for the phons that were produced by 'Nokia Corporation' but whose screen mode type is not Text.",
    "original_sparql": "SELECT DISTINCT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\\#ref-screen_mode ?T2 .  ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name . ?T1 :phone\\#company_name ?T1_company_name . ?T2 :screen_mode\\#type ?T2_type . FILTER(?T1_company_name = 'Nokia Corporation' && ?T2_type != 'Text') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_hardware_model_name WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_1__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_company_name ?T1_hardware_model_name ?T2_type WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#hardware_model_name ?T1_hardware_model_name .\n      ?T1 :phone\\#company_name ?T1_company_name\n      FILTER(?T1_company_name = 'Nokia Corporation' && ?T2_type != 'Text')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__screen_mode/sparql> {\n    ?T2 a :screen_mode .\n      ?T1 :phone\\#ref-screen_mode ?T2 .\n      ?T2 :screen_mode\\#type ?T2_type\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/chip_model",
        "url": "http://host.docker.internal:3030/phone_1__chip_model/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_1__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/screen_mode",
        "url": "http://host.docker.internal:3030/phone_1__screen_mode/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 0,
      "missing": 2,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "phone_1_1630",
    "kg_name": "phone_1",
    "split": "train",
    "question": "Find the pixels of the screen modes that are used by both phones with full accreditation types and phones with Provisional accreditation types.",
    "original_sparql": "SELECT DISTINCT ?T1_pixels WHERE { ?T1 a :screen_mode . ?T2 a :phone . ?T2 :phone\\#ref-screen_mode ?T1 .  ?T1 :screen_mode\\#pixels ?T1_pixels . ?T2 :phone\\#accreditation_type ?T2_accreditation_type . FILTER(?T2_accreditation_type = 'Provisional') . FILTER (?T1_pixels in (?T3_pixels)) .   ?T3 a :screen_mode . ?T4 a :phone . ?T4 :phone\\#ref-screen_mode ?T3 .  ?T3 :screen_mode\\#pixels ?T3_pixels . ?T4 :phone\\#accreditation_type ?T4_accreditation_type .  FILTER(?T4_accreditation_type = 'Full') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_pixels WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_1__phone/sparql> {\n    SELECT DISTINCT ?T2 ?T2_accreditation_type ?T4 ?T4_accreditation_type WHERE {\n      ?T2 a :phone .\n      ?T2 :phone\\#accreditation_type ?T2_accreditation_type .\n      ?T4 a :phone .\n      ?T4 :phone\\#accreditation_type ?T4_accreditation_type\n      FILTER(?T2_accreditation_type = 'Provisional')\n      FILTER(?T4_accreditation_type = 'Full')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_1__screen_mode/sparql> {\n    ?T1 a :screen_mode .\n      ?T2 :phone\\#ref-screen_mode ?T1 .\n      ?T1 :screen_mode\\#pixels ?T1_pixels .\n      ?T3 a :screen_mode .\n      ?T4 :phone\\#ref-screen_mode ?T3 .\n      ?T3 :screen_mode\\#pixels ?T3_pixels\n      FILTER (?T1_pixels in (?T3_pixels))\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/chip_model",
        "url": "http://host.docker.internal:3030/phone_1__chip_model/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_1__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/screen_mode",
        "url": "http://host.docker.internal:3030/phone_1__screen_mode/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 3,
      "federated_count": 0,
      "missing": 3,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "phone_market_1631",
    "kg_name": "phone_market",
    "split": "train",
    "question": "Show the names of phones and the districts of markets they are on.",
    "original_sparql": "SELECT ?T1_name ?T2_district WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :phone_market\\#ref-phone_id ?T1 .  ?T1 :phone\\#name ?T1_name . ?T2 :market\\#district ?T2_district . ?T2 a :market . ?T13 :phone_market\\#ref-market_id ?T2 .  ?T1 :phone\\#name ?T1_name . ?T2 :market\\#district ?T2_district .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_district WHERE {\n  SERVICE <http://host.docker.internal:3030/phone_market__phone/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :phone .\n      ?T1 :phone\\#name ?T1_name .\n      ?T1 :phone\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_market__market/sparql> {\n    SELECT DISTINCT ?T2 ?T2_district WHERE {\n      ?T2 :market\\#district ?T2_district .\n      ?T2 a :market .\n      ?T2 :market\\#district ?T2_district\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/phone_market__phone_market/sparql> {\n    ?T13 a :phone_market .\n      ?T13 :phone_market\\#ref-phone_id ?T1 .\n      ?T13 :phone_market\\#ref-market_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/phone_market",
        "url": "http://host.docker.internal:3030/phone_market__phone_market/sparql"
      },
      {
        "class": "http://valuenet/ontop/phone",
        "url": "http://host.docker.internal:3030/phone_market__phone/sparql"
      },
      {
        "class": "http://valuenet/ontop/market",
        "url": "http://host.docker.internal:3030/phone_market__market/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  }
]