[
  {
    "id": "company_employee_467",
    "kg_name": "company_employee",
    "split": "train",
    "question": "Show the names of employees that work for companies with sales bigger than 200.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :people . ?T13 a :employment . ?T13 :employment\\#ref-people_id ?T1 .  ?T1 :people\\#name ?T1_name . ?T2 :company\\#sales_in_billion ?T2_sales_in_billion . ?T2 a :company . ?T13 :employment\\#ref-company_id ?T2 .  ?T1 :people\\#name ?T1_name . ?T2 :company\\#sales_in_billion ?T2_sales_in_billion . FILTER(?T2_sales_in_billion > 200) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/company_employee__people/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :people .\n      ?T1 :people\\#name ?T1_name .\n      ?T1 :people\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/company_employee__company/sparql> {\n    SELECT DISTINCT ?T2 ?T2_sales_in_billion WHERE {\n      ?T2 :company\\#sales_in_billion ?T2_sales_in_billion .\n      ?T2 a :company .\n      ?T2 :company\\#sales_in_billion ?T2_sales_in_billion\n      FILTER(?T2_sales_in_billion > 200)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/company_employee__employment/sparql> {\n    ?T13 a :employment .\n      ?T13 :employment\\#ref-people_id ?T1 .\n      ?T13 :employment\\#ref-company_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/company",
        "url": "http://host.docker.internal:3030/company_employee__company/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/company_employee__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/employment",
        "url": "http://host.docker.internal:3030/company_employee__employment/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "company_employee_468",
    "kg_name": "company_employee",
    "split": "train",
    "question": "Show the names of companies and the number of employees they have",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T2 a :employment . ?T2 :employment\\#ref-company_id ?T1 .  ?T1 :company\\#name ?T1_name .        } GROUP BY ?T1_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/company_employee__company/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :company .\n      ?T1 :company\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/company_employee__employment/sparql> {\n    ?T2 a :employment .\n      ?T2 :employment\\#ref-company_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/company",
        "url": "http://host.docker.internal:3030/company_employee__company/sparql"
      },
      {
        "class": "http://valuenet/ontop/people",
        "url": "http://host.docker.internal:3030/company_employee__people/sparql"
      },
      {
        "class": "http://valuenet/ontop/employment",
        "url": "http://host.docker.internal:3030/company_employee__employment/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 5,
      "federated_count": 5,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "company_office_469",
    "kg_name": "company_office",
    "split": "train",
    "question": "List the name of a building along with the name of a company whose office is in the building.",
    "original_sparql": "SELECT ?T1_name ?T2_name WHERE { ?T1 a :companies . ?T13 a :office_locations . ?T13 :office_locations\\#ref-company_id ?T1 .  ?T1 :companies\\#name ?T1_name . ?T2 :buildings\\#name ?T2_name . ?T2 a :buildings . ?T13 :office_locations\\#ref-building_id ?T2 .  ?T1 :companies\\#name ?T1_name . ?T2 :buildings\\#name ?T2_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/company_office__companies/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :companies .\n      ?T1 :companies\\#name ?T1_name .\n      ?T1 :companies\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/company_office__buildings/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 :buildings\\#name ?T2_name .\n      ?T2 a :buildings .\n      ?T2 :buildings\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/company_office__office_locations/sparql> {\n    ?T13 a :office_locations .\n      ?T13 :office_locations\\#ref-company_id ?T1 .\n      ?T13 :office_locations\\#ref-building_id ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/buildings",
        "url": "http://host.docker.internal:3030/company_office__buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/companies",
        "url": "http://host.docker.internal:3030/company_office__companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/office_locations",
        "url": "http://host.docker.internal:3030/company_office__office_locations/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 16,
      "federated_count": 16,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "company_office_471",
    "kg_name": "company_office",
    "split": "train",
    "question": "Show the names of the buildings that have more than one company offices.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :buildings . ?T2 a :office_locations . ?T2 :office_locations\\#ref-building_id ?T1 .  ?T1 :buildings\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/company_office__buildings/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :buildings .\n      ?T1 :buildings\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/company_office__office_locations/sparql> {\n    ?T2 a :office_locations .\n      ?T2 :office_locations\\#ref-building_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/buildings",
        "url": "http://host.docker.internal:3030/company_office__buildings/sparql"
      },
      {
        "class": "http://valuenet/ontop/companies",
        "url": "http://host.docker.internal:3030/company_office__companies/sparql"
      },
      {
        "class": "http://valuenet/ontop/office_locations",
        "url": "http://host.docker.internal:3030/company_office__office_locations/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "county_public_safety_489",
    "kg_name": "county_public_safety",
    "split": "train",
    "question": "Show names of cities and names of counties they are in.",
    "original_sparql": "SELECT ?T1_name ?T2_name WHERE { ?T1 a :city . ?T2 a :county_public_safety . ?T1 :city\\#ref-county_id ?T2 .  ?T1 :city\\#name ?T1_name . ?T2 :county_public_safety\\#name ?T2_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/county_public_safety__county_public_safety/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :county_public_safety .\n      ?T2 :county_public_safety\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/county_public_safety__city/sparql> {\n    ?T1 a :city .\n      ?T1 :city\\#ref-county_id ?T2 .\n      ?T1 :city\\#name ?T1_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/county_public_safety",
        "url": "http://host.docker.internal:3030/county_public_safety__county_public_safety/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/county_public_safety__city/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 17,
      "federated_count": 17,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "county_public_safety_491",
    "kg_name": "county_public_safety",
    "split": "train",
    "question": "Show white percentages of cities and the crime rates of counties they are in.",
    "original_sparql": "SELECT ?T1_white ?T2_crime_rate WHERE { ?T1 a :city . ?T2 a :county_public_safety . ?T1 :city\\#ref-county_id ?T2 .  ?T1 :city\\#white ?T1_white . ?T2 :county_public_safety\\#crime_rate ?T2_crime_rate .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_white ?T2_crime_rate WHERE {\n  SERVICE <http://host.docker.internal:3030/county_public_safety__county_public_safety/sparql> {\n    SELECT DISTINCT ?T2 ?T2_crime_rate WHERE {\n      ?T2 a :county_public_safety .\n      ?T2 :county_public_safety\\#crime_rate ?T2_crime_rate\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/county_public_safety__city/sparql> {\n    ?T1 a :city .\n      ?T1 :city\\#ref-county_id ?T2 .\n      ?T1 :city\\#white ?T1_white\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/county_public_safety",
        "url": "http://host.docker.internal:3030/county_public_safety__county_public_safety/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/county_public_safety__city/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 17,
      "federated_count": 17,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "county_public_safety_493",
    "kg_name": "county_public_safety",
    "split": "train",
    "question": "Show the crime rate of counties with a city having white percentage more than 90.",
    "original_sparql": "SELECT ?T1_crime_rate WHERE { ?T1 a :county_public_safety . ?T2 a :city . ?T2 :city\\#ref-county_id ?T1 .  ?T1 :county_public_safety\\#crime_rate ?T1_crime_rate . ?T2 :city\\#white ?T2_white . FILTER(?T2_white > 90) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_crime_rate WHERE {\n  SERVICE <http://host.docker.internal:3030/county_public_safety__county_public_safety/sparql> {\n    SELECT DISTINCT ?T1 ?T1_crime_rate WHERE {\n      ?T1 a :county_public_safety .\n      ?T1 :county_public_safety\\#crime_rate ?T1_crime_rate\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/county_public_safety__city/sparql> {\n    ?T2 a :city .\n      ?T2 :city\\#ref-county_id ?T1 .\n      ?T2 :city\\#white ?T2_white\n      FILTER(?T2_white > 90)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/county_public_safety",
        "url": "http://host.docker.internal:3030/county_public_safety__county_public_safety/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/county_public_safety__city/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_control_systems_528",
    "kg_name": "cre_doc_control_systems",
    "split": "train",
    "question": "How many employees does each role have? List role description, id and number of employees.",
    "original_sparql": "SELECT ?T1_role_description ?T2_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :roles . ?T2 a :employees . ?T2 :employees\\#ref-role_code ?T1 .  ?T1 :roles\\#role_description ?T1_role_description . ?T2 :employees\\#role_code ?T2_role_code .        } GROUP BY ?T1_role_description ?T2_role_code",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_role_description ?T2_role_code (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_role_description ?T2 ?T2_role_code WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__roles/sparql> {\n    SELECT DISTINCT ?T1 ?T1_role_description WHERE {\n      ?T1 a :roles .\n      ?T1 :roles\\#role_description ?T1_role_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__employees/sparql> {\n    ?T2 a :employees .\n      ?T2 :employees\\#ref-role_code ?T1 .\n      ?T2 :employees\\#role_code ?T2_role_code\n  }\n    }\n  }\n}\nGROUP BY ?T1_role_description ?T2_role_code",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/document_drafts",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__document_drafts/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_shipping_agents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_shipping_agents/sparql"
      },
      {
        "class": "http://valuenet/ontop/circulation_history",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__circulation_history/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_mailed",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents_mailed/sparql"
      },
      {
        "class": "http://valuenet/ontop/draft_copies",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__draft_copies/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_status",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_status/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_control_systems_533",
    "kg_name": "cre_doc_control_systems",
    "split": "train",
    "question": "Which shipping agent shipped the most documents? List the shipping agent name and the number of documents.",
    "original_sparql": "SELECT ?T1_shipping_agent_name (count( *) as ?aggregation_all) (count( ?T2_document_id) as ?aggregation_T2_document_id_69 ) WHERE { ?T1 a :ref_shipping_agents . ?T2 a :documents . ?T2 :documents\\#ref-shipping_agent_code ?T1 .  ?T1 :ref_shipping_agents\\#shipping_agent_name ?T1_shipping_agent_name . ?T2 :documents\\#document_id ?T2_document_id . ?T2 :documents\\#document_id ?T2_document_id .        } GROUP BY ?T1_shipping_agent_name  ORDER BY DESC ((count( ?T2_document_id) as ?aggregation_T2_document_id_137 )) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_shipping_agent_name (count( *) as ?aggregation_all) (count( ?T2_document_id) as ?aggregation_T2_document_id_69 ) WHERE {\n  {\n    SELECT ?T1 ?T1_shipping_agent_name ?T2 ?T2_document_id WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__ref_shipping_agents/sparql> {\n    SELECT DISTINCT ?T1 ?T1_shipping_agent_name WHERE {\n      ?T1 a :ref_shipping_agents .\n      ?T1 :ref_shipping_agents\\#shipping_agent_name ?T1_shipping_agent_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__documents/sparql> {\n    ?T2 a :documents .\n      ?T2 :documents\\#ref-shipping_agent_code ?T1 .\n      ?T2 :documents\\#document_id ?T2_document_id .\n      ?T2 :documents\\#document_id ?T2_document_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_shipping_agent_name  ORDER BY DESC ((count( ?T2_document_id) as ?aggregation_T2_document_id_137 )) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/document_drafts",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__document_drafts/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_shipping_agents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_shipping_agents/sparql"
      },
      {
        "class": "http://valuenet/ontop/circulation_history",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__circulation_history/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_mailed",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents_mailed/sparql"
      },
      {
        "class": "http://valuenet/ontop/draft_copies",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__draft_copies/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_status",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_status/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "cre_doc_control_systems_535",
    "kg_name": "cre_doc_control_systems",
    "split": "train",
    "question": "List document id of documents status is done and document type is Paper and the document is shipped by shipping agent named USPS.",
    "original_sparql": "SELECT DISTINCT ?T1_document_id WHERE { ?T1 a :documents . ?T1 :documents\\#document_id ?T1_document_id . ?T1 :documents\\#document_status_code ?T1_document_status_code . ?T1 :documents\\#document_type_code ?T1_document_type_code . FILTER(?T1_document_status_code = 'done' && ?T1_document_type_code = 'Paper') . FILTER (?T1_document_id in (?T2_document_id)) .   ?T2 a :documents . ?T3 a :ref_shipping_agents . ?T2 :documents\\#ref-shipping_agent_code ?T3 .  ?T2 :documents\\#document_id ?T2_document_id . ?T3 :ref_shipping_agents\\#shipping_agent_name ?T3_shipping_agent_name .  FILTER(?T3_shipping_agent_name = 'USPS') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_document_id WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__ref_shipping_agents/sparql> {\n    SELECT DISTINCT ?T3 ?T3_shipping_agent_name WHERE {\n      ?T3 a :ref_shipping_agents .\n      ?T3 :ref_shipping_agents\\#shipping_agent_name ?T3_shipping_agent_name\n      FILTER(?T3_shipping_agent_name = 'USPS')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__documents/sparql> {\n    ?T1 a :documents .\n      ?T1 :documents\\#document_id ?T1_document_id .\n      ?T1 :documents\\#document_status_code ?T1_document_status_code .\n      ?T1 :documents\\#document_type_code ?T1_document_type_code .\n      ?T2 a :documents .\n      ?T2 :documents\\#ref-shipping_agent_code ?T3 .\n      ?T2 :documents\\#document_id ?T2_document_id\n      FILTER(?T1_document_status_code = 'done' && ?T1_document_type_code = 'Paper')\n      FILTER (?T1_document_id in (?T2_document_id))\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/document_drafts",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__document_drafts/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_shipping_agents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_shipping_agents/sparql"
      },
      {
        "class": "http://valuenet/ontop/circulation_history",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__circulation_history/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_mailed",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents_mailed/sparql"
      },
      {
        "class": "http://valuenet/ontop/draft_copies",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__draft_copies/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_status",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_status/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_control_systems_536",
    "kg_name": "cre_doc_control_systems",
    "split": "train",
    "question": "List all employees in the circulation history of the document with id 1. List the employee's name.",
    "original_sparql": "SELECT ?T1_employee_name WHERE { ?T1 a :employees . ?T2 a :circulation_history . ?T2 :circulation_history\\#ref-employee_id ?T1 .  ?T1 :employees\\#employee_name ?T1_employee_name . ?T2 :circulation_history\\#document_id ?T2_document_id . FILTER(?T2_document_id = 1) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_employee_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__employees/sparql> {\n    SELECT DISTINCT ?T1 ?T1_employee_name WHERE {\n      ?T1 a :employees .\n      ?T1 :employees\\#employee_name ?T1_employee_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_control_systems__circulation_history/sparql> {\n    ?T2 a :circulation_history .\n      ?T2 :circulation_history\\#ref-employee_id ?T1 .\n      ?T2 :circulation_history\\#document_id ?T2_document_id\n      FILTER(?T2_document_id = 1)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/document_drafts",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__document_drafts/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_shipping_agents",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_shipping_agents/sparql"
      },
      {
        "class": "http://valuenet/ontop/circulation_history",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__circulation_history/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents_mailed",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__documents_mailed/sparql"
      },
      {
        "class": "http://valuenet/ontop/draft_copies",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__draft_copies/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_status",
        "url": "http://host.docker.internal:3030/cre_doc_control_systems__ref_document_status/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_tracking_db_539",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Return the day Number and stored date for all the documents.",
    "original_sparql": "SELECT ?T1_day_number ?T2_date_stored WHERE { ?T1 a :ref_calendar . ?T2 a :all_documents . ?T2 :all_documents\\#ref-date_stored ?T1 .  ?T1 :ref_calendar\\#day_number ?T1_day_number . ?T2 :all_documents\\#date_stored ?T2_date_stored .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_day_number ?T2_date_stored WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql> {\n    SELECT DISTINCT ?T1 ?T1_day_number WHERE {\n      ?T1 a :ref_calendar .\n      ?T1 :ref_calendar\\#day_number ?T1_day_number\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql> {\n    ?T2 a :all_documents .\n      ?T2 :all_documents\\#ref-date_stored ?T1 .\n      ?T2 :all_documents\\#date_stored ?T2_date_stored\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "cre_doc_tracking_db_541",
    "kg_name": "cre_doc_tracking_db",
    "split": "train",
    "question": "Find the document type name of the document named 'How to read a book'.",
    "original_sparql": "SELECT ?T1_document_type_name WHERE { ?T1 a :ref_document_types . ?T2 a :all_documents . ?T2 :all_documents\\#ref-document_type_code ?T1 .  ?T1 :ref_document_types\\#document_type_name ?T1_document_type_name . ?T2 :all_documents\\#document_name ?T2_document_name . FILTER(?T2_document_name = 'How to read a book') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_document_type_name WHERE {\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql> {\n    SELECT DISTINCT ?T1 ?T1_document_type_name WHERE {\n      ?T1 a :ref_document_types .\n      ?T1 :ref_document_types\\#document_type_name ?T1_document_type_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql> {\n    ?T2 a :all_documents .\n      ?T2 :all_documents\\#ref-document_type_code ?T1 .\n      ?T2 :all_documents\\#document_name ?T2_document_name\n      FILTER(?T2_document_name = 'How to read a book')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/documents_to_be_destroyed",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__documents_to_be_destroyed/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__document_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/employees",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__employees/sparql"
      },
      {
        "class": "http://valuenet/ontop/all_documents",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__all_documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/roles",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_calendar",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_calendar/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_locations",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_locations/sparql"
      },
      {
        "class": "http://valuenet/ontop/ref_document_types",
        "url": "http://host.docker.internal:3030/cre_doc_tracking_db__ref_document_types/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  }
]