[
  {
    "id": "e_learning_888",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Return the descriptions and names of the courses that have more than two students enrolled in.",
    "original_sparql": "SELECT ?T1_course_description ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :student_course_enrolment\\#ref-course_id ?T1 .  ?T1 :courses\\#course_description ?T1_course_description . ?T1 :courses\\#course_name ?T1_course_name .        } GROUP BY ?T1_course_description ?T1_course_name   HAVING(count( *)  > 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_course_description ?T1_course_name WHERE {\n  {\n    SELECT ?T1 ?T1_course_description ?T1_course_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    SELECT DISTINCT ?T1 ?T1_course_description ?T1_course_name WHERE {\n      ?T1 a :courses .\n      ?T1 :courses\\#course_description ?T1_course_description .\n      ?T1 :courses\\#course_name ?T1_course_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T2 a :student_course_enrolment .\n      ?T2 :student_course_enrolment\\#ref-course_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_course_description ?T1_course_name   HAVING(count( *)  > 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_892",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the enrollment date for all the tests that have 'Pass' result.",
    "original_sparql": "SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :student_tests_taken\\#ref-registration_id ?T1 .  ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment . ?T2 :student_tests_taken\\#test_result ?T2_test_result . FILTER(?T2_test_result = 'Pass') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date_of_enrolment WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    SELECT DISTINCT ?T1 ?T1_date_of_enrolment WHERE {\n      ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_tests_taken/sparql> {\n    ?T2 a :student_tests_taken .\n      ?T2 :student_tests_taken\\#ref-registration_id ?T1 .\n      ?T2 :student_tests_taken\\#test_result ?T2_test_result\n      FILTER(?T2_test_result = 'Pass')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_894",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Return the completion date for all the tests that have 'Fail' result.",
    "original_sparql": "SELECT ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :student_tests_taken\\#ref-registration_id ?T1 .  ?T1 :student_course_enrolment\\#date_of_completion ?T1_date_of_completion . ?T2 :student_tests_taken\\#test_result ?T2_test_result . FILTER(?T2_test_result = 'Fail') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date_of_completion WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    SELECT DISTINCT ?T1 ?T1_date_of_completion WHERE {\n      ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#date_of_completion ?T1_date_of_completion\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_tests_taken/sparql> {\n    ?T2 a :student_tests_taken .\n      ?T2 :student_tests_taken\\#ref-registration_id ?T1 .\n      ?T2 :student_tests_taken\\#test_result ?T2_test_result\n      FILTER(?T2_test_result = 'Fail')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_895",
    "kg_name": "e_learning",
    "split": "train",
    "question": "List the dates of enrollment and completion of the student with personal name 'Karson'.",
    "original_sparql": "SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment . ?T1 :student_course_enrolment\\#date_of_completion ?T1_date_of_completion . ?T2 :students\\#personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Karson') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__students/sparql> {\n    SELECT DISTINCT ?T2 ?T2_personal_name WHERE {\n      ?T2 a :students .\n      ?T2 :students\\#personal_name ?T2_personal_name\n      FILTER(?T2_personal_name = 'Karson')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#ref-student_id ?T2 .\n      ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment .\n      ?T1 :student_course_enrolment\\#date_of_completion ?T1_date_of_completion\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_897",
    "kg_name": "e_learning",
    "split": "train",
    "question": "List the dates of enrollment and completion of the student with family name 'Zieme' and personal name 'Bernie'.",
    "original_sparql": "SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment . ?T1 :student_course_enrolment\\#date_of_completion ?T1_date_of_completion . ?T2 :students\\#family_name ?T2_family_name . ?T2 :students\\#personal_name ?T2_personal_name . FILTER(?T2_family_name = 'Zieme' && ?T2_personal_name = 'Bernie') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__students/sparql> {\n    SELECT DISTINCT ?T2 ?T2_family_name ?T2_personal_name WHERE {\n      ?T2 a :students .\n      ?T2 :students\\#family_name ?T2_family_name .\n      ?T2 :students\\#personal_name ?T2_personal_name\n      FILTER(?T2_family_name = 'Zieme' && ?T2_personal_name = 'Bernie')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#ref-student_id ?T2 .\n      ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment .\n      ?T1 :student_course_enrolment\\#date_of_completion ?T1_date_of_completion\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_899",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the student ID and login name of the student with the most course enrollments",
    "original_sparql": "SELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_login_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\\#student_id ?T1_student_id . ?T2 :students\\#login_name ?T2_login_name .        } GROUP BY ?T1_student_id ?T2_login_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_login_name WHERE {\n  {\n    SELECT ?T1 ?T1_student_id ?T2 ?T2_login_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__students/sparql> {\n    SELECT DISTINCT ?T2 ?T2_login_name WHERE {\n      ?T2 a :students .\n      ?T2 :students\\#login_name ?T2_login_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#ref-student_id ?T2 .\n      ?T1 :student_course_enrolment\\#student_id ?T1_student_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_student_id ?T2_login_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_901",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the student ID and personal name of the student with at least two enrollments.",
    "original_sparql": "SELECT ?T1_student_id ?T2_personal_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\\#student_id ?T1_student_id . ?T2 :students\\#personal_name ?T2_personal_name .        } GROUP BY ?T1_student_id ?T2_personal_name   HAVING(count( *)  >= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_student_id ?T2_personal_name WHERE {\n  {\n    SELECT ?T1 ?T1_student_id ?T2 ?T2_personal_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__students/sparql> {\n    SELECT DISTINCT ?T2 ?T2_personal_name WHERE {\n      ?T2 a :students .\n      ?T2 :students\\#personal_name ?T2_personal_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#ref-student_id ?T2 .\n      ?T1 :student_course_enrolment\\#student_id ?T1_student_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_student_id ?T2_personal_name   HAVING(count( *)  >= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 4,
      "federated_count": 4,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_903",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the student ID and middle name for all the students with at most two enrollments.",
    "original_sparql": "SELECT ?T1_student_id ?T2_middle_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\\#student_id ?T1_student_id . ?T2 :students\\#middle_name ?T2_middle_name .        } GROUP BY ?T1_student_id ?T2_middle_name   HAVING(count( *)  <= 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_student_id ?T2_middle_name WHERE {\n  {\n    SELECT ?T1 ?T1_student_id ?T2 ?T2_middle_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__students/sparql> {\n    SELECT DISTINCT ?T2 ?T2_middle_name WHERE {\n      ?T2 a :students .\n      ?T2 :students\\#middle_name ?T2_middle_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#ref-student_id ?T2 .\n      ?T1 :student_course_enrolment\\#student_id ?T1_student_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_student_id ?T2_middle_name   HAVING(count( *)  <= 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 10,
      "federated_count": 10,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_905",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the common login name of course authors and students.",
    "original_sparql": "SELECT DISTINCT ?T1_login_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\\#login_name ?T1_login_name . FILTER (?T1_login_name in (?T2_login_name)) .   ?T2 a :students . ?T2 :students\\#login_name ?T2_login_name .              }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_login_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql> {\n    ?T1 a :course_authors_and_tutors .\n      ?T1 :course_authors_and_tutors\\#login_name ?T1_login_name\n      FILTER (?T1_login_name in (?T2_login_name))\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__students/sparql> {\n    ?T2 a :students .\n      ?T2 :students\\#login_name ?T2_login_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_907",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the common personal name of course authors and students.",
    "original_sparql": "SELECT DISTINCT ?T1_personal_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\\#personal_name ?T1_personal_name . FILTER (?T1_personal_name in (?T2_personal_name)) .   ?T2 a :students . ?T2 :students\\#personal_name ?T2_personal_name .              }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_personal_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql> {\n    ?T1 a :course_authors_and_tutors .\n      ?T1 :course_authors_and_tutors\\#personal_name ?T1_personal_name\n      FILTER (?T1_personal_name in (?T2_personal_name))\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__students/sparql> {\n    ?T2 a :students .\n      ?T2 :students\\#personal_name ?T2_personal_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "election_909",
    "kg_name": "election",
    "split": "train",
    "question": "Show the delegates and the names of county they belong to.",
    "original_sparql": "SELECT ?T1_delegate ?T2_county_name WHERE { ?T1 a :election . ?T2 a :county . ?T1 :election\\#ref-district ?T2 .  ?T1 :election\\#delegate ?T1_delegate . ?T2 :county\\#county_name ?T2_county_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_delegate ?T2_county_name WHERE {\n  SERVICE <http://host.docker.internal:3030/election__county/sparql> {\n    SELECT DISTINCT ?T2 ?T2_county_name WHERE {\n      ?T2 a :county .\n      ?T2 :county\\#county_name ?T2_county_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/election__election/sparql> {\n    ?T1 a :election .\n      ?T1 :election\\#ref-district ?T2 .\n      ?T1 :election\\#delegate ?T1_delegate\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/election",
        "url": "http://host.docker.internal:3030/election__election/sparql"
      },
      {
        "class": "http://valuenet/ontop/party",
        "url": "http://host.docker.internal:3030/election__party/sparql"
      },
      {
        "class": "http://valuenet/ontop/county",
        "url": "http://host.docker.internal:3030/election__county/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "election_912",
    "kg_name": "election",
    "split": "train",
    "question": "Find the delegates who are from counties with population below 100000.",
    "original_sparql": "SELECT ?T1_delegate WHERE { ?T1 a :election . ?T2 a :county . ?T1 :election\\#ref-district ?T2 .  ?T1 :election\\#delegate ?T1_delegate . ?T2 :county\\#population ?T2_population . FILTER(?T2_population < 100000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_delegate WHERE {\n  SERVICE <http://host.docker.internal:3030/election__county/sparql> {\n    SELECT DISTINCT ?T2 ?T2_population WHERE {\n      ?T2 a :county .\n      ?T2 :county\\#population ?T2_population\n      FILTER(?T2_population < 100000)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/election__election/sparql> {\n    ?T1 a :election .\n      ?T1 :election\\#ref-district ?T2 .\n      ?T1 :election\\#delegate ?T1_delegate\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/election",
        "url": "http://host.docker.internal:3030/election__election/sparql"
      },
      {
        "class": "http://valuenet/ontop/party",
        "url": "http://host.docker.internal:3030/election__party/sparql"
      },
      {
        "class": "http://valuenet/ontop/county",
        "url": "http://host.docker.internal:3030/election__county/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "election_914",
    "kg_name": "election",
    "split": "train",
    "question": "Count the number of distinct delegates who are from counties with population above 50000.",
    "original_sparql": "SELECT DISTINCT (count(DISTINCT ?T1_delegate) as ?aggregation_T1_delegate_93 ) WHERE { ?T1 a :election . ?T2 a :county . ?T1 :election\\#ref-district ?T2 .  ?T1 :election\\#delegate ?T1_delegate . ?T2 :county\\#population ?T2_population . FILTER(?T2_population > 50000) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT (count(DISTINCT ?T1_delegate) as ?aggregation_T1_delegate_93 ) WHERE {\n  {\n    SELECT ?T1 ?T1_delegate ?T2 ?T2_population WHERE {\n  SERVICE <http://host.docker.internal:3030/election__county/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :county .\n      ?T2 :county\\#population ?T2_population\n      FILTER(?T2_population > 50000)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/election__election/sparql> {\n    ?T1 a :election .\n      ?T1 :election\\#ref-district ?T2 .\n      ?T1 :election\\#delegate ?T1_delegate\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/election",
        "url": "http://host.docker.internal:3030/election__election/sparql"
      },
      {
        "class": "http://valuenet/ontop/party",
        "url": "http://host.docker.internal:3030/election__party/sparql"
      },
      {
        "class": "http://valuenet/ontop/county",
        "url": "http://host.docker.internal:3030/election__county/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "election_916",
    "kg_name": "election",
    "split": "train",
    "question": "Which county do the delegates on 'Appropriations' committee belong to? Give me the county names.",
    "original_sparql": "SELECT ?T1_county_name WHERE { ?T1 a :county . ?T2 a :election . ?T2 :election\\#ref-district ?T1 .  ?T1 :county\\#county_name ?T1_county_name . ?T2 :election\\#committee ?T2_committee . FILTER(?T2_committee = 'Appropriations') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_county_name WHERE {\n  SERVICE <http://host.docker.internal:3030/election__county/sparql> {\n    SELECT DISTINCT ?T1 ?T1_county_name WHERE {\n      ?T1 a :county .\n      ?T1 :county\\#county_name ?T1_county_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/election__election/sparql> {\n    ?T2 a :election .\n      ?T2 :election\\#ref-district ?T1 .\n      ?T2 :election\\#committee ?T2_committee\n      FILTER(?T2_committee = 'Appropriations')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/election",
        "url": "http://host.docker.internal:3030/election__election/sparql"
      },
      {
        "class": "http://valuenet/ontop/party",
        "url": "http://host.docker.internal:3030/election__party/sparql"
      },
      {
        "class": "http://valuenet/ontop/county",
        "url": "http://host.docker.internal:3030/election__county/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "election_917",
    "kg_name": "election",
    "split": "train",
    "question": "Show the delegates and the names of the party they belong to.",
    "original_sparql": "SELECT ?T1_delegate ?T2_party WHERE { ?T1 a :election . ?T2 a :party . ?T1 :election\\#ref-party ?T2 .  ?T1 :election\\#delegate ?T1_delegate . ?T2 :party\\#party ?T2_party .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_delegate ?T2_party WHERE {\n  SERVICE <http://host.docker.internal:3030/election__party/sparql> {\n    SELECT DISTINCT ?T2 ?T2_party WHERE {\n      ?T2 a :party .\n      ?T2 :party\\#party ?T2_party\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/election__election/sparql> {\n    ?T1 a :election .\n      ?T1 :election\\#ref-party ?T2 .\n      ?T1 :election\\#delegate ?T1_delegate\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/election",
        "url": "http://host.docker.internal:3030/election__election/sparql"
      },
      {
        "class": "http://valuenet/ontop/party",
        "url": "http://host.docker.internal:3030/election__party/sparql"
      },
      {
        "class": "http://valuenet/ontop/county",
        "url": "http://host.docker.internal:3030/election__county/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 8,
      "federated_count": 8,
      "missing": 0,
      "extra": 0
    }
  }
]