[
  {
    "id": "tracking_grants_for_research_2056",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "List the project details of the project both producing patent and paper as outcomes.",
    "original_sparql": "SELECT DISTINCT ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\\#ref-project_id ?T1 .  ?T1 :projects\\#project_details ?T1_project_details . ?T2 :project_outcomes\\#outcome_code ?T2_outcome_code . FILTER(?T2_outcome_code = 'Paper') . FILTER (?T1_project_details in (?T3_project_details)) .   ?T3 a :projects . ?T4 a :project_outcomes . ?T4 :project_outcomes\\#ref-project_id ?T3 .  ?T3 :projects\\#project_details ?T3_project_details . ?T4 :project_outcomes\\#outcome_code ?T4_outcome_code .  FILTER(?T4_outcome_code = 'Patent') .             }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_project_details WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql> {\n    SELECT DISTINCT ?T1 ?T1_project_details ?T3 ?T3_project_details WHERE {\n      ?T1 a :projects .\n      ?T1 :projects\\#project_details ?T1_project_details .\n      ?T3 a :projects .\n      ?T3 :projects\\#project_details ?T3_project_details\n      FILTER (?T1_project_details in (?T3_project_details))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql> {\n    ?T2 a :project_outcomes .\n      ?T2 :project_outcomes\\#ref-project_id ?T1 .\n      ?T2 :project_outcomes\\#outcome_code ?T2_outcome_code .\n      ?T4 a :project_outcomes .\n      ?T4 :project_outcomes\\#ref-project_id ?T3 .\n      ?T4 :project_outcomes\\#outcome_code ?T4_outcome_code\n      FILTER(?T2_outcome_code = 'Paper')\n      FILTER(?T4_outcome_code = 'Patent')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_grants_for_research_2060",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "Find the organisation ids and details of the organisations which are involved in",
    "original_sparql": "SELECT ?T1_organisation_id ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :grants . ?T2 :grants\\#ref-organisation_id ?T1 .  ?T1 :organisations\\#organisation_id ?T1_organisation_id . ?T1 :organisations\\#organisation_details ?T1_organisation_details . ?T2 :grants\\#grant_amount ?T2_grant_amount .        } GROUP BY ?T1_organisation_id ?T1_organisation_details   HAVING(sum( ?T2_grant_amount)  > 6000)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_organisation_id ?T1_organisation_details WHERE {\n  {\n    SELECT ?T1 ?T1_organisation_details ?T1_organisation_id ?T2 ?T2_grant_amount WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql> {\n    SELECT DISTINCT ?T1 ?T1_organisation_details ?T1_organisation_id WHERE {\n      ?T1 a :organisations .\n      ?T1 :organisations\\#organisation_id ?T1_organisation_id .\n      ?T1 :organisations\\#organisation_details ?T1_organisation_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql> {\n    ?T2 a :grants .\n      ?T2 :grants\\#ref-organisation_id ?T1 .\n      ?T2 :grants\\#grant_amount ?T2_grant_amount\n  }\n    }\n  }\n}\nGROUP BY ?T1_organisation_id ?T1_organisation_details   HAVING(sum( ?T2_grant_amount)  > 6000)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_grants_for_research_2070",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "List the project details of the projects with the research outcome described with the substring 'Published'.",
    "original_sparql": "SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T13 a :project_outcomes . ?T13 :project_outcomes\\#ref-project_id ?T1 .  ?T1 :projects\\#project_details ?T1_project_details . ?T2 :research_outcomes\\#outcome_description ?T2_outcome_description . ?T2 a :research_outcomes . ?T13 :project_outcomes\\#ref-outcome_code ?T2 .  ?T1 :projects\\#project_details ?T1_project_details . ?T2 :research_outcomes\\#outcome_description ?T2_outcome_description . FILTER(contains (?T2_outcome_description, 'Published')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_project_details WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql> {\n    SELECT DISTINCT ?T1 ?T1_project_details WHERE {\n      ?T1 a :projects .\n      ?T1 :projects\\#project_details ?T1_project_details .\n      ?T1 :projects\\#project_details ?T1_project_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql> {\n    SELECT DISTINCT ?T2 ?T2_outcome_description WHERE {\n      ?T2 :research_outcomes\\#outcome_description ?T2_outcome_description .\n      ?T2 a :research_outcomes .\n      ?T2 :research_outcomes\\#outcome_description ?T2_outcome_description\n      FILTER(contains (?T2_outcome_description, 'Published'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql> {\n    ?T13 a :project_outcomes .\n      ?T13 :project_outcomes\\#ref-project_id ?T1 .\n      ?T13 :project_outcomes\\#ref-outcome_code ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_grants_for_research_2072",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "How many staff does each project has? List the project id and the number in an ascending order.",
    "original_sparql": "SELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE { ?T1 a :project_staff . ?T2 a :projects . ?T1 :project_staff\\#ref-project_id ?T2 .  ?T1 :project_staff\\#project_id ?T1_project_id .        } GROUP BY ?T1_project_id ORDER BY ASC ((count( *) as ?aggregation_all))",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_project_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :projects\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql> {\n    ?T1 a :project_staff .\n      ?T1 :project_staff\\#ref-project_id ?T2 .\n      ?T1 :project_staff\\#project_id ?T1_project_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_project_id ORDER BY ASC ((count( *) as ?aggregation_all))",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "tracking_grants_for_research_2074",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "Which project made the most number of outcomes? List the project details and the project id.",
    "original_sparql": "SELECT ?T1_project_details (count( *) as ?aggregation_all) ?T1_project_id WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\\#ref-project_id ?T1 .  ?T1 :projects\\#project_details ?T1_project_details . ?T1 :projects\\#project_id ?T1_project_id .        } GROUP BY ?T1_project_details ?T1_project_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_project_details (count( *) as ?aggregation_all) ?T1_project_id WHERE {\n  {\n    SELECT ?T1 ?T1_project_details ?T1_project_id ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql> {\n    SELECT DISTINCT ?T1 ?T1_project_details ?T1_project_id WHERE {\n      ?T1 a :projects .\n      ?T1 :projects\\#project_details ?T1_project_details .\n      ?T1 :projects\\#project_id ?T1_project_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql> {\n    ?T2 a :project_outcomes .\n      ?T2 :project_outcomes\\#ref-project_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_project_details ?T1_project_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "tracking_grants_for_research_2076",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "Which organisation hired the most number of research staff? List the organisation id, type and detail.",
    "original_sparql": "SELECT ?T1_organisation_id (count( *) as ?aggregation_all) ?T1_organisation_type ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :research_staff . ?T2 :research_staff\\#ref-employer_organisation_id ?T1 .  ?T1 :organisations\\#organisation_id ?T1_organisation_id . ?T1 :organisations\\#organisation_type ?T1_organisation_type . ?T1 :organisations\\#organisation_details ?T1_organisation_details .        } GROUP BY ?T1_organisation_id ?T1_organisation_type ?T1_organisation_details  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_organisation_id (count( *) as ?aggregation_all) ?T1_organisation_type ?T1_organisation_details WHERE {\n  {\n    SELECT ?T1 ?T1_organisation_details ?T1_organisation_id ?T1_organisation_type ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql> {\n    SELECT DISTINCT ?T1 ?T1_organisation_details ?T1_organisation_id ?T1_organisation_type WHERE {\n      ?T1 a :organisations .\n      ?T1 :organisations\\#organisation_id ?T1_organisation_id .\n      ?T1 :organisations\\#organisation_type ?T1_organisation_type .\n      ?T1 :organisations\\#organisation_details ?T1_organisation_details\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql> {\n    ?T2 a :research_staff .\n      ?T2 :research_staff\\#ref-employer_organisation_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_organisation_id ?T1_organisation_type ?T1_organisation_details  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_grants_for_research_2082",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "Find the organisation type description of the organisation detailed as 'quo'.",
    "original_sparql": "SELECT ?T1_organisation_type_description WHERE { ?T1 a :organisation_types . ?T2 a :organisations . ?T2 :organisations\\#ref-organisation_type ?T1 .  ?T1 :organisation_types\\#organisation_type_description ?T1_organisation_type_description . ?T2 :organisations\\#organisation_details ?T2_organisation_details . FILTER(?T2_organisation_details = 'quo') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_organisation_type_description WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql> {\n    SELECT DISTINCT ?T1 ?T1_organisation_type_description WHERE {\n      ?T1 a :organisation_types .\n      ?T1 :organisation_types\\#organisation_type_description ?T1_organisation_type_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql> {\n    ?T2 a :organisations .\n      ?T2 :organisations\\#ref-organisation_type ?T1 .\n      ?T2 :organisations\\#organisation_details ?T2_organisation_details\n      FILTER(?T2_organisation_details = 'quo')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "tracking_grants_for_research_2084",
    "kg_name": "tracking_grants_for_research",
    "split": "train",
    "question": "What are all the details of the organisations described as 'Sponsor'? Sort the result in an ascending order.",
    "original_sparql": "SELECT ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :organisation_types . ?T1 :organisations\\#ref-organisation_type ?T2 .  ?T1 :organisations\\#organisation_details ?T1_organisation_details . ?T1 :organisations\\#organisation_details ?T1_organisation_details . ?T2 :organisation_types\\#organisation_type_description ?T2_organisation_type_description . FILTER(?T2_organisation_type_description = 'Sponsor') .        }  ORDER BY ASC (?T1_organisation_details)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_organisation_details WHERE {\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql> {\n    SELECT DISTINCT ?T2 ?T2_organisation_type_description WHERE {\n      ?T2 a :organisation_types .\n      ?T2 :organisation_types\\#organisation_type_description ?T2_organisation_type_description\n      FILTER(?T2_organisation_type_description = 'Sponsor')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql> {\n    ?T1 a :organisations .\n      ?T1 :organisations\\#ref-organisation_type ?T2 .\n      ?T1 :organisations\\#organisation_details ?T1_organisation_details .\n      ?T1 :organisations\\#organisation_details ?T1_organisation_details\n  }\n}\nORDER BY ASC (?T1_organisation_details)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/tasks",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__tasks/sparql"
      },
      {
        "class": "http://valuenet/ontop/projects",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__projects/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/documents",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__documents/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_staff",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisation_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisation_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/staff_roles",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__staff_roles/sparql"
      },
      {
        "class": "http://valuenet/ontop/grants",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__grants/sparql"
      },
      {
        "class": "http://valuenet/ontop/organisations",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__organisations/sparql"
      },
      {
        "class": "http://valuenet/ontop/project_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__project_outcomes/sparql"
      },
      {
        "class": "http://valuenet/ontop/document_types",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__document_types/sparql"
      },
      {
        "class": "http://valuenet/ontop/research_outcomes",
        "url": "http://host.docker.internal:3030/tracking_grants_for_research__research_outcomes/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 7,
      "federated_count": 7,
      "missing": 0,
      "extra": 0
    }
  }
]