[
  {
    "id": "college_2_412",
    "kg_name": "college_2",
    "split": "train",
    "question": "Give the title of the course offered in Chandler during the Fall of 2010.",
    "original_sparql": "SELECT ?T1_title WHERE { ?T1 a :course . ?T2 a :section . ?T2 :section\\#ref-course_id ?T1 .  ?T1 :course\\#title ?T1_title . ?T2 :section\\#building ?T2_building . ?T2 :section\\#semester ?T2_semester . ?T2 :section\\#year ?T2_year . FILTER(?T2_building = 'Chandler' && ?T2_semester = 'Fall' && ?T2_year = 2010) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__course/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :course .\n      ?T1 :course\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__section/sparql> {\n    ?T2 a :section .\n      ?T2 :section\\#ref-course_id ?T1 .\n      ?T2 :section\\#building ?T2_building .\n      ?T2 :section\\#semester ?T2_semester .\n      ?T2 :section\\#year ?T2_year\n      FILTER(?T2_building = 'Chandler' && ?T2_semester = 'Fall' && ?T2_year = 2010)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_413",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the name of the instructors who taught C Programming course before.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :instructor . ?T13 a :department . ?T1 :instructor\\#ref-dept_name ?T13 .  ?T1 :instructor\\#name ?T1_name . ?T2 :course\\#title ?T2_title . ?T2 a :course . ?T2 :course\\#ref-dept_code ?T13 .  ?T1 :instructor\\#name ?T1_name . ?T2 :course\\#title ?T2_title . FILTER(?T2_title = 'C Programming') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__department/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :department\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__instructor/sparql> {\n    ?T1 a :instructor .\n      ?T1 :instructor\\#ref-dept_name ?T13 .\n      ?T1 :instructor\\#name ?T1_name .\n      ?T1 :instructor\\#name ?T1_name\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__course/sparql> {\n    ?T2 :course\\#title ?T2_title .\n      ?T2 a :course .\n      ?T2 :course\\#ref-dept_code ?T13 .\n      ?T2 :course\\#title ?T2_title\n      FILTER(?T2_title = 'C Programming')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_421",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the number and averaged salary of all instructors who are in the department with the highest budget.",
    "original_sparql": "SELECT (avg( ?T1_salary) as ?aggregation_T1_salary_195 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :instructor . ?T2 a :department . ?T1 :instructor\\#ref-dept_name ?T2 .  ?T1 :instructor\\#salary ?T1_salary . ?T2 :department\\#budget ?T2_budget .        }   ORDER BY DESC (?T2_budget) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (avg( ?T1_salary) as ?aggregation_T1_salary_195 ) (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_salary ?T2 ?T2_budget WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__department/sparql> {\n    SELECT DISTINCT ?T2 ?T2_budget WHERE {\n      ?T2 a :department .\n      ?T2 :department\\#budget ?T2_budget\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__instructor/sparql> {\n    ?T1 a :instructor .\n      ?T1 :instructor\\#ref-dept_name ?T2 .\n      ?T1 :instructor\\#salary ?T1_salary\n  }\n    }\n  }\n}\nORDER BY DESC (?T2_budget) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_424",
    "kg_name": "college_2",
    "split": "train",
    "question": "Give the title and credits for the course that is taught in the classroom with the greatest capacity.",
    "original_sparql": "SELECT ?T1_title ?T1_credits WHERE { ?T1 a :course . ?T13 a :section . ?T13 :section\\#ref-course_id ?T1 .  ?T1 :course\\#title ?T1_title . ?T1 :course\\#credits ?T1_credits . ?T2 :classroom\\#capacity ?T2_capacity . ?T2 a :classroom . ?T13 :section\\#ref-building ?T2 .  ?T1 :course\\#title ?T1_title . ?T1 :course\\#credits ?T1_credits . ?T2 :classroom\\#capacity ?T2_capacity . FILTER(?T2_capacity = (?aggregation_T23_capacity_187)) .       {SELECT (max( ?T23_capacity) as ?aggregation_T23_capacity_187 ) WHERE { ?T23 a :classroom . ?T23 :classroom\\#capacity ?T23_capacity .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title ?T1_credits WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__course/sparql> {\n    SELECT DISTINCT ?T1 ?T1_credits ?T1_title WHERE {\n      ?T1 a :course .\n      ?T1 :course\\#title ?T1_title .\n      ?T1 :course\\#credits ?T1_credits .\n      ?T1 :course\\#title ?T1_title .\n      ?T1 :course\\#credits ?T1_credits\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__classroom/sparql> {\n    SELECT DISTINCT ?T2 ?T2_capacity ?aggregation_T23_capacity_187 WHERE {\n      ?T2 :classroom\\#capacity ?T2_capacity .\n      ?T2 a :classroom .\n      ?T2 :classroom\\#capacity ?T2_capacity\n      FILTER(?T2_capacity = (?aggregation_T23_capacity_187))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__section/sparql> {\n    ?T13 a :section .\n      ?T13 :section\\#ref-course_id ?T1 .\n      ?T13 :section\\#ref-building ?T2\n  }\n  {\n    SELECT (max( ?T23_capacity) as ?aggregation_T23_capacity_187 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/college_2__classroom/sparql> {\n        ?T23 a :classroom . ?T23 :classroom\\#capacity ?T23_capacity . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "college_2_425",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the total number of students and total number of instructors for each department.",
    "original_sparql": "SELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_129 ) (count(DISTINCT ?T2_id) as ?aggregation_T2_id_146 ) ?T2_dept_name WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\\#ref-dept_name ?T13 .  ?T1 :student\\#id ?T1_id . ?T2 :instructor\\#id ?T2_id . ?T2 :instructor\\#dept_name ?T2_dept_name . ?T2 a :instructor . ?T2 :instructor\\#ref-dept_name ?T13 .  ?T1 :student\\#id ?T1_id . ?T2 :instructor\\#id ?T2_id . ?T2 :instructor\\#dept_name ?T2_dept_name .        } GROUP BY ?T2_dept_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_129 ) (count(DISTINCT ?T2_id) as ?aggregation_T2_id_146 ) ?T2_dept_name WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_id ?T2 ?T2_dept_name ?T2_id WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__department/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :department\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__student/sparql> {\n    ?T1 a :student .\n      ?T1 :student\\#ref-dept_name ?T13 .\n      ?T1 :student\\#id ?T1_id .\n      ?T1 :student\\#id ?T1_id\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__instructor/sparql> {\n    ?T2 :instructor\\#id ?T2_id .\n      ?T2 :instructor\\#dept_name ?T2_dept_name .\n      ?T2 a :instructor .\n      ?T2 :instructor\\#ref-dept_name ?T13 .\n      ?T2 :instructor\\#id ?T2_id .\n      ?T2 :instructor\\#dept_name ?T2_dept_name\n  }\n    }\n  }\n}\nGROUP BY ?T2_dept_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 17,
      "federated_count": 17,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_427",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the name of students who have taken the prerequisite course of the course with title International Finance.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :student . ?T2 a :takes . ?T2 :takes\\#ref-id ?T1 .  ?T1 :student\\#name ?T1_name . ?T2 :takes\\#course_id ?T2_course_id . FILTER(?T2_course_id in (?T24_title)) .       {SELECT ?T23_prereq_id WHERE { ?T23 a :prereq . ?T24 a :course . ?T23 :prereq\\#ref-course_id ?T24 .  ?T23 :prereq\\#prereq_id ?T23_prereq_id . ?T24 :course\\#title ?T24_title . FILTER(?T24_title = 'International Finance') .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__student/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :student .\n      ?T1 :student\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__takes/sparql> {\n    SELECT DISTINCT ?T1 ?T2 WHERE {\n      ?T2 a :takes .\n      ?T2 :takes\\#ref-id ?T1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__course/sparql> {\n    ?T2 :takes\\#course_id ?T2_course_id\n      FILTER(?T2_course_id in (?T24_title))\n  }\n  {\n    SELECT ?T23_prereq_id WHERE {\n      SERVICE <http://host.docker.internal:3030/college_2__prereq/sparql> {\n        ?T23 a :prereq . ?T24 a :course . ?T23 :prereq\\#ref-course_id ?T24 . ?T23 :prereq\\#prereq_id ?T23_prereq_id . ?T24 :course\\#title ?T24_title . FILTER(?T24_title = 'International Finance') . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "college_2_429",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the name of students who took some course offered by Statistics department.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\\#ref-dept_name ?T13 .  ?T1 :student\\#name ?T1_name . ?T2 :course\\#dept_name ?T2_dept_name . ?T2 a :course . ?T2 :course\\#ref-dept_code ?T13 .  ?T1 :student\\#name ?T1_name . ?T2 :course\\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Statistics') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__department/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :department\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__student/sparql> {\n    ?T1 a :student .\n      ?T1 :student\\#ref-dept_name ?T13 .\n      ?T1 :student\\#name ?T1_name .\n      ?T1 :student\\#name ?T1_name\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__course/sparql> {\n    ?T2 :course\\#dept_name ?T2_dept_name .\n      ?T2 a :course .\n      ?T2 :course\\#ref-dept_code ?T13 .\n      ?T2 :course\\#dept_name ?T2_dept_name\n      FILTER(?T2_dept_name = 'Statistics')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_431",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the building, room number, semester and year of all courses offered by Psychology department sorted by course titles.",
    "original_sparql": "SELECT ?T1_building ?T1_room_number ?T1_semester ?T1_year WHERE { ?T1 a :section . ?T2 a :course . ?T1 :section\\#ref-course_id ?T2 .  ?T1 :section\\#building ?T1_building . ?T1 :section\\#room_number ?T1_room_number . ?T1 :section\\#semester ?T1_semester . ?T1 :section\\#year ?T1_year . ?T2 :course\\#title ?T2_title . ?T2 :course\\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Psychology') .        }  ORDER BY ASC (?T2_title)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_building ?T1_room_number ?T1_semester ?T1_year WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__course/sparql> {\n    SELECT DISTINCT ?T2 ?T2_dept_name ?T2_title WHERE {\n      ?T2 a :course .\n      ?T2 :course\\#title ?T2_title .\n      ?T2 :course\\#dept_name ?T2_dept_name\n      FILTER(?T2_dept_name = 'Psychology')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__section/sparql> {\n    ?T1 a :section .\n      ?T1 :section\\#ref-course_id ?T2 .\n      ?T1 :section\\#building ?T1_building .\n      ?T1 :section\\#room_number ?T1_room_number .\n      ?T1 :section\\#semester ?T1_semester .\n      ?T1 :section\\#year ?T1_year\n  }\n}\nORDER BY ASC (?T2_title)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 12,
      "federated_count": 12,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_433",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the names of all instructors who have taught some course and the course_id.",
    "original_sparql": "SELECT ?T1_name ?T2_course_id WHERE { ?T1 a :instructor . ?T2 a :teaches . ?T2 :teaches\\#ref-id ?T1 .  ?T1 :instructor\\#name ?T1_name . ?T2 :teaches\\#course_id ?T2_course_id .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_course_id WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__instructor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :instructor .\n      ?T1 :instructor\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__teaches/sparql> {\n    ?T2 a :teaches .\n      ?T2 :teaches\\#ref-id ?T1 .\n      ?T2 :teaches\\#course_id ?T2_course_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 90,
      "federated_count": 90,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "college_2_435",
    "kg_name": "college_2",
    "split": "train",
    "question": "Find the names of all instructors in the Art department who have taught some course and the course_id.",
    "original_sparql": "SELECT ?T1_name ?T2_course_id WHERE { ?T1 a :instructor . ?T2 a :teaches . ?T2 :teaches\\#ref-id ?T1 .  ?T1 :instructor\\#name ?T1_name . ?T2 :teaches\\#course_id ?T2_course_id . ?T1 :instructor\\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Art') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name ?T2_course_id WHERE {\n  SERVICE <http://host.docker.internal:3030/college_2__instructor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_dept_name ?T1_name WHERE {\n      ?T1 a :instructor .\n      ?T1 :instructor\\#name ?T1_name .\n      ?T1 :instructor\\#dept_name ?T1_dept_name\n      FILTER(?T1_dept_name = 'Art')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/college_2__teaches/sparql> {\n    ?T2 a :teaches .\n      ?T2 :teaches\\#ref-id ?T1 .\n      ?T2 :teaches\\#course_id ?T2_course_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/takes",
        "url": "http://host.docker.internal:3030/college_2__takes/sparql"
      },
      {
        "class": "http://valuenet/ontop/student",
        "url": "http://host.docker.internal:3030/college_2__student/sparql"
      },
      {
        "class": "http://valuenet/ontop/advisor",
        "url": "http://host.docker.internal:3030/college_2__advisor/sparql"
      },
      {
        "class": "http://valuenet/ontop/section",
        "url": "http://host.docker.internal:3030/college_2__section/sparql"
      },
      {
        "class": "http://valuenet/ontop/teaches",
        "url": "http://host.docker.internal:3030/college_2__teaches/sparql"
      },
      {
        "class": "http://valuenet/ontop/course",
        "url": "http://host.docker.internal:3030/college_2__course/sparql"
      },
      {
        "class": "http://valuenet/ontop/instructor",
        "url": "http://host.docker.internal:3030/college_2__instructor/sparql"
      },
      {
        "class": "http://valuenet/ontop/classroom",
        "url": "http://host.docker.internal:3030/college_2__classroom/sparql"
      },
      {
        "class": "http://valuenet/ontop/prereq",
        "url": "http://host.docker.internal:3030/college_2__prereq/sparql"
      },
      {
        "class": "http://valuenet/ontop/time_slot",
        "url": "http://host.docker.internal:3030/college_2__time_slot/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/college_2__department/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  }
]