[
  {
    "id": "hospital_1_1153",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the number of patients' prescriptions physician John Dorian made.",
    "original_sparql": "SELECT (count( ?T1_ssn) as ?aggregation_T1_ssn_199 ) WHERE { ?T1 a :patient . ?T2 a :physician . ?T1 :patient\\#ref-pcp ?T2 .  ?T1 :patient\\#ssn ?T1_ssn . ?T2 :physician\\#name ?T2_name . FILTER(?T2_name = 'John Dorian') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( ?T1_ssn) as ?aggregation_T1_ssn_199 ) WHERE {\n  {\n    SELECT ?T1 ?T1_ssn ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 a :physician .\n      ?T2 :physician\\#name ?T2_name\n      FILTER(?T2_name = 'John Dorian')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__patient/sparql> {\n    ?T1 a :patient .\n      ?T1 :patient\\#ref-pcp ?T2 .\n      ?T1 :patient\\#ssn ?T1_ssn\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1157",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the name of the nurse who has the largest number of appointments.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :nurse . ?T2 a :appointment . ?T2 :appointment\\#ref-prepnurse ?T1 .  ?T1 :nurse\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__nurse/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :nurse .\n      ?T1 :nurse\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__appointment/sparql> {\n    ?T2 a :appointment .\n      ?T2 :appointment\\#ref-prepnurse ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1158",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "How many patients do each physician take care of? List their names and number of patients they take care of.",
    "original_sparql": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :physician . ?T2 a :patient . ?T2 :patient\\#ref-pcp ?T1 .  ?T1 :physician\\#name ?T1_name .        } GROUP BY ?T1_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__patient/sparql> {\n    ?T2 a :patient .\n      ?T2 :patient\\#ref-pcp ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1160",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the name of physicians who are in charge of more than one patient.",
    "original_sparql": "SELECT ?T1_name WHERE { ?T1 a :physician . ?T2 a :patient . ?T2 :patient\\#ref-pcp ?T1 .  ?T1 :physician\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_name WHERE {\n  {\n    SELECT ?T1 ?T1_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__patient/sparql> {\n    ?T2 a :patient .\n      ?T2 :patient\\#ref-pcp ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_name   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1162",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the number of rooms located on each block floor.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_blockfloor WHERE { ?T1 a :room . ?T2 a :block . ?T1 :room\\#ref-blockfloor ?T2 .  ?T2 :block\\#blockfloor ?T2_blockfloor .        } GROUP BY ?T2_blockfloor",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_blockfloor WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_blockfloor WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__room/sparql> {\n    SELECT DISTINCT ?T1 WHERE {\n      ?T1 a :room\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__block/sparql> {\n    ?T2 a :block .\n      ?T1 :room\\#ref-blockfloor ?T2 .\n      ?T2 :block\\#blockfloor ?T2_blockfloor\n  }\n    }\n  }\n}\nGROUP BY ?T2_blockfloor",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1167",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "List the names of all the physicians who prescribe Thesisin as medication.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :physician . ?T13 a :prescribes . ?T13 :prescribes\\#ref-physician ?T1 .  ?T1 :physician\\#name ?T1_name . ?T2 :medication\\#name ?T2_name . ?T2 a :medication . ?T13 :prescribes\\#ref-medication ?T2 .  ?T1 :physician\\#name ?T1_name . ?T2 :medication\\#name ?T2_name . FILTER(?T2_name = 'Thesisin') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name .\n      ?T1 :physician\\#name ?T1_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__medication/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 :medication\\#name ?T2_name .\n      ?T2 a :medication .\n      ?T2 :medication\\#name ?T2_name\n      FILTER(?T2_name = 'Thesisin')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__prescribes/sparql> {\n    ?T13 a :prescribes .\n      ?T13 :prescribes\\#ref-physician ?T1 .\n      ?T13 :prescribes\\#ref-medication ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1169",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Which physicians prescribe a medication of brand X? Tell me the name and position of those physicians.",
    "original_sparql": "SELECT DISTINCT ?T1_name ?T1_position WHERE { ?T1 a :physician . ?T13 a :prescribes . ?T13 :prescribes\\#ref-physician ?T1 .  ?T1 :physician\\#name ?T1_name . ?T1 :physician\\#position ?T1_position . ?T2 :medication\\#brand ?T2_brand . ?T2 a :medication . ?T13 :prescribes\\#ref-medication ?T2 .  ?T1 :physician\\#name ?T1_name . ?T1 :physician\\#position ?T1_position . ?T2 :medication\\#brand ?T2_brand . FILTER(?T2_brand = 'X') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name ?T1_position WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__physician/sparql> {\n    SELECT DISTINCT ?T1 ?T1_name ?T1_position WHERE {\n      ?T1 a :physician .\n      ?T1 :physician\\#name ?T1_name .\n      ?T1 :physician\\#position ?T1_position .\n      ?T1 :physician\\#name ?T1_name .\n      ?T1 :physician\\#position ?T1_position\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__medication/sparql> {\n    SELECT DISTINCT ?T2 ?T2_brand WHERE {\n      ?T2 :medication\\#brand ?T2_brand .\n      ?T2 a :medication .\n      ?T2 :medication\\#brand ?T2_brand\n      FILTER(?T2_brand = 'X')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__prescribes/sparql> {\n    ?T13 a :prescribes .\n      ?T13 :prescribes\\#ref-physician ?T1 .\n      ?T13 :prescribes\\#ref-medication ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1170",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the number of medications prescribed for each brand.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :prescribes . ?T2 a :medication . ?T1 :prescribes\\#ref-medication ?T2 .  ?T2 :medication\\#name ?T2_name .        } GROUP BY ?T2_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) ?T2_name WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__medication/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :medication .\n      ?T2 :medication\\#name ?T2_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__prescribes/sparql> {\n    ?T1 a :prescribes .\n      ?T1 :prescribes\\#ref-medication ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "hospital_1_1172",
    "kg_name": "hospital_1",
    "split": "train",
    "question": "Find the names of all patients who have an undergoing treatment and are staying in room 111.",
    "original_sparql": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :patient . ?T2 a :stay . ?T2 :stay\\#ref-patient ?T1 .  ?T1 :patient\\#name ?T1_name . ?T2 :stay\\#room ?T2_room . FILTER(?T2_room = 111) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_name WHERE {\n  SERVICE <http://host.docker.internal:3030/hospital_1__stay/sparql> {\n    SELECT DISTINCT ?T2 ?T2_room WHERE {\n      ?T2 a :stay .\n      ?T2 :stay\\#room ?T2_room\n      FILTER(?T2_room = 111)\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/hospital_1__patient/sparql> {\n    ?T1 a :patient .\n      ?T2 :stay\\#ref-patient ?T1 .\n      ?T1 :patient\\#name ?T1_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/appointment",
        "url": "http://host.docker.internal:3030/hospital_1__appointment/sparql"
      },
      {
        "class": "http://valuenet/ontop/affiliated_with",
        "url": "http://host.docker.internal:3030/hospital_1__affiliated_with/sparql"
      },
      {
        "class": "http://valuenet/ontop/undergoes",
        "url": "http://host.docker.internal:3030/hospital_1__undergoes/sparql"
      },
      {
        "class": "http://valuenet/ontop/patient",
        "url": "http://host.docker.internal:3030/hospital_1__patient/sparql"
      },
      {
        "class": "http://valuenet/ontop/trained_in",
        "url": "http://host.docker.internal:3030/hospital_1__trained_in/sparql"
      },
      {
        "class": "http://valuenet/ontop/room",
        "url": "http://host.docker.internal:3030/hospital_1__room/sparql"
      },
      {
        "class": "http://valuenet/ontop/medication",
        "url": "http://host.docker.internal:3030/hospital_1__medication/sparql"
      },
      {
        "class": "http://valuenet/ontop/physician",
        "url": "http://host.docker.internal:3030/hospital_1__physician/sparql"
      },
      {
        "class": "http://valuenet/ontop/on_call",
        "url": "http://host.docker.internal:3030/hospital_1__on_call/sparql"
      },
      {
        "class": "http://valuenet/ontop/stay",
        "url": "http://host.docker.internal:3030/hospital_1__stay/sparql"
      },
      {
        "class": "http://valuenet/ontop/procedures",
        "url": "http://host.docker.internal:3030/hospital_1__procedures/sparql"
      },
      {
        "class": "http://valuenet/ontop/prescribes",
        "url": "http://host.docker.internal:3030/hospital_1__prescribes/sparql"
      },
      {
        "class": "http://valuenet/ontop/department",
        "url": "http://host.docker.internal:3030/hospital_1__department/sparql"
      },
      {
        "class": "http://valuenet/ontop/nurse",
        "url": "http://host.docker.internal:3030/hospital_1__nurse/sparql"
      },
      {
        "class": "http://valuenet/ontop/block",
        "url": "http://host.docker.internal:3030/hospital_1__block/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  }
]