[
  {
    "id": "driving_school_834",
    "kg_name": "driving_school",
    "split": "train",
    "question": "Which city lives most of staffs? List the city name and number of staffs.",
    "original_sparql": "SELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\\#ref-staff_address_id ?T1 .  ?T1 :addresses\\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_city ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/driving_school__addresses/sparql> {\n    SELECT DISTINCT ?T1 ?T1_city WHERE {\n      ?T1 a :addresses .\n      ?T1 :addresses\\#city ?T1_city\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/driving_school__staff/sparql> {\n    ?T2 a :staff .\n      ?T2 :staff\\#ref-staff_address_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/driving_school__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/driving_school__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_payments",
        "url": "http://host.docker.internal:3030/driving_school__customer_payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/driving_school__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/lessons",
        "url": "http://host.docker.internal:3030/driving_school__lessons/sparql"
      },
      {
        "class": "http://valuenet/ontop/vehicles",
        "url": "http://host.docker.internal:3030/driving_school__vehicles/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "driving_school_836",
    "kg_name": "driving_school",
    "split": "train",
    "question": "List the states which have between 2 to 4 staffs living there.",
    "original_sparql": "SELECT ?T1_state_province_county WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\\#ref-staff_address_id ?T1 .  ?T1 :addresses\\#state_province_county ?T1_state_province_county .        } GROUP BY ?T1_state_province_county   HAVING(count( *)  >= 2 && count( *)  <= 4)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_state_province_county WHERE {\n  {\n    SELECT ?T1 ?T1_state_province_county ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/driving_school__addresses/sparql> {\n    SELECT DISTINCT ?T1 ?T1_state_province_county WHERE {\n      ?T1 a :addresses .\n      ?T1 :addresses\\#state_province_county ?T1_state_province_county\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/driving_school__staff/sparql> {\n    ?T2 a :staff .\n      ?T2 :staff\\#ref-staff_address_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_state_province_county   HAVING(count( *)  >= 2 && count( *)  <= 4)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/driving_school__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/driving_school__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_payments",
        "url": "http://host.docker.internal:3030/driving_school__customer_payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/driving_school__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/lessons",
        "url": "http://host.docker.internal:3030/driving_school__lessons/sparql"
      },
      {
        "class": "http://valuenet/ontop/vehicles",
        "url": "http://host.docker.internal:3030/driving_school__vehicles/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "driving_school_840",
    "kg_name": "driving_school",
    "split": "train",
    "question": "List first name and last name of customers lived in city Lockmanfurt.",
    "original_sparql": "SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\\#ref-address_id ?T2 .  ?T1 :customers\\#first_name ?T1_first_name . ?T1 :customers\\#last_name ?T1_last_name . ?T2 :addresses\\#city ?T2_city . FILTER(?T2_city = 'Lockmanfurt') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name ?T1_last_name WHERE {\n  SERVICE <http://host.docker.internal:3030/driving_school__addresses/sparql> {\n    SELECT DISTINCT ?T2 ?T2_city WHERE {\n      ?T2 a :addresses .\n      ?T2 :addresses\\#city ?T2_city\n      FILTER(?T2_city = 'Lockmanfurt')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/driving_school__customers/sparql> {\n    ?T1 a :customers .\n      ?T1 :customers\\#ref-address_id ?T2 .\n      ?T1 :customers\\#first_name ?T1_first_name .\n      ?T1 :customers\\#last_name ?T1_last_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/driving_school__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/driving_school__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_payments",
        "url": "http://host.docker.internal:3030/driving_school__customer_payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/driving_school__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/lessons",
        "url": "http://host.docker.internal:3030/driving_school__lessons/sparql"
      },
      {
        "class": "http://valuenet/ontop/vehicles",
        "url": "http://host.docker.internal:3030/driving_school__vehicles/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "driving_school_850",
    "kg_name": "driving_school",
    "split": "train",
    "question": "List first name and last name of customers that have more than 2 payments.",
    "original_sparql": "SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T2 a :customer_payments . ?T2 :customer_payments\\#ref-customer_id ?T1 .  ?T1 :customers\\#first_name ?T1_first_name . ?T1 :customers\\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 2)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name ?T1_last_name WHERE {\n  {\n    SELECT ?T1 ?T1_first_name ?T1_last_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/driving_school__customers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_first_name ?T1_last_name WHERE {\n      ?T1 a :customers .\n      ?T1 :customers\\#first_name ?T1_first_name .\n      ?T1 :customers\\#last_name ?T1_last_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/driving_school__customer_payments/sparql> {\n    ?T2 a :customer_payments .\n      ?T2 :customer_payments\\#ref-customer_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 2)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/driving_school__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/driving_school__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_payments",
        "url": "http://host.docker.internal:3030/driving_school__customer_payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/driving_school__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/lessons",
        "url": "http://host.docker.internal:3030/driving_school__lessons/sparql"
      },
      {
        "class": "http://valuenet/ontop/vehicles",
        "url": "http://host.docker.internal:3030/driving_school__vehicles/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "driving_school_852",
    "kg_name": "driving_school",
    "split": "train",
    "question": "List lesson id of all lessons taught by staff with first name as Janessa, last name as Sawayn and nickname containing letter 's'.",
    "original_sparql": "SELECT ?T1_lesson_id WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :lessons\\#ref-staff_id ?T2 .  ?T1 :lessons\\#lesson_id ?T1_lesson_id . ?T2 :staff\\#first_name ?T2_first_name . ?T2 :staff\\#last_name ?T2_last_name . ?T2 :staff\\#nickname ?T2_nickname . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn' && contains (?T2_nickname, 's')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_lesson_id WHERE {\n  SERVICE <http://host.docker.internal:3030/driving_school__staff/sparql> {\n    SELECT DISTINCT ?T2 ?T2_first_name ?T2_last_name ?T2_nickname WHERE {\n      ?T2 a :staff .\n      ?T2 :staff\\#first_name ?T2_first_name .\n      ?T2 :staff\\#last_name ?T2_last_name .\n      ?T2 :staff\\#nickname ?T2_nickname\n      FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn' && contains (?T2_nickname, 's'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/driving_school__lessons/sparql> {\n    ?T1 a :lessons .\n      ?T1 :lessons\\#ref-staff_id ?T2 .\n      ?T1 :lessons\\#lesson_id ?T1_lesson_id\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/staff",
        "url": "http://host.docker.internal:3030/driving_school__staff/sparql"
      },
      {
        "class": "http://valuenet/ontop/customers",
        "url": "http://host.docker.internal:3030/driving_school__customers/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer_payments",
        "url": "http://host.docker.internal:3030/driving_school__customer_payments/sparql"
      },
      {
        "class": "http://valuenet/ontop/addresses",
        "url": "http://host.docker.internal:3030/driving_school__addresses/sparql"
      },
      {
        "class": "http://valuenet/ontop/lessons",
        "url": "http://host.docker.internal:3030/driving_school__lessons/sparql"
      },
      {
        "class": "http://valuenet/ontop/vehicles",
        "url": "http://host.docker.internal:3030/driving_school__vehicles/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_865",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the login name of the course author that teaches the course with name 'advanced database'.",
    "original_sparql": "SELECT ?T1_login_name WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\\#login_name ?T1_login_name . ?T2 :courses\\#course_name ?T2_course_name . FILTER(?T2_course_name = 'advanced database') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_login_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_login_name WHERE {\n      ?T1 a :course_authors_and_tutors .\n      ?T1 :course_authors_and_tutors\\#login_name ?T1_login_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    ?T2 a :courses .\n      ?T2 :courses\\#ref-author_id ?T1 .\n      ?T2 :courses\\#course_name ?T2_course_name\n      FILTER(?T2_course_name = 'advanced database')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_867",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the addresses of the course authors who teach the course with name 'operating system' or 'data structure'.",
    "original_sparql": "SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\\#address_line_1 ?T1_address_line_1 . ?T2 :courses\\#course_name ?T2_course_name . ?T2 :courses\\#course_name ?T2_course_name . FILTER(?T2_course_name = 'operating system' || ?T2_course_name = 'data structure') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_address_line_1 WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_address_line_1 WHERE {\n      ?T1 a :course_authors_and_tutors .\n      ?T1 :course_authors_and_tutors\\#address_line_1 ?T1_address_line_1\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    ?T2 a :courses .\n      ?T2 :courses\\#ref-author_id ?T1 .\n      ?T2 :courses\\#course_name ?T2_course_name .\n      ?T2 :courses\\#course_name ?T2_course_name\n      FILTER(?T2_course_name = 'operating system' || ?T2_course_name = 'data structure')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_869",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the personal name, family name, and author ID of the course author that teaches the most courses.",
    "original_sparql": "SELECT ?T1_personal_name (count( *) as ?aggregation_all) ?T1_family_name ?T2_author_id WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\\#personal_name ?T1_personal_name . ?T1 :course_authors_and_tutors\\#family_name ?T1_family_name . ?T2 :courses\\#author_id ?T2_author_id .        } GROUP BY ?T1_personal_name ?T1_family_name ?T2_author_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_personal_name (count( *) as ?aggregation_all) ?T1_family_name ?T2_author_id WHERE {\n  {\n    SELECT ?T1 ?T1_family_name ?T1_personal_name ?T2 ?T2_author_id WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_family_name ?T1_personal_name WHERE {\n      ?T1 a :course_authors_and_tutors .\n      ?T1 :course_authors_and_tutors\\#personal_name ?T1_personal_name .\n      ?T1 :course_authors_and_tutors\\#family_name ?T1_family_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    ?T2 a :courses .\n      ?T2 :courses\\#ref-author_id ?T1 .\n      ?T2 :courses\\#author_id ?T2_author_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_personal_name ?T1_family_name ?T2_author_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_873",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the names of courses taught by the tutor who has personal name 'Julio'.",
    "original_sparql": "SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :course_authors_and_tutors . ?T1 :courses\\#ref-author_id ?T2 .  ?T1 :courses\\#course_name ?T1_course_name . ?T2 :course_authors_and_tutors\\#personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Julio') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_course_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_personal_name WHERE {\n      ?T2 a :course_authors_and_tutors .\n      ?T2 :course_authors_and_tutors\\#personal_name ?T2_personal_name\n      FILTER(?T2_personal_name = 'Julio')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    ?T1 a :courses .\n      ?T1 :courses\\#ref-author_id ?T2 .\n      ?T1 :courses\\#course_name ?T1_course_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_875",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the names and descriptions of courses that belong to the subject named 'Computer Science'.",
    "original_sparql": "SELECT ?T1_course_name ?T1_course_description WHERE { ?T1 a :courses . ?T2 a :subjects . ?T1 :courses\\#ref-subject_id ?T2 .  ?T1 :courses\\#course_name ?T1_course_name . ?T1 :courses\\#course_description ?T1_course_description . ?T2 :subjects\\#subject_name ?T2_subject_name . FILTER(?T2_subject_name = 'Computer Science') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_course_name ?T1_course_description WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__subjects/sparql> {\n    SELECT DISTINCT ?T2 ?T2_subject_name WHERE {\n      ?T2 a :subjects .\n      ?T2 :subjects\\#subject_name ?T2_subject_name\n      FILTER(?T2_subject_name = 'Computer Science')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    ?T1 a :courses .\n      ?T1 :courses\\#ref-subject_id ?T2 .\n      ?T1 :courses\\#course_name ?T1_course_name .\n      ?T1 :courses\\#course_description ?T1_course_description\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 6,
      "federated_count": 6,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_877",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the subject ID, subject name, and the corresponding number of available courses for each subject.",
    "original_sparql": "SELECT ?T1_subject_id ?T2_subject_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :subjects . ?T1 :courses\\#ref-subject_id ?T2 .  ?T1 :courses\\#subject_id ?T1_subject_id . ?T2 :subjects\\#subject_name ?T2_subject_name .        } GROUP BY ?T1_subject_id ?T2_subject_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_subject_id ?T2_subject_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_subject_id ?T2 ?T2_subject_name WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__subjects/sparql> {\n    SELECT DISTINCT ?T2 ?T2_subject_name WHERE {\n      ?T2 a :subjects .\n      ?T2 :subjects\\#subject_name ?T2_subject_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    ?T1 a :courses .\n      ?T1 :courses\\#ref-subject_id ?T2 .\n      ?T1 :courses\\#subject_id ?T1_subject_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_subject_id ?T2_subject_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_882",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Find the the date of enrollment of the 'Spanish' course.",
    "original_sparql": "SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :courses . ?T1 :student_course_enrolment\\#ref-course_id ?T2 .  ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment . ?T2 :courses\\#course_name ?T2_course_name . FILTER(?T2_course_name = 'Spanish') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_date_of_enrolment WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    SELECT DISTINCT ?T2 ?T2_course_name WHERE {\n      ?T2 a :courses .\n      ?T2 :courses\\#course_name ?T2_course_name\n      FILTER(?T2_course_name = 'Spanish')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T1 a :student_course_enrolment .\n      ?T1 :student_course_enrolment\\#ref-course_id ?T2 .\n      ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "e_learning_884",
    "kg_name": "e_learning",
    "split": "train",
    "question": "Which course is enrolled in by the most students? Give me the course name.",
    "original_sparql": "SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :student_course_enrolment\\#ref-course_id ?T1 .  ?T1 :courses\\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_course_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/e_learning__courses/sparql> {\n    SELECT DISTINCT ?T1 ?T1_course_name WHERE {\n      ?T1 a :courses .\n      ?T1 :courses\\#course_name ?T1_course_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql> {\n    ?T2 a :student_course_enrolment .\n      ?T2 :student_course_enrolment\\#ref-course_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_course_name  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/student_course_enrolment",
        "url": "http://host.docker.internal:3030/e_learning__student_course_enrolment/sparql"
      },
      {
        "class": "http://valuenet/ontop/students",
        "url": "http://host.docker.internal:3030/e_learning__students/sparql"
      },
      {
        "class": "http://valuenet/ontop/course_authors_and_tutors",
        "url": "http://host.docker.internal:3030/e_learning__course_authors_and_tutors/sparql"
      },
      {
        "class": "http://valuenet/ontop/courses",
        "url": "http://host.docker.internal:3030/e_learning__courses/sparql"
      },
      {
        "class": "http://valuenet/ontop/student_tests_taken",
        "url": "http://host.docker.internal:3030/e_learning__student_tests_taken/sparql"
      },
      {
        "class": "http://valuenet/ontop/subjects",
        "url": "http://host.docker.internal:3030/e_learning__subjects/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]