[
  {
    "id": "icfp_1_1226",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Who belong to the institution 'University of Oxford'? Show the first names and last names.",
    "original_sparql": "SELECT DISTINCT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\\#ref-authid ?T1 .  ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . ?T2 :inst\\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\\#ref-instid ?T2 .  ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . ?T2 :inst\\#name ?T2_name . FILTER(?T2_name = 'University of Oxford') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_fname ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname ?T1_lname WHERE {\n      ?T1 a :authors .\n      ?T1 :authors\\#fname ?T1_fname .\n      ?T1 :authors\\#lname ?T1_lname .\n      ?T1 :authors\\#fname ?T1_fname .\n      ?T1 :authors\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__inst/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 :inst\\#name ?T2_name .\n      ?T2 a :inst .\n      ?T2 :inst\\#name ?T2_name\n      FILTER(?T2_name = 'University of Oxford')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-authid ?T1 .\n      ?T13 :authorship\\#ref-instid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1228",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Which authors belong to the institution 'Google'? Show the first names and last names.",
    "original_sparql": "SELECT DISTINCT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\\#ref-authid ?T1 .  ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . ?T2 :inst\\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\\#ref-instid ?T2 .  ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . ?T2 :inst\\#name ?T2_name . FILTER(?T2_name = 'Google') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_fname ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname ?T1_lname WHERE {\n      ?T1 a :authors .\n      ?T1 :authors\\#fname ?T1_fname .\n      ?T1 :authors\\#lname ?T1_lname .\n      ?T1 :authors\\#fname ?T1_fname .\n      ?T1 :authors\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__inst/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 :inst\\#name ?T2_name .\n      ?T2 a :inst .\n      ?T2 :inst\\#name ?T2_name\n      FILTER(?T2_name = 'Google')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-authid ?T1 .\n      ?T13 :authorship\\#ref-instid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1231",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Who is the author of the paper titled 'Binders Unbound'? Give me the last name.",
    "original_sparql": "SELECT ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\\#ref-authid ?T1 .  ?T1 :authors\\#lname ?T1_lname . ?T2 :papers\\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\\#ref-paperid ?T2 .  ?T1 :authors\\#lname ?T1_lname . ?T2 :papers\\#title ?T2_title . FILTER(?T2_title = 'Binders Unbound') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_lname WHERE {\n      ?T1 a :authors .\n      ?T1 :authors\\#lname ?T1_lname .\n      ?T1 :authors\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_title WHERE {\n      ?T2 :papers\\#title ?T2_title .\n      ?T2 a :papers .\n      ?T2 :papers\\#title ?T2_title\n      FILTER(?T2_title = 'Binders Unbound')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-authid ?T1 .\n      ?T13 :authorship\\#ref-paperid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1232",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find the first and last name of the author(s) who wrote the paper 'Nameless, Painless'.",
    "original_sparql": "SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\\#ref-authid ?T1 .  ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . ?T2 :papers\\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\\#ref-paperid ?T2 .  ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . ?T2 :papers\\#title ?T2_title . FILTER(?T2_title = 'Nameless ,  Painless') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fname ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname ?T1_lname WHERE {\n      ?T1 a :authors .\n      ?T1 :authors\\#fname ?T1_fname .\n      ?T1 :authors\\#lname ?T1_lname .\n      ?T1 :authors\\#fname ?T1_fname .\n      ?T1 :authors\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_title WHERE {\n      ?T2 :papers\\#title ?T2_title .\n      ?T2 a :papers .\n      ?T2 :papers\\#title ?T2_title\n      FILTER(?T2_title = 'Nameless ,  Painless')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-authid ?T1 .\n      ?T13 :authorship\\#ref-paperid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1235",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "List the titles of the papers whose authors are from the institution 'Indiana University'.",
    "original_sparql": "SELECT DISTINCT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\\#ref-instid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . FILTER(?T2_name = 'Indiana University') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_title WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__inst/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 :inst\\#name ?T2_name .\n      ?T2 a :inst .\n      ?T2 :inst\\#name ?T2_name\n      FILTER(?T2_name = 'Indiana University')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-paperid ?T1 .\n      ?T13 :authorship\\#ref-instid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1239",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find the number of papers published by authors from the institution 'Tokohu University'.",
    "original_sparql": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_91 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\\#ref-instid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . FILTER(?T2_name = 'Tokohu University') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_91 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_title ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__inst/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :inst\\#name ?T2_name .\n      ?T2 a :inst .\n      ?T2 :inst\\#name ?T2_name\n      FILTER(?T2_name = 'Tokohu University')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-paperid ?T1 .\n      ?T13 :authorship\\#ref-instid ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1240",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find the number of papers published by the institution 'University of Pennsylvania'.",
    "original_sparql": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_48 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\\#ref-instid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . FILTER(?T2_name = 'University of Pennsylvania') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_48 ) WHERE {\n  {\n    SELECT ?T1 ?T13 ?T1_title ?T2 ?T2_name WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__inst/sparql> {\n    SELECT DISTINCT ?T2 WHERE {\n      ?T2 :inst\\#name ?T2_name .\n      ?T2 a :inst .\n      ?T2 :inst\\#name ?T2_name\n      FILTER(?T2_name = 'University of Pennsylvania')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-paperid ?T1 .\n      ?T13 :authorship\\#ref-instid ?T2\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1242",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find the papers which have 'Olin Shivers' as an author.",
    "original_sparql": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\\#ref-authid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . FILTER(?T2_fname = 'Olin' && ?T2_lname = 'Shivers') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_fname ?T2_lname WHERE {\n      ?T2 :authors\\#fname ?T2_fname .\n      ?T2 :authors\\#lname ?T2_lname .\n      ?T2 a :authors .\n      ?T2 :authors\\#fname ?T2_fname .\n      ?T2 :authors\\#lname ?T2_lname\n      FILTER(?T2_fname = 'Olin' && ?T2_lname = 'Shivers')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-paperid ?T1 .\n      ?T13 :authorship\\#ref-authid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1245",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find the titles of the papers the author 'Stephanie Weirich' wrote.",
    "original_sparql": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\\#ref-authid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . FILTER(?T2_fname = 'Stephanie' && ?T2_lname = 'Weirich') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T2 ?T2_fname ?T2_lname WHERE {\n      ?T2 :authors\\#fname ?T2_fname .\n      ?T2 :authors\\#lname ?T2_lname .\n      ?T2 a :authors .\n      ?T2 :authors\\#fname ?T2_fname .\n      ?T2 :authors\\#lname ?T2_lname\n      FILTER(?T2_fname = 'Stephanie' && ?T2_lname = 'Weirich')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-paperid ?T1 .\n      ?T13 :authorship\\#ref-authid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1247",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find papers whose second author has last name 'Turon' and is affiliated with an institution in the country 'USA'.",
    "original_sparql": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T3 a :authorship . ?T3 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#country ?T2_country . ?T3 :authorship\\#authorder ?T3_authorder . ?T4 :authors\\#lname ?T4_lname . ?T2 a :inst . ?T3 :authorship\\#ref-instid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#country ?T2_country . ?T3 :authorship\\#authorder ?T3_authorder . ?T4 :authors\\#lname ?T4_lname . ?T4 a :authors . ?T3 :authorship\\#ref-authid ?T4 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#country ?T2_country . ?T3 :authorship\\#authorder ?T3_authorder . ?T4 :authors\\#lname ?T4_lname . FILTER(?T2_country = 'USA' && ?T3_authorder = 2 && ?T4_lname = 'Turon') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title .\n      ?T1 :papers\\#title ?T1_title .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__inst/sparql> {\n    SELECT DISTINCT ?T2 ?T2_country WHERE {\n      ?T2 :inst\\#country ?T2_country .\n      ?T2 a :inst .\n      ?T2 :inst\\#country ?T2_country .\n      ?T2 :inst\\#country ?T2_country\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T4 ?T4_lname WHERE {\n      ?T4 :authors\\#lname ?T4_lname .\n      ?T4 :authors\\#lname ?T4_lname .\n      ?T4 a :authors .\n      ?T4 :authors\\#lname ?T4_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T3 a :authorship .\n      ?T3 :authorship\\#ref-paperid ?T1 .\n      ?T3 :authorship\\#authorder ?T3_authorder .\n      ?T3 :authorship\\#ref-instid ?T2 .\n      ?T3 :authorship\\#authorder ?T3_authorder .\n      ?T3 :authorship\\#ref-authid ?T4 .\n      ?T3 :authorship\\#authorder ?T3_authorder\n      FILTER(?T2_country = 'USA' && ?T3_authorder = 2 && ?T4_lname = 'Turon')\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "icfp_1_1250",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find the first names of all the authors who have written a paper with title containing the word 'Functional'.",
    "original_sparql": "SELECT ?T1_fname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\\#ref-authid ?T1 .  ?T1 :authors\\#fname ?T1_fname . ?T2 :papers\\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\\#ref-paperid ?T2 .  ?T1 :authors\\#fname ?T1_fname . ?T2 :papers\\#title ?T2_title . FILTER(contains (?T2_title, 'Functional')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_fname WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_fname WHERE {\n      ?T1 a :authors .\n      ?T1 :authors\\#fname ?T1_fname .\n      ?T1 :authors\\#fname ?T1_fname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_title WHERE {\n      ?T2 :papers\\#title ?T2_title .\n      ?T2 a :papers .\n      ?T2 :papers\\#title ?T2_title\n      FILTER(contains (?T2_title, 'Functional'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-authid ?T1 .\n      ?T13 :authorship\\#ref-paperid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1252",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Find the last names of all the authors that have written a paper with title containing the word 'Monadic'.",
    "original_sparql": "SELECT ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\\#ref-authid ?T1 .  ?T1 :authors\\#lname ?T1_lname . ?T2 :papers\\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\\#ref-paperid ?T2 .  ?T1 :authors\\#lname ?T1_lname . ?T2 :papers\\#title ?T2_title . FILTER(contains (?T2_title, 'Monadic')) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_lname WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__authors/sparql> {\n    SELECT DISTINCT ?T1 ?T1_lname WHERE {\n      ?T1 a :authors .\n      ?T1 :authors\\#lname ?T1_lname .\n      ?T1 :authors\\#lname ?T1_lname\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T2 ?T2_title WHERE {\n      ?T2 :papers\\#title ?T2_title .\n      ?T2 a :papers .\n      ?T2 :papers\\#title ?T2_title\n      FILTER(contains (?T2_title, 'Monadic'))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T13 a :authorship .\n      ?T13 :authorship\\#ref-authid ?T1 .\n      ?T13 :authorship\\#ref-paperid ?T2\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "icfp_1_1254",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Retrieve the title of the paper that has the largest number of authors.",
    "original_sparql": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T2 a :authorship . ?T2 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :authorship\\#authorder ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_27)) .       {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_27 ) WHERE { ?T23 a :authorship . ?T23 :authorship\\#authorder ?T23_authorder .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T2 a :authorship .\n      ?T2 :authorship\\#ref-paperid ?T1 .\n      ?T2 :authorship\\#authorder ?T2_authorder\n      FILTER(?T2_authorder = (?aggregation_T23_authorder_27))\n  }\n  {\n    SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_27 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n        ?T23 a :authorship . ?T23 :authorship\\#authorder ?T23_authorder . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "icfp_1_1255",
    "kg_name": "icfp_1",
    "split": "train",
    "question": "Which paper has the most authors? Give me the paper title.",
    "original_sparql": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T2 a :authorship . ?T2 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :authorship\\#authorder ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_51)) .       {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_51 ) WHERE { ?T23 a :authorship . ?T23 :authorship\\#authorder ?T23_authorder .        }    } }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title WHERE {\n  SERVICE <http://host.docker.internal:3030/icfp_1__papers/sparql> {\n    SELECT DISTINCT ?T1 ?T1_title WHERE {\n      ?T1 a :papers .\n      ?T1 :papers\\#title ?T1_title\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n    ?T2 a :authorship .\n      ?T2 :authorship\\#ref-paperid ?T1 .\n      ?T2 :authorship\\#authorder ?T2_authorder\n      FILTER(?T2_authorder = (?aggregation_T23_authorder_51))\n  }\n  {\n    SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_51 ) WHERE {\n      SERVICE <http://host.docker.internal:3030/icfp_1__authorship/sparql> {\n        ?T23 a :authorship . ?T23 :authorship\\#authorder ?T23_authorder . }\n      }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/authors",
        "url": "http://host.docker.internal:3030/icfp_1__authors/sparql"
      },
      {
        "class": "http://valuenet/ontop/authorship",
        "url": "http://host.docker.internal:3030/icfp_1__authorship/sparql"
      },
      {
        "class": "http://valuenet/ontop/inst",
        "url": "http://host.docker.internal:3030/icfp_1__inst/sparql"
      },
      {
        "class": "http://valuenet/ontop/papers",
        "url": "http://host.docker.internal:3030/icfp_1__papers/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  }
]