[
  {
    "id": "railway_1738",
    "kg_name": "railway",
    "split": "train",
    "question": "Show the builder of railways associated with the trains named 'Andaman Exp'.",
    "original_sparql": "SELECT ?T1_builder WHERE { ?T1 a :railway . ?T2 a :train . ?T2 :train\\#ref-railway_id ?T1 .  ?T1 :railway\\#builder ?T1_builder . ?T2 :train\\#name ?T2_name . FILTER(?T2_name = 'Andaman Exp') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_builder WHERE {\n  SERVICE <http://host.docker.internal:3030/railway__train/sparql> {\n    SELECT DISTINCT ?T2 ?T2_name WHERE {\n      ?T2 a :train .\n      ?T2 :train\\#name ?T2_name\n      FILTER(?T2_name = 'Andaman Exp')\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/railway__railway/sparql> {\n    ?T1 a :railway .\n      ?T2 :train\\#ref-railway_id ?T1 .\n      ?T1 :railway\\#builder ?T1_builder\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/railway_manage",
        "url": "http://host.docker.internal:3030/railway__railway_manage/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/railway__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/railway",
        "url": "http://host.docker.internal:3030/railway__railway/sparql"
      },
      {
        "class": "http://valuenet/ontop/manager",
        "url": "http://host.docker.internal:3030/railway__manager/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 0,
      "missing": 2,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "railway_1739",
    "kg_name": "railway",
    "split": "train",
    "question": "Show id and location of railways that are associated with more than one train.",
    "original_sparql": "SELECT ?T1_railway_id ?T2_location WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :train\\#ref-railway_id ?T2 .  ?T1 :train\\#railway_id ?T1_railway_id . ?T2 :railway\\#location ?T2_location .        } GROUP BY ?T1_railway_id ?T2_location   HAVING(count( *)  > 1)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_railway_id ?T2_location WHERE {\n  {\n    SELECT ?T1 ?T1_railway_id ?T2 ?T2_location WHERE {\n  SERVICE <http://host.docker.internal:3030/railway__train/sparql> {\n    SELECT DISTINCT ?T1 WHERE {\n      ?T1 a :train\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/railway__railway/sparql> {\n    ?T2 a :railway .\n      ?T1 :train\\#ref-railway_id ?T2 .\n      ?T1 :train\\#railway_id ?T1_railway_id .\n      ?T2 :railway\\#location ?T2_location\n  }\n    }\n  }\n}\nGROUP BY ?T1_railway_id ?T2_location   HAVING(count( *)  > 1)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/railway_manage",
        "url": "http://host.docker.internal:3030/railway__railway_manage/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/railway__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/railway",
        "url": "http://host.docker.internal:3030/railway__railway/sparql"
      },
      {
        "class": "http://valuenet/ontop/manager",
        "url": "http://host.docker.internal:3030/railway__manager/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 2,
      "federated_count": 0,
      "missing": 2,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "railway_1740",
    "kg_name": "railway",
    "split": "train",
    "question": "Show the id and builder of the railway that are associated with the most trains.",
    "original_sparql": "SELECT ?T1_railway_id (count( *) as ?aggregation_all) ?T2_builder WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :train\\#ref-railway_id ?T2 .  ?T1 :train\\#railway_id ?T1_railway_id . ?T2 :railway\\#builder ?T2_builder .        } GROUP BY ?T1_railway_id ?T2_builder  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_railway_id (count( *) as ?aggregation_all) ?T2_builder WHERE {\n  {\n    SELECT ?T1 ?T1_railway_id ?T2 ?T2_builder WHERE {\n  SERVICE <http://host.docker.internal:3030/railway__train/sparql> {\n    SELECT DISTINCT ?T1 WHERE {\n      ?T1 a :train\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/railway__railway/sparql> {\n    ?T2 a :railway .\n      ?T1 :train\\#ref-railway_id ?T2 .\n      ?T1 :train\\#railway_id ?T1_railway_id .\n      ?T2 :railway\\#builder ?T2_builder\n  }\n    }\n  }\n}\nGROUP BY ?T1_railway_id ?T2_builder  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/railway_manage",
        "url": "http://host.docker.internal:3030/railway__railway_manage/sparql"
      },
      {
        "class": "http://valuenet/ontop/train",
        "url": "http://host.docker.internal:3030/railway__train/sparql"
      },
      {
        "class": "http://valuenet/ontop/railway",
        "url": "http://host.docker.internal:3030/railway__railway/sparql"
      },
      {
        "class": "http://valuenet/ontop/manager",
        "url": "http://host.docker.internal:3030/railway__manager/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 0,
      "missing": 1,
      "extra": 0,
      "error": "result_mismatch"
    }
  },
  {
    "id": "riding_club_1741",
    "kg_name": "riding_club",
    "split": "train",
    "question": "Show the names of players and names of their coaches.",
    "original_sparql": "SELECT ?T1_player_name ?T2_coach_name WHERE { ?T1 a :player . ?T13 a :club . ?T1 :player\\#ref-club_id ?T13 .  ?T1 :player\\#player_name ?T1_player_name . ?T2 :coach\\#coach_name ?T2_coach_name . ?T2 a :coach . ?T2 :coach\\#ref-club_id ?T13 .  ?T1 :player\\#player_name ?T1_player_name . ?T2 :coach\\#coach_name ?T2_coach_name .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_player_name ?T2_coach_name WHERE {\n  SERVICE <http://host.docker.internal:3030/riding_club__club/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :club\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/riding_club__player/sparql> {\n    ?T1 a :player .\n      ?T1 :player\\#ref-club_id ?T13 .\n      ?T1 :player\\#player_name ?T1_player_name .\n      ?T1 :player\\#player_name ?T1_player_name\n  }\n  SERVICE <http://host.docker.internal:3030/riding_club__coach/sparql> {\n    ?T2 :coach\\#coach_name ?T2_coach_name .\n      ?T2 a :coach .\n      ?T2 :coach\\#ref-club_id ?T13 .\n      ?T2 :coach\\#coach_name ?T2_coach_name\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/riding_club__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/match_result",
        "url": "http://host.docker.internal:3030/riding_club__match_result/sparql"
      },
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/riding_club__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/coach",
        "url": "http://host.docker.internal:3030/riding_club__coach/sparql"
      },
      {
        "class": "http://valuenet/ontop/player_coach",
        "url": "http://host.docker.internal:3030/riding_club__player_coach/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "riding_club_1743",
    "kg_name": "riding_club",
    "split": "train",
    "question": "Show the names and genders of players with a coach starting after 2011.",
    "original_sparql": "SELECT ?T1_player_name ?T1_gender WHERE { ?T1 a :player . ?T2 a :player_coach . ?T2 :player_coach\\#ref-player_id ?T1 .  ?T1 :player\\#player_name ?T1_player_name . ?T1 :player\\#gender ?T1_gender . ?T2 :player_coach\\#starting_year ?T2_starting_year . FILTER(?T2_starting_year > 2011) .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_player_name ?T1_gender WHERE {\n  SERVICE <http://host.docker.internal:3030/riding_club__player/sparql> {\n    SELECT DISTINCT ?T1 ?T1_gender ?T1_player_name WHERE {\n      ?T1 a :player .\n      ?T1 :player\\#player_name ?T1_player_name .\n      ?T1 :player\\#gender ?T1_gender\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/riding_club__player_coach/sparql> {\n    ?T2 a :player_coach .\n      ?T2 :player_coach\\#ref-player_id ?T1 .\n      ?T2 :player_coach\\#starting_year ?T2_starting_year\n      FILTER(?T2_starting_year > 2011)\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/riding_club__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/match_result",
        "url": "http://host.docker.internal:3030/riding_club__match_result/sparql"
      },
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/riding_club__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/coach",
        "url": "http://host.docker.internal:3030/riding_club__coach/sparql"
      },
      {
        "class": "http://valuenet/ontop/player_coach",
        "url": "http://host.docker.internal:3030/riding_club__player_coach/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 3,
      "federated_count": 3,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "riding_club_1744",
    "kg_name": "riding_club",
    "split": "train",
    "question": "Show the names of players and names of their coaches in descending order of the votes of players.",
    "original_sparql": "SELECT ?T1_player_name ?T2_coach_name WHERE { ?T1 a :player . ?T13 a :club . ?T1 :player\\#ref-club_id ?T13 .  ?T1 :player\\#player_name ?T1_player_name . ?T2 :coach\\#coach_name ?T2_coach_name . ?T1 :player\\#votes ?T1_votes . ?T2 a :coach . ?T2 :coach\\#ref-club_id ?T13 .  ?T1 :player\\#player_name ?T1_player_name . ?T2 :coach\\#coach_name ?T2_coach_name . ?T1 :player\\#votes ?T1_votes .        }  ORDER BY DESC (?T1_votes)",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_player_name ?T2_coach_name WHERE {\n  SERVICE <http://host.docker.internal:3030/riding_club__club/sparql> {\n    SELECT DISTINCT ?T13 WHERE {\n      ?T13 a :club\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/riding_club__player/sparql> {\n    ?T1 a :player .\n      ?T1 :player\\#ref-club_id ?T13 .\n      ?T1 :player\\#player_name ?T1_player_name .\n      ?T1 :player\\#votes ?T1_votes .\n      ?T1 :player\\#player_name ?T1_player_name .\n      ?T1 :player\\#votes ?T1_votes\n  }\n  SERVICE <http://host.docker.internal:3030/riding_club__coach/sparql> {\n    ?T2 :coach\\#coach_name ?T2_coach_name .\n      ?T2 a :coach .\n      ?T2 :coach\\#ref-club_id ?T13 .\n      ?T2 :coach\\#coach_name ?T2_coach_name\n  }\n}\nORDER BY DESC (?T1_votes)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/riding_club__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/match_result",
        "url": "http://host.docker.internal:3030/riding_club__match_result/sparql"
      },
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/riding_club__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/coach",
        "url": "http://host.docker.internal:3030/riding_club__coach/sparql"
      },
      {
        "class": "http://valuenet/ontop/player_coach",
        "url": "http://host.docker.internal:3030/riding_club__player_coach/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 0,
      "federated_count": 0,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "riding_club_1745",
    "kg_name": "riding_club",
    "split": "train",
    "question": "How many coaches does each club has? List the club id, name and the number of coaches.",
    "original_sparql": "SELECT ?T1_club_id ?T1_club_name (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :coach . ?T2 :coach\\#ref-club_id ?T1 .  ?T1 :club\\#club_id ?T1_club_id . ?T1 :club\\#club_name ?T1_club_name .        } GROUP BY ?T1_club_id ?T1_club_name",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_club_id ?T1_club_name (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T1_club_id ?T1_club_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/riding_club__club/sparql> {\n    SELECT DISTINCT ?T1 ?T1_club_id ?T1_club_name WHERE {\n      ?T1 a :club .\n      ?T1 :club\\#club_id ?T1_club_id .\n      ?T1 :club\\#club_name ?T1_club_name\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/riding_club__coach/sparql> {\n    ?T2 a :coach .\n      ?T2 :coach\\#ref-club_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_club_id ?T1_club_name",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/club",
        "url": "http://host.docker.internal:3030/riding_club__club/sparql"
      },
      {
        "class": "http://valuenet/ontop/match_result",
        "url": "http://host.docker.internal:3030/riding_club__match_result/sparql"
      },
      {
        "class": "http://valuenet/ontop/player",
        "url": "http://host.docker.internal:3030/riding_club__player/sparql"
      },
      {
        "class": "http://valuenet/ontop/coach",
        "url": "http://host.docker.internal:3030/riding_club__coach/sparql"
      },
      {
        "class": "http://valuenet/ontop/player_coach",
        "url": "http://host.docker.internal:3030/riding_club__player_coach/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 2,
      "federated_count": 2,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1747",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which city has the most addresses? List the city name, number of addresses, and city id.",
    "original_sparql": "SELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) ?T2_city_id WHERE { ?T1 a :city . ?T2 a :address . ?T2 :address\\#ref-city_id ?T1 .  ?T1 :city\\#city ?T1_city . ?T2 :address\\#city_id ?T2_city_id .        } GROUP BY ?T1_city ?T2_city_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) ?T2_city_id WHERE {\n  {\n    SELECT ?T1 ?T1_city ?T2 ?T2_city_id WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__city/sparql> {\n    SELECT DISTINCT ?T1 ?T1_city WHERE {\n      ?T1 a :city .\n      ?T1 :city\\#city ?T1_city\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__address/sparql> {\n    ?T2 a :address .\n      ?T2 :address\\#ref-city_id ?T1 .\n      ?T2 :address\\#city_id ?T2_city_id\n  }\n    }\n  }\n}\nGROUP BY ?T1_city ?T2_city_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "sakila_1_1749",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which film is rented at a fee of 0.99 and has less than 3 in the inventory? List the film title and id.",
    "original_sparql": "SELECT DISTINCT ?T1_title ?T1_film_id WHERE { ?T1 a :film . ?T1 :film\\#title ?T1_title . ?T1 :film\\#film_id ?T1_film_id . ?T1 :film\\#rental_rate ?T1_rental_rate . FILTER(?T1_rental_rate = 0.99) . FILTER (?T1_title in (?T2_title)) . FILTER (?T1_film_id in (?T2_film_id)) .   ?T2 a :film . ?T3 a :inventory . ?T3 :inventory\\#ref-film_id ?T2 .  ?T2 :film\\#title ?T2_title . ?T2 :film\\#film_id ?T2_film_id .     GROUP BY ?T2_title ?T2_film_id   HAVING(count( *)  < 3)      }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT DISTINCT ?T1_title ?T1_film_id WHERE {\n  {\n    SELECT ?T1 ?T1_film_id ?T1_rental_rate ?T1_title ?T2 ?T2_film_id ?T2_title ?T3 WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__film/sparql> {\n    SELECT DISTINCT ?T1_film_id ?T1_title ?T2 ?T2_film_id ?T2_title WHERE {\n      ?T1 a :film .\n      ?T1 :film\\#title ?T1_title .\n      ?T1 :film\\#film_id ?T1_film_id .\n      ?T1 :film\\#rental_rate ?T1_rental_rate .\n      ?T2 a :film .\n      ?T2 :film\\#title ?T2_title .\n      ?T2 :film\\#film_id ?T2_film_id\n      FILTER(?T1_rental_rate = 0.99)\n      FILTER (?T1_title in (?T2_title))\n      FILTER (?T1_film_id in (?T2_film_id))\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__inventory/sparql> {\n    ?T3 a :inventory .\n      ?T3 :inventory\\#ref-film_id ?T2\n  }\n    }\n  }\n}\nGROUP BY ?T2_title ?T2_film_id   HAVING(count( *)  < 3)",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "error": "execution_failed"
    }
  },
  {
    "id": "sakila_1_1752",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Count the number of cities in Australia.",
    "original_sparql": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :country . ?T1 :city\\#ref-country_id ?T2 .  ?T2 :country\\#country ?T2_country . FILTER(?T2_country = 'Australia') .        }",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT (count( *) as ?aggregation_all) WHERE {\n  {\n    SELECT ?T1 ?T2 ?T2_country WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__city/sparql> {\n    SELECT DISTINCT ?T1 WHERE {\n      ?T1 a :city\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__country/sparql> {\n    ?T2 a :country .\n      ?T1 :city\\#ref-country_id ?T2 .\n      ?T2 :country\\#country ?T2_country\n      FILTER(?T2_country = 'Australia')\n  }\n    }\n  }\n}",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": false,
      "original_count": 1,
      "federated_count": 1,
      "missing": 1,
      "extra": 1,
      "error": "result_mismatch"
    }
  },
  {
    "id": "sakila_1_1755",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which film has the most number of actors or actresses? List the film name, film id and description.",
    "original_sparql": "SELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id ?T1_description WHERE { ?T1 a :film . ?T2 a :film_actor . ?T2 :film_actor\\#ref-film_id ?T1 .  ?T1 :film\\#title ?T1_title . ?T1 :film\\#film_id ?T1_film_id . ?T1 :film\\#description ?T1_description .        } GROUP BY ?T1_title ?T1_film_id ?T1_description  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id ?T1_description WHERE {\n  {\n    SELECT ?T1 ?T1_description ?T1_film_id ?T1_title ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__film/sparql> {\n    SELECT DISTINCT ?T1 ?T1_description ?T1_film_id ?T1_title WHERE {\n      ?T1 a :film .\n      ?T1 :film\\#title ?T1_title .\n      ?T1 :film\\#film_id ?T1_film_id .\n      ?T1 :film\\#description ?T1_description\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__film_actor/sparql> {\n    ?T2 a :film_actor .\n      ?T2 :film_actor\\#ref-film_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_title ?T1_film_id ?T1_description  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  },
  {
    "id": "sakila_1_1757",
    "kg_name": "sakila_1",
    "split": "train",
    "question": "Which film actor (actress) starred the most films? List his or her first name, last name and actor id.",
    "original_sparql": "SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name ?T1_actor_id WHERE { ?T1 a :actor . ?T2 a :film_actor . ?T2 :film_actor\\#ref-actor_id ?T1 .  ?T1 :actor\\#first_name ?T1_first_name . ?T1 :actor\\#last_name ?T1_last_name . ?T1 :actor\\#actor_id ?T1_actor_id .        } GROUP BY ?T1_first_name ?T1_last_name ?T1_actor_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "federated_sparql": "PREFIX : <http://valuenet/ontop/>\n\nSELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name ?T1_actor_id WHERE {\n  {\n    SELECT ?T1 ?T1_actor_id ?T1_first_name ?T1_last_name ?T2 WHERE {\n  SERVICE <http://host.docker.internal:3030/sakila_1__actor/sparql> {\n    SELECT DISTINCT ?T1 ?T1_actor_id ?T1_first_name ?T1_last_name WHERE {\n      ?T1 a :actor .\n      ?T1 :actor\\#first_name ?T1_first_name .\n      ?T1 :actor\\#last_name ?T1_last_name .\n      ?T1 :actor\\#actor_id ?T1_actor_id\n    }\n  }\n  SERVICE <http://host.docker.internal:3030/sakila_1__film_actor/sparql> {\n    ?T2 a :film_actor .\n      ?T2 :film_actor\\#ref-actor_id ?T1\n  }\n    }\n  }\n}\nGROUP BY ?T1_first_name ?T1_last_name ?T1_actor_id  ORDER BY DESC (?aggregation_all) LIMIT 1",
    "endpoints": [
      {
        "class": "http://valuenet/ontop/film_actor",
        "url": "http://host.docker.internal:3030/sakila_1__film_actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/country",
        "url": "http://host.docker.internal:3030/sakila_1__country/sparql"
      },
      {
        "class": "http://valuenet/ontop/payment",
        "url": "http://host.docker.internal:3030/sakila_1__payment/sparql"
      },
      {
        "class": "http://valuenet/ontop/customer",
        "url": "http://host.docker.internal:3030/sakila_1__customer/sparql"
      },
      {
        "class": "http://valuenet/ontop/inventory",
        "url": "http://host.docker.internal:3030/sakila_1__inventory/sparql"
      },
      {
        "class": "http://valuenet/ontop/category",
        "url": "http://host.docker.internal:3030/sakila_1__category/sparql"
      },
      {
        "class": "http://valuenet/ontop/film_category",
        "url": "http://host.docker.internal:3030/sakila_1__film_category/sparql"
      },
      {
        "class": "http://valuenet/ontop/rental",
        "url": "http://host.docker.internal:3030/sakila_1__rental/sparql"
      },
      {
        "class": "http://valuenet/ontop/city",
        "url": "http://host.docker.internal:3030/sakila_1__city/sparql"
      },
      {
        "class": "http://valuenet/ontop/actor",
        "url": "http://host.docker.internal:3030/sakila_1__actor/sparql"
      },
      {
        "class": "http://valuenet/ontop/film",
        "url": "http://host.docker.internal:3030/sakila_1__film/sparql"
      },
      {
        "class": "http://valuenet/ontop/address",
        "url": "http://host.docker.internal:3030/sakila_1__address/sparql"
      }
    ],
    "validation": {
      "valid": true,
      "original_count": 1,
      "federated_count": 1,
      "missing": 0,
      "extra": 0
    }
  }
]